{
  "source_file": "admissions.galgotiasuniversity.edu.in_Home_raw_2025-08-10-20-22-14.txt",
  "structured_data": {
    "admission_requirements": {
      "summary": "This document outlines a five-step application process. Applicants must first register, then verify their email and mobile number. The next steps involve filling out the online application, uploading necessary documents including additional and educational details along with a photo, and finally paying the application fee of INR 1200 online.",
      "raw_content": "• STEP 01Register yourself\nRegister yourself\n• STEP 02Verify Email and Mobile\nVerify Email and Mobile\n• STEP 03Fill Application Online\n• STEP 04Upload Documents (Complete Additional details/Educational Details, Upload photo & Documents)\nUpload Documents (Complete Additional details/Educational Details, Upload photo & Documents)\n• STEP 05Pay Application fee Online(Application fee INR 1200/-)\nPay Application fee Online(Application fee INR 1200/-)"
    },
    "general_info": {
      "summary": "This document contains various snippets of information related to Galgotias University. It includes prompts for user registration and identity verification via OTP, highlights the university's strengths such as its top ranking, diverse programs, and merit-based scholarships, and mentions its alignment with national and state development visions.  The text also details specific schools within the university, presents impressive statistics on students, campus size, legacy, recruiters, and alumni, and notes achievements like awards and high salary packages.  Additionally, it includes operational messages regarding application processing, lead management, data handling (CSV/Excel downloads, unsubscribing, swapping, deletion, archiving), and a source URL for international applications.",
      "raw_content": "Register Now to Get Information.\nFor your security, we need to verify your identity. we have sent an OTP on registered email id and mobile number. Please enter the OTP below and proceed for password change.\nWhy Choose Galgotias University?\n• Top-ranked private university in India\n• Wide range of programs\n• Career counseling and guidance\n• Diverse student community\n• Merit-based scholarships\nAn Honour Beyond Words. A Legacy Beyond Boundaries.\nWe will continue to carry forward the vision of our Hon’ble Prime Minister Shri Narendra Modi Ji of\nmaking India a Vishvaguru & Viksit Bharat and the dream of our Dynamic Leader, Hon’ble Chief Minister\nof UP, Shri Yogi Aditya Nath Ji of making the State of Uttar Pradesh a truly Global Knowledge\nSchool of Computing Science & Engineering\nSchool of Computer Applications & Technology\nSchool of Liberal Education\nSchool of Media & Communication Studies\nSchool of Hospitality & Tourism\nJoin a legacy of transformative research and innovation that spans decades and continents, starting with your education at Galgotias University.\n• 40000Brilliant Students\n• 52Acre Campus\n• 25Years of Legacy\n• 800Recruiters\n• 20000Alumni Success Stories\nAt the School of Galgotias, excellence is what we strive to achieve. Our infrastructure,faculty, vision, ideals, and teaching methods make us a premier university.\n• 300Awards\n• 1.5Highest Package (International)\n• 44Highest Package (National)\nEmotional Journey Of Successful Galgotians\nHarshit kaushik\nHarshit Johri\nPlease check your inbox we have sent you a link,Click on it to reset your password\nDo you want to copy the form Form-name.\nYou have filtered Paid Applicants\nResubmission Logic added successfully !\nThis will result in :\n• Re-assignment of any upcoming follow-ups.\nAre you sure you want to proceed?\nDownload As CSV Excel\nThis Lead/Applicant is unsubscribed from your mailing list hence not receiving any Emails that you send. Do you want to Re-Subscribe this Lead/Applicant?\nYou are about to swap to . Are you sure you want to proceed?\nYou are about to swap to .Are you sure you want to proceed?\nAll the Below mentioned data points will be along with the {{module}}.\nNote: These Data Points will also be from the Publisher Panel.\nPlease note that the data once deleted is not recoverable.\nPlease Note : These records once archived will only be accessible in your archival directory.\nSource: https://admissions.galgotiasuniversity.edu.in/international-application-form"
    }
  }
}