{
  "source_file": "admissions.niu.edu.in_Home_raw_2025-08-10-18-50-22.txt",
  "structured_data": {
    "general_info": {
      "summary": "The provided text contains various system messages and instructions. It includes prompts for identity verification via OTP, guidance on using Noida International University's Query Management System for inquiries, steps for resetting passwords and filling application forms, notifications about applicant filtering and resubmission logic, options for downloading data, information regarding unsubscribed leads, confirmation prompts for actions like swapping and proceeding, details about data points associated with modules, and important notes about data deletion and archiving. A URL for the Noida International University admissions portal is also included.",
      "raw_content": "For your security, we need to verify your identity. we have sent an OTP on registered email id and mobile number. Please enter the OTP below and proceed for password change.\n• Noida International University Query Management System: Applicants are strongly advised to use the Query Management System (NIU-QMS), rather than an email, to get a quick response.\nRegister and verify your email IDClick on [Any Queries? Ask US] in your dashboardSelect the query category and submit your query\n• Register and verify your email ID\n• Click on [Any Queries? Ask US] in your dashboard\n• Select the query category and submit your query\nFill Application Form Online\nPlease check your inbox we have sent you a link,Click on it to reset your password\nDo you want to copy the form Form-name.\nYou have filtered Paid Applicants\nResubmission Logic added successfully !\nThis will result in :\n• Re-assignment of any upcoming follow-ups.\nAre you sure you want to proceed?\nDownload As CSV Excel\nThis Lead/Applicant is unsubscribed from your mailing list hence not receiving any Emails that you send. Do you want to Re-Subscribe this Lead/Applicant?\nYou are about to swap to . Are you sure you want to proceed?\nYou are about to swap to .Are you sure you want to proceed?\nAll the Below mentioned data points will be along with the {{module}}.\nNote: These Data Points will also be from the Publisher Panel.\nPlease note that the data once deleted is not recoverable.\nPlease Note : These records once archived will only be accessible in your archival directory.\nSource: https://admissions.niu.edu.in/?_gl=1*1kdgkjg*_gcl_au*MTE2ODc1NDgyLjE3NTQ3NjQ2NjE.*_ga*ODY0ODk3MTk2LjE3NTQ3NjQ2NjA.*_ga_4XRL39YV04*czE3NTQ4MjcxODckbzYkZzEkdDE3NTQ4MjkwNTEkajU4JGwwJGgw&_ga=2.61514476.1901837692.1754764660-864897196.1754764660"
    }
  }
}