{
  "source_file": "amity.edu_Amity_University_raw_2025-08-10-18-42-21.txt",
  "structured_data": {
    "general_info": {
      "summary": "The Amity Education Group, a not-for-profit organization with over three decades of history, currently serves over 200,000 students across 400 programs in 80 disciplines, spanning 13 universities and 28 schools. The group emphasizes thought leadership, innovation, and research, aiming to address global challenges. Amity boasts an impressive placement record with over 150,000 alumni working in top global organizations and attracting over 500 corporate partners for recruitment.",
      "raw_content": "The not-for-profit Amity Education Group was established more than three decades ago. Today the Group is home to over 2,00,000 brilliant students pursuing over 400 Programmes in 80 diverse disciplines across 13 Universities and 28 Schools and Pre-Schools.\nLEADERSHIP\nAmity University Logo\n• LEADERSHIP\n• Amity University Logo\nAt Amity, our mission is to create centers of thought leadership across the world where faculty, scientists and brilliant students can explore and expand the frontiers of knowledge in an environment that encourages research & innovation.\nAmity’s placement record follows a tradition of excellence wherein, over 150,000 Amity alumni have successfully gone on to work in top organisations worldwide. An achievement whose testimony lies in over 500 top corporates including Fortune 500 employers, having visited the Campus for recruitments.\nCORPORATE PARTNERS\nAMITY LINKEDIN PARTNERSHIPS\n• CORPORATE PARTNERS\n• AMITY LINKEDIN PARTNERSHIPS\nAt Amity, we believe that education must inspire innovation. It must find solutions for pressing issues affecting humanity, at large. That's why, at Amity, the faculty, research scholars and students are carrying out path-breaking research across diverse disciplines. Together they are shaping the next level of education.\nUNIVERSITY FEST\nDIVERSITY\n• UNIVERSITY FEST\n• DIVERSITY\n3 CONTINENT PROGRAMMES\n• 3 CONTINENT PROGRAMMES\nSource: https://amity.edu/noida/diversity.aspx"
    }
  }
}