{
  "source_file": "amity.edu_amity_edu_raw_2025-08-10-18-42-20.txt",
  "structured_data": {
    "general_info": {
      "summary": "Amity School of Fashion Technology hosted a talk show on \"Factors Influencing Fashion\" on December 9, 2022, featuring Ms. Karen Heard, International Recruitment and Development Coordinator from the University of Arts London. Ms. Heard provided students with a global perspective on the fashion industry, discussing expectations for young professionals, career and study opportunities, portfolio management, the fashion cycle, and the social and environmental impact of fashion. The event was welcomed and introduced by Prof. (Dr.) Pradeep Joshi and attended by faculty and final-year students.",
      "raw_content": "Report of the Talk show on ‘ Factors Influencing Fashion ’ Talk - Show on “ Factors Influencing Fashion ” had been organized by Amity school of Fashion Technology under Faculty of Applied Arts/Fine Arts/Performing Arts/Visual Arts on 9 th Dec 2022 at E - 2 Auditorium at 1 pm Ms Karen Heard (International Recruitment and Development coordinator, University of Arts london) had been invited for this Talk Show and to provide a Global perspective to students Ms Karen Heard was welcomed by Prof. (Dr.) Pradeep Joshi, Group Addl. Pro Vic e Chancellor ,Director General & Dean (Applied Arts/Fine Arts/Performing Arts/Visual Arts) Amity University . Ms Karen Heard was introduced to the Programs offered by ASFT and the roadmap ahead for students Prof. (Dr.) Pradeep Joshi , Group Addl. Pro Vice Chancellor ,Director General & Dean (Applied Arts/Fine Arts/Performing Arts/Visual Arts) making the opening remarks\nProf. (Dr.) Pradeep Joshi , Group Addl. Pro Vice Chancellor ,Director General & Dean (Applied Arts/Fine Arts/Performing Arts/Visual Arts) welcoming Ms Karen Ms Karen opened the session by telling the students about the expectations of the Global Fashion Industry from young profe ssionals and the immense opportunities offered in global fashion industry. She made detailed presentation on Factors Influencing Fashion ,Portfolio Management, Fashion Cycle, Lifespan & Consumer Adopters , Social & Environmental Impact of Fashion , Information about study opportunities, career opportunities and growing industries , Information for selection of Country/ Course & it’s requirements , Factors Influencing Fashion Prof. (Dr.) Pradeep Joshi actively contributed in the Talk - Show. The talk sh ow was attended by Faculty Members and Final year students who benefitted tremendously from the Talk show"
    }
  }
}