{
  "source_file": "hcidhaka.gov.in_hcidhaka_gov_in_raw_2025-08-10-18-32-32 (1).txt",
  "structured_data": {
    "visa_requirements_tourist": {
      "summary": "This document outlines the required documents for a Tourist Visa application at the High Commission of India in Dhaka. Applicants need a valid passport with at least six months of validity and two blank pages, along with old passports. Essential documents include a recent passport-size photo, a copy of the National ID Card or Birth Certificate, proof of residence (e.g., utility bill), proof of financial soundness (e.g., foreign currency endorsement, bank statement, or travel card), and proof of profession (e.g., Government Order, employer certificate, business registration, student ID, or retirement papers).",
      "raw_content": "1 DOCUMENTS REQUIRED FOR VISA High Commission of India Dhaka **** VISA DOCUMENTS: CATEGORY- WISE 1. TOURIST VISA 1. Passport , in original, with a minimum validity of six months as on the date of submission of application for visa. The passport should have at least two (2) blank pages. 2. Old passports must be submitted with the application form. 3. One recent passport-size colour photograph (2X2) depicting full face with white background. 4. A copy of National ID Card OR Birth Certificate( whichever applicable) 5. Proof of Residence : A copy of the electricity bill OR gas bill OR landline telephone bill (not less than 6 months old) 6. Proof of Financial soundness : Endorsement of foreign currency equivalent to US$150/- per applicant (Endorsement should not be older than three months at the time of submission) OR Updated summary Bank statement showing sufficient funds OR copy of international credit card or Travel card (Example - SBI Travel card). 7. Proof of Profession :  Government Order Copy (If the applicant is a serving government employee) OR  Certificate from the employer( If the applicant is a private company employee). OR  A copy of the Registration granted to the Business establishment by the Government of Bangladesh( In case of self employed persons ). OR  A copy of Identity card from the educational institution (If the applicant is a student) OR\n2 DOCUMENTS REQUIRED FOR VISA  A copy of the retirement papers ( If the applicant is a retired government employee). *****"
    },
    "visa_requirements_transit": {
      "summary": "This document outlines the required documents for a transit visa, which include an original passport valid for at least six months with two blank pages, old passports, a recent passport-size photograph with a white background, a copy of a National ID or Birth Certificate, proof of residence via a utility bill, proof of financial soundness (e.g., currency endorsement, bank statement, or credit/travel card), and proof of profession (depending on employment status or student/retired status). Additionally, a valid visa for the third country, a confirmed onward journey ticket, and hotel booking in the third country are necessary.",
      "raw_content": "3 DOCUMENTS REQUIRED FOR VISA 2. TRANSIT VISA 1. Passport , in original, with a minimum validity of six months as on the date of submission of application for visa. The passport should have at least two (2) blank pages. 2. Old passports must be submitted with the application form. 3. One recent passport-size colour photograph (2X2) depicting full face with white background. 4. A copy of National ID Card OR Birth Certificate( whichever applicable) 5. Proof of Residence : A copy of the electricity bill OR gas bill OR landline telephone bill (not less than 6 months old) 6. Proof of Financial soundness : Endorsement of foreign currency equivalent to US$150/- per applicant (Endorsement should not be older than three months at the time of submission) OR Updated summary Bank statement showing sufficient funds OR copy of international credit card or Travel card (Example - SBI Travel card). 7. Proof of Profession :  Government Order Copy (If the applicant is a serving government employee) OR  Certificate from the employer( If the applicant is a private company employee). OR  A copy of the Registration granted to the Business establishment by the Government of Bangladesh( In case of self employed persons ). OR  A copy of Identity card from the educational institution (If the applicant is a student) OR  A copy of the retirement papers ( If the applicant is a retired government employee). 8. Valid visa required from the third country 9. Confirmed ticket for onward journey 10. Hotel booking in third country ****"
    },
    "visa_requirements_business": {
      "summary": "This document outlines the extensive requirements for obtaining a business visa, detailing necessary documentation for various applicant categories. Key requirements include a valid passport, photographs, proof of residence and financial soundness, and specific proofs of profession or business activities. Additional documents are needed for importers/exporters, company representatives, and those involved in trade exhibitions or tourism. Family members of business visa holders applying separately also have specific enclosure requirements.",
      "raw_content": "4 DOCUMENTS REQUIRED FOR VISA 3. BUSINESS VISA 1. Passport , in original, with a minimum validity of six months as on the date of submission of application for visa. The passport should have at least two (2) blank pages. 2. Old passports must be submitted with the application form 3. One recent passport-size colour photograph (2X2) depicting full face with white background. 4. A copy of National ID Card OR Birth Certificate( whichever applicable) 5. Proof of Residence : A copy of the electricity bill OR gas bill OR landline telephone bill (not less than 6 months old) 6. Proof of Financial soundness : Endorsement of foreign currency equivalent to US$150/- per applicant (Endorsement should not be older than three months at the time of submission) OR Updated summary Bank statement showing sufficient funds OR copy of international credit card or Travel card (Example - SBI Travel card). 7. Proof of Profession :  Government Order Copy (If the applicant is a serving government employee) OR  Certificate from the employer( If the applicant is a private company employee). OR  A copy of the Registration granted to the Business establishment by the Government of Bangladesh( In case of self employed persons ). OR  A copy of Identity card from the educational institution (If the applicant is a student) OR  A copy of the retirement papers ( If the applicant is a retired government employee). 8. A letter from the company/ firm in Bangladesh giving details of the applicant, his/her designation and the purpose of the visit(details of Name, address and contact numbers of applicant's business establishment in Bangladesh. 9. A letter from the sponsoring/inviting organization/company from India.\n5 DOCUMENTS REQUIRED FOR VISA 10. A copy/letter of recommendation/updated membership from a recognized Chamber of Commerce or Business Association in Bangladesh 11. A copy of valid Trade License with Tax Identification Number (TIN) 12. A copy of statement of the bank account of the company of the applicant (for last six months) 13. IF the applicant is an importer/exporter then the following are required: • Import Registration Certificate (IRC) & Export Registration Certificate (ERC). • A copy of the Letter of Credit(LC)/Telegraphic transfer(TT) (in case of exports) pertaining either to the last three business transactions or the impending business transaction with an Indian company 14. IF employed in a company/private firm , a copy of the Employment contract (showing period of contract, designation and monthly salary of the applicant). 15. IF the applicant is participating in or visiting a trade/business exhibition/fair in India then details of the nature of participation and a copy of the invitation letter from the exhibition/fair authorities or Federation/Chamber concerned has to be submitted. 16. IF the applicant represents a limited company then a Memorandum of Articles of Association and Certificate of incorporation is to be submitted. 17. IF the applicant representing branch office/Liaison office of a company in Bangladesh then a relevant copy of approval from the Board of Investment under Prime Minister’s office is to be submitted. 18. IF the application is from Tourism Agencies then their permit issued by the Ministry of Tourism, Bangladesh and updated membership of Association of Travel Agents of Bangladesh (ATAB) is to be submitted. 19. Family members of business visa holders applying for entry visa should enclose copy of the visa of the Principal Visa holder , if applying separately ****"
    },
    "visa_requirements_medical": {
      "summary": "This document outlines the requirements for obtaining a medical visa, listing a total of 12 documents and conditions. Key requirements include a valid passport, old passports, a passport-sized photograph, proof of identity (National ID or Birth Certificate), proof of residence (utility bill), proof of financial soundness (foreign currency endorsement, bank statement, or credit/travel card), and proof of profession (depending on employment status). Specific medical documentation, including local doctor's reports and an appointment letter from an Indian hospital, is also mandatory. For official passport holders, it's recommended to also obtain a medical attendant visa. Minors must be accompanied by a parent or guardian. Organ transplantation cases require clearance from the Law Ministry and Ministry of Foreign Affairs.",
      "raw_content": "6 DOCUMENTS REQUIRED FOR VISA 4. MEDICAL VISA 1. Passport , in original, with a minimum validity of six months as on the date of submission of application for visa. The passport should have at least two (2) blank pages. 2. Old passports must be submitted with the application form. 3. One recent passport-size colour photograph (2X2) depicting full face with white background. 4. A copy of National ID Card OR Birth Certificate( whichever applicable) 5. Proof of Residence : A copy of the electricity bill OR gas bill OR landline telephone bill (not less than 6 months old) 6. Proof of Financial soundness : Endorsement of foreign currency equivalent to US$150/- per applicant (Endorsement should not be older than three months at the time of submission) OR Updated summary Bank statement showing sufficient funds OR copy of international credit card or Travel card (Example - SBI Travel card). 7. Proof of Profession :  Government Order Copy (If the applicant is a serving government employee) OR  Certificate from the employer( If the applicant is a private company employee). OR  A copy of the Registration granted to the Business establishment by the Government of Bangladesh( In case of self employed persons ). OR  A copy of Identity card from the educational institution (If the applicant is a student) OR  A copy of the retirement papers ( If the applicant is a retired government employee). 8. Necessary medical documents in support of the ailments/disease from local doctor along with medical reports 9. Valid appointment letter from Indian hospital mentioning/ highlighting name & passport details of applicant & attendant, date of appointment, doctor etc. 7 DOCUMENTS REQUIRED FOR VISA 10. For Official passports holders also, it is advisable to take medical visa (MV) as well as medical attendant (MX-visa). 11. Minor applicants have to be compulsorily accompanied by parent/guardian as medical attendant. 12. Necessary clearance from Law Ministry & Ministry of Foreign Affairs (MOFA) in case of Organ Transplantation cases (viz., Kidney, Liver, Bone- marrow etc.) ****"
    },
    "visa_requirements_student": {
      "summary": "This document outlines the required documentation for a student visa application. Key requirements include a passport with at least six months validity and two blank pages, old passports, a recent passport-size photograph, a copy of the National ID Card or Birth Certificate, proof of residence (such as an utility bill), proof of financial soundness (equivalent to US$150 per applicant or bank statements), and proof of profession, which varies depending on employment status or if self-employed. Additionally, a letter of admission from an Indian educational institution, bank solvency papers of the guarantor, and copies of previous visas or resident permits (for extensions) are necessary.",
      "raw_content": "8 DOCUMENTS REQUIRED FOR VISA 5. STUDENT VISA 1. Passport , in original, with a minimum validity of six months as on the date of submission of application for visa. The passport should have at least two (2) blank pages. 2. Old passports must be submitted with the application form. 3. One recent passport-size colour photograph (2X2) depicting full face with white background. 4. A copy of National ID Card OR Birth Certificate( whichever applicable) 5. Proof of Residence : A copy of the electricity bill OR gas bill OR landline telephone bill (not less than 6 months old) 6. Proof of Financial soundness : Endorsement of foreign currency equivalent to US$150/- per applicant (Endorsement should not be older than three months at the time of submission) OR Updated summary Bank statement showing sufficient funds OR copy of international credit card or Travel card (Example - SBI Travel card). 7. Proof of Profession :  Government Order Copy (If the applicant is a serving government employee) OR  Certificate from the employer( If the applicant is a private company employee) OR A salary slip from the employing organization) OR  A copy of the Registration granted to the Business establishment by the Government of Bangladesh( In case of self employed persons ). OR  A copy of Identity card from the educational institution (If the applicant is a student). OR  A copy of the retirement papers ( If the applicant is a retired government employee). 8. Letter of admission from Government or Government approved private Universities, colleges and other educational institutions (commonly known as bonafide letter ) in India. 9. Bank solvency papers of the guarantor 10. Copies of old visa/Resident Permit’s copy(if applying for an extension) ****"
    },
    "visa_requirements_muktijoddha": {
      "summary": "This document outlines the nine required items for a Muktijoddha visa application. These include a valid passport with blank pages, old passports, a recent passport-sized photograph, a copy of National ID or Birth Certificate, proof of residence (e.g., utility bill), proof of financial soundness (e.g., foreign currency endorsement, bank statement, or travel card), proof of profession (depending on employment status or student status), a Muktijoddha Certificate, and a copy of the Gazette if available.",
      "raw_content": "9 DOCUMENTS REQUIRED FOR VISA 6. MUKTIJODDHA 1. Passport , in original, with a minimum validity of six months as on the date of submission of application for visa. The passport should have at least two (2) blank pages. 2. Old passports must be submitted with the application form. 3. One recent passport-size colour photograph (2X2) depicting full face with white background. 4. A copy of National ID Card OR Birth Certificate( whichever applicable) 5. Proof of Residence : A copy of the electricity bill OR gas bill OR landline telephone bill (not less than 6 months old) 6. Proof of Financial soundness : Endorsement of foreign currency equivalent to US$150/- per applicant (Endorsement should not be older than three months at the time of submission) OR Updated summary Bank statement showing sufficient funds OR copy of international credit card or Travel card (Example - SBI Travel card). 7. Proof of Profession :  Government Order Copy (If the applicant is a serving government employee) OR  Certificate from the employer( If the applicant is a private company employee). OR  A copy of the Registration granted to the Business establishment by the Government of Bangladesh( In case of self employed persons ). OR  A copy of Identity card from the educational institution (If the applicant is a student) OR  A copy of the retirement papers ( If the applicant is a retired government employee). 8. Muktijoddha Certificate 9. Copy of Gazette (if available) ****\n-- Page 10 --"
    },
    "visa_requirements_entry": {
      "summary": "This document outlines the required documents for obtaining an entry visa, specifying a list of ten essential items. These include a valid passport with sufficient blank pages, old passports, a recent passport-size photograph, proof of identity, proof of residence (such as utility bills), proof of financial soundness (e.g., foreign currency endorsement or bank statements), and proof of profession (which varies based on employment status or self-employment). Additional documentation is required for spouses of Bangladeshi nationals married to Indian nationals and for artists, cultural personalities, academicians, or professionals invited for non-commercial performances in India.",
      "raw_content": "10 DOCUMENTS REQUIRED FOR VISA 7. ENTRY VISA 1. Passport , in original, with a minimum validity of six months as on the date of submission of application for visa. The passport should have at least two (2) blank pages. 2. Old passports must be submitted with the application form 3. One recent passport-size colour photograph (2X2) depicting full face with white background. 4. A copy of National ID Card OR Birth Certificate( whichever applicable) 5. Proof of Residence : A copy of the electricity bill OR gas bill OR landline telephone bill (not less than 6 months old) 6. Proof of Financial soundness : Endorsement of foreign currency equivalent to US$150/- per applicant (Endorsement should not be older than three months at the time of submission) OR Updated summary Bank statement showing sufficient funds OR copy of international credit card or Travel card (Example - SBI Travel card). 7. Proof of Profession :  Government Order Copy (If the applicant is a serving government employee) OR  Certificate from the employer( If the applicant is a private company employee). OR  A copy of the Registration granted to the Business establishment by the Government of Bangladesh( In case of self employed persons ). OR  A copy of Identity card from the educational institution (If the applicant is a student) OR  A copy of the retirement papers ( If the applicant is a retired government employee). 8. Bangladesh national married to an Indian national or their children . Proof of Indian address of the spouse  Indian Voter Card/Aadhar Card/Marriage Certificate/ Nikahnama  Copy of passport of the Indian spouse(if available).\n-- Page 11 --\n11 DOCUMENTS REQUIRED FOR VISA 9. Artistes/ cultural personalities/ academicians/ professionals who visit India to participate in non profitable/ non-commercial performances sponsored by reputed institutions in India. A letter of invitation from the organizers of the event in India. A letter of introduction from the organization in which the applicant is working . *****"
    },
    "visa_requirements_defense_police": {
      "summary": "This document outlines the 12 required documents for a visa application, specifically for serving or retired defense, paramilitary, and police personnel. Key requirements include a valid passport with blank pages, old passports, a recent passport-size photograph, national ID or birth certificate, proof of residence (utility bill), proof of financial soundness (currency endorsement, bank statement, or travel card), and proof of profession depending on employment status (government order, employer certificate, business registration, student ID, or retirement papers). A specific defense form is also required and available online.",
      "raw_content": "12 DOCUMENTS REQUIRED FOR VISA 8. SERVING/RETEIRED -DEFENSE/PARAMILITARY/POLICE PERSONNEL 1. Passport , in original, with a minimum validity of six months as on the date of submission of application for visa. The passport should have at least two (2) blank pages. 2. Old passports must be submitted with the application form. 3. One recent passport-size colour photograph (2X2) depicting full face with white background. 4. A copy of National ID Card OR Birth Certificate( whichever applicable) 5. Proof of Residence : A copy of the electricity bill OR gas bill OR landline telephone bill (not less than 6 months old) 6. Proof of Financial soundness : Endorsement of foreign currency equivalent to US$150/- per applicant (Endorsement should not be older than three months at the time of submission) OR Updated summary Bank statement showing sufficient funds OR copy of international credit card or Travel card (Example - SBI Travel card). 7. Proof of Profession :  Government Order Copy (If the applicant is a serving government employee) OR  Certificate from the employer( If the applicant is a private company employee). OR  A copy of the Registration granted to the Business establishment by the Government of Bangladesh( In case of self employed persons ). OR  A copy of Identity card from the educational institution (If the applicant is a student) OR  A copy of the retirement papers ( If the applicant is a retired government employee). 8. Defence form ( available on http://www.ivacbd.com/existing/defence_personnel_form_new.pdf ). ****"
    },
    "visa_requirements_conference": {
      "summary": "This document outlines the 13 required items for a Conference Visa application. Key documents include a passport valid for at least six months with two blank pages, old passports, a recent passport-sized photo, proof of identity (National ID or Birth Certificate), proof of residence (utility bill), proof of financial soundness (foreign currency endorsement, bank statement, or travel card), and proof of profession (depending on employment status or student status). Additionally, an invitation letter from the event organizers in India and an introduction letter from the applicant's employer are mandatory.",
      "raw_content": "13 DOCUMENTS REQUIRED FOR VISA 9. CONFERENCE VISA 1. Passport , in original, with a minimum validity of six months as on the date of submission of application for visa. The passport should have at least two (2) blank pages. 2. Old passports must be submitted with the application form. 3. One recent passport-size colour photograph (2X2) depicting full face with white background. 4. A copy of National ID Card OR Birth Certificate( whichever applicable) 5. Proof of Residence : A copy of the electricity bill OR gas bill OR landline telephone bill (not less than 6 months old) 6. Proof of Financial soundness : Endorsement of foreign currency equivalent to US$150/- per applicant (Endorsement should not be older than three months at the time of submission) OR Updated summary Bank statement showing sufficient funds OR copy of international credit card or Travel card (Example - SBI Travel card). 7. Proof of Profession :  Government Order Copy (If the applicant is a serving government employee) OR  Certificate from the employer( If the applicant is a private company employee) OR  A copy of the Registration granted to the Business establishment by the Government of Bangladesh( In case of self employed persons ). OR  A copy of Identity card from the educational institution (If the applicant is a student) OR  A copy of the retirement papers ( If the applicant is a retired government employee). 8. A letter of invitation from the organizers of the event in India. 9. A letter of introduction from the organization in which the applicant is working. ****"
    },
    "visa_requirements_employment": {
      "summary": "This document outlines the 14 required documents for an employment visa application. Key requirements include a valid passport with at least six months' validity and two blank pages, old passports, a recent passport-size photograph, proof of identity (National ID or Birth Certificate), proof of residence (utility bill), proof of financial soundness (foreign currency endorsement, bank statement, or credit/travel card), and proof of profession (government order, employer certificate, business registration, student ID, or retirement papers). Additionally, a letter of invitation from the Indian company and proof of employment or contract are necessary.",
      "raw_content": "14 DOCUMENTS REQUIRED FOR VISA 10. EMPLOYMENT VISA 1. Passport , in original, with a minimum validity of six months as on the date of submission of application for visa. The passport should have at least two (2) blank pages. 2. Old passports must be submitted with the application form. 3. One recent passport-size colour photograph (2X2) depicting full face with white background. 4. A copy of National ID Card OR Birth Certificate( whichever applicable) 5. Proof of Residence : A copy of the electricity bill OR gas bill OR landline telephone bill (not less than 6 months old) 6. Proof of Financial soundness : Endorsement of foreign currency equivalent to US$150/- per applicant (Endorsement should not be older than three months at the time of submission) OR Updated summary Bank statement showing sufficient funds OR copy of international credit card or Travel card (Example - SBI Travel card). 7. Proof of Profession :  Government Order Copy (If the applicant is a serving government employee) OR  Certificate from the employer( If the applicant is a private company employee). OR  A copy of the Registration granted to the Business establishment by the Government of Bangladesh( In case of self employed persons ). OR  A copy of Identity card from the educational institution (If the applicant is a student) OR  A copy of the retirement papers ( If the applicant is a retired government employee). 8. A letter of invitation from the registered Indian company/ firm/ organization indicating the nature of employment. 9. Proof of his/her employment or contract or engagement by the company/firm/organization in India. ****"
    }
  }
}