{
  "source_file": "hcidhaka.gov.in_Welcome_to_High_Commission_of_India_Bangladesh_raw_2025-08-10-18-32-32.txt",
  "structured_data": {
    "general_info": {
      "summary": "This document outlines the procedures for foreigners falling ill in India, requiring medical treatment. For minor ailments, OPD treatment is permitted on the primary visa. For indoor treatment exceeding OPD, certain conditions apply, including admission to recognized hospitals and reporting to FRRO. Pakistani nationals and cases requiring organ transplant or treatment exceeding 180 days necessitate conversion to a Medical (MED-1) visa. Dependent visas do not need conversion if the primary visa holder's visa is converted to a medical visa. Upon recovery, the medical visa can be reconverted to the primary visa, or exit granted if the primary visa has expired. Holders of 'X-1' visas can receive treatment of any duration without visa conversion.",
      "raw_content": "Procedure to be followed in the event of a foreigner on any category of visa falling ill during his/ her stay in India requiring medical treatment\n(i) A foreigner (including a Pakistani national) suffering from a minor medical condition which needs only OPD consultation/ treatment may take treatment at any hospital/ treatment centre on his/her primary visa.\n(ii) In case of illness which requires indoor medical treatment of less than 180 days or the stay stipulation period, if any, stipulated on his/ her primary visa or the duration of his/ her primary visa, whichever is earlier, a foreigner (other than a Pakistani national) is permitted to take such indoor medical treatment subject to the following conditions :-\n(a) Such indoor medical treatment shall be taken by the foreigner in a Government/ ICMR (Indian Council of Medical Research)/NABH (National Accreditation Board for Hospitals & Healthcare Providers)/ MCI (Medical Council of India)/ CGHS(Central Government Health Scheme) recognized hospital/treatment centre.\n(b) The hospital/treatment centre authorities concerned shall furnish the details of the foreigner in the prescribed Form ‘C’ along with details of the indoor medical treatment to be taken by the foreigner, duly certified by the treating doctor, to FRRO concerned as soon as may be, but not more than 24 hours after the admission of the foreigner in the hospital/ treatment centre for such indoor medical treatment. A copy of the confirmation received about submission of the details to FRRO concerned may be given by the hospital authorities to the foreigner for his/ her record.\n(c) The indoor medical treatment may also cover treatment for diseases which the foreigner may have been suffering from even before his/her entry into India.\n(d) Treatment of diseases which require organ transplant shall be permitted only on a Medical Visa. In such cases, the visa of the foreigner may be converted to Medical (MED-1) Visa by the FRRO concerned as per the provisions mentioned in sub-para (iii) below.\n(iii) The primary visa of the foreigner will have to be converted to ‘Medical (MED-1)’ visa in the following types of cases:-\n(a) In cases where the period of treatment exceeds 180 days or the stay stipulation period, if any, stipulated on the primary visa or the duration of the primary visa, whichever is earlier;\n(b) in cases for treatment of diseases which require organ transplant;\n(c) In cases of indoor medical treatment of Pakistani nationals for any period.\nNote : In all such cases (other than those of Pakistani nationals), the primary visa may be converted to Medical (MED-1) Visa and extended by the FRRO concerned as per the provisions in para 11.5 of the Visa Manual applicable to normal Medical (MED-1) Visa after collecting necessary fees. However, in the case of Pakistani nationals, conversion of the primary visa to Medical (MED-1) Visa and extension of Medical (MED-1) Visa will be granted by DCP/FRO concerned only with the prior approval of the Ministry of Home Affairs.\nIn all such cases, the primary visa will be suspended.\n(iv) It may not be necessary to convert the dependent visa to MED-2 Visa in case the visa of the principal visa holder or of one of the dependents on dependent visa is converted to Medical (MED-1) Visa. In such cases, the dependents issued with dependent visa may be allowed as Medical Attendants without converting the visa to MED-2 Visa.\n(v) On acquisition of fitness certificate, the foreign national will be allowed to resume his/ her activity as per the primary visa. In such cases, the Medical (MED-1)Visa of the foreign national will be re-converted into the primary visa by the FRRO concerned without changing the validity of the primary visa. This re-conversion should be charged with fee required for grant of fresh primary visa as applicable. However, in cases where the duration of the primary visa has already expired, the foreign national will be granted exit by the FRRO concerned.\nNote : In the case of Pakistani nationals, re-conversion to the primary visa or grant of exit, as the case may be, will be granted by DCP/ FRO concerned only with the prior approval of the Ministry of Home Affairs.\n(vi) A foreigner holding ‘X-1’ visa (Person of Indian Origin, spouse/children of an Indian citizen/ Person of Indian Origin/ OCI cardholder) may take treatment in any hospital/ treatment centre for any duration without converting their visas to Medical (MED-1) visa.\n"
    }
  }
}