{
  "source_file": "indianfrro.gov.in_EfrroOnline_raw_2025-08-10-18-41-03.txt",
  "structured_data": {
    "general_info": {
      "summary": "The e-FRRO system allows foreign nationals to apply for visa and immigration services in India entirely online, eliminating the need for intermediaries and direct visits to FRRO/FRO offices. Users create an online profile, submit applications with uploaded documents, and make payments through a secure portal. Applicants receive status updates via email and SMS and can track their applications. While most services are electronic, exceptions for emergencies exist, and applicants are advised to use their own email IDs for communication and to avoid unofficial agents promising expedited service.",
      "raw_content": "e-FRRO involves complete online application submission and document upload, for which no facilitation is required by any intermediary / agents etc. The foreign nationals are required to apply online by themselves. It is advised not to believe or fall in trap of any middlemen/agent that claim speedy/express grant of e-FRRO and charge money for it. For any clarification or doubt, you may contact FRRO Support Centre.\nNo need to visit FRRO/FRO office\nConvenient & Time Saving\nUser Creation & Authentication\nCreate User-id/Password by registering online into our portal. Foreigners should register with their own email ID and provide valid Mobile Number in India for receiving OTP and other status updates/alerts at various stages of processing.\nLogin with valid credentials\nOnce user-id/password is successfully created, the foreign national can submit online application by selecting the appropriate service and uploading the requisite documents.\nApplication Submission and Document Upload\nThe application form should be carefully filled and any errors should be avoided. Further, necessary documents and photograph should be uploaded online in the designated format. The application would not be successfully submitted unless the documents and photographs are uploaded online successfully.\nSuccessful Submission of Application\nThe application would be scrutinized by Visa Officers only if the application has been successfully submitted. Upon scrutiny, necessary instructions with regard to application i.e. Fee Payment, Correction of Selected/desired Service, re-uploading of documents etc would be conveyed to the Foreigner through email/SMS alerts.\nOnline Fee Payment\nThe foreigner would be intimated to deposit the requisite fee, if any, for the service. The fee has to be deposited online through Bank Payment gateway available on the portal. Amount of fee would be intimated through email/sms alerts.\nThe foreigner can track the status of the application through our portal. For any clarification, our Support Centre can be contacted.\nUpon Grant/Rejection of service, the same would be intimated to the foreigner. His/Her RC/RP etc would be sent through email or it can also be downloaded from our portal by signing in.\nThe foreigner can approach the concerned Civil Authority i.e. FRRO/FRO office directly in case of exigency/emergency. Upon satisfaction of the case, the services can also be granted directly at the FRRO/FRO level. Make sure that services granted are electronic and not manual. You may face hurdles at the Immigration Check Posts in case of manual services.\nMinistry of Home Affairs\nMinistry of External Affairs\n• Photo & Documents Requirement\n• SBI payment related FAQ\n• Axis payment related FAQ\n• e-FRRO is now applicable for foreigners in the jurisdiction of all FRROs/FROs.\n• e-FRRO is mandatory for availing services at FRROs/FROs.\n• Services would be granted at FRRO/FRO office only in case of exigency/emergency.\n• The foreigner is required to appear for interview if any, at scheduled time/date, as intimated by FRRO through email/sms alerts.\n• Foreigner should check their inbox daily for email alerts.\n• Foreigner would be liable for prosecution/fines as per Indian laws, for any delay in fee payment/document upload/interview etc.\n• This service is not applicable for diplomats/officials who are under jurisdiction of CPV Division, Ministry of External Affairs.\n• Foreigners are encouraged to upload documents and photographs in good quality.\n• Foreigners should use their own email id to ensure data privacy and data security as important communication would be sent to your email.\n• Services rendered though e-FRRO can be cancelled by the Civil Authority any time, upon field enquiries and verification. Cancellation would be duly intimated to the foreigner and necessary action, as per Indian Laws, would be taken against the foreigner.\n• Foreigners are advised to apply at least 2 weeks in advance.\n• Photo and Document(s) upload are mandatory.\n• First use the Online Application Submission option then upload photo and required document(s).\n• Photographs which are edited or modified by Photoshop or any other Software/ Mobile App will be rejected.\n• Only one copy of each document type has to be uploaded.\n• Scanned documents should be in PDF format.\n• Single supporting document can have multiple PDFs. The maximum size of each PDF should be 1 MB.\n• Only completely filled application along with photo and document(s) uploded to generate pdf.\n• Only permanently saved application is available for Re-Printing.\n• Photo Requirements: Format - jpgSize - Maximum 1 MBPhoto should present Full face, front view, eyes openCenter head within frame and present full head from top of hair to bottom of chinBackground should be plain light colored or white backgroundNo shadows on the face or on the backgroundBring same photo along with application form.Upload Photo in passport size (3.5 x 3.5 cm or 3.5 x 4.5 cm) style=\" vertical-align: baseline;\">or Without borders Upload photo portion only Don't upload Tilted, Distorted and Blurred photo\n• Size - Maximum 1 MB\n• Photo should present Full face, front view, eyes open\n• Center head within frame and present full head from top of hair to bottom of chin\n• Background should be plain light colored or white background\n• No shadows on the face or on the background\n• Bring same photo along with application form.\n• Upload Photo in passport size (3.5 x 3.5 cm or 3.5 x 4.5 cm) style=\" vertical-align: baseline;\">or\n• Without borders\n• Upload photo portion only\n• Don't upload Tilted, Distorted and Blurred photo\n• e-FRRO is online FRRO/FRO Service delivery mechanism for foreigners without requirement of visiting FRRO/FRO Office.\n• Who needs to apply for e-FRRO?\n• All foreigners who desire Visa and Immigration related services in India viz. Registration, Visa Extension, Visa Conversion, Exit Permit etc need to apply for e-FRRO.\n• How to apply for e-FRRO?\n• Foreigners are required to create their own USER-ID by registering themselves online on e-FRRO portal. Afterwards, they are required to apply online through registered user-id for various Visa and Immigration related services in India viz. Registration, Visa Extension, Visa Conversion, Exit Permit etc, without any hassle and obtain the service(s) without coming to FRRO/FRO office.\n• Do I need to visit FRRO/FRO office after applying through e-FRRO?\n• No requirement of taking appointment and visiting FRRO/FRO office unless specifically called upon by the FRRO/FRO concerned. Intimation would be sent through sms/email on the registered mobile/email-id.\n• How to make payment?\n• Upon successful uploading of application and documents, the foreigner would be intimated to deposit the requisite fee online, if any, for the service. The fee has to be deposited online through Bank Payment gateway available on the portal. Amount of fee would be intimated through email/sms alerts.\n• How would I get RC/RP?\n• RC/RP, Exit Permit etc would sent through mail.\n• Do I need Endorsement on my Passport?\n• There would not be any requirement of endorsement on passport. In case, there is any such requirement, you would be intimated by the FRRO/FRO concerned to visit their office.\n• What to do in emergency/exigency?\n• The foreigner can approach the concerned Civil Authority i.e. FRRO/FRO office directly in case of exigency/emergency. Upon satisfaction of the case, the services can also be granted directly at the FRRO/FRO level. Make sure that services granted are electronic and not manual. You may face hurdles at the Immigration Check Posts in case of manual services.\n• What happens if there is delay in fee payment or document uploading?\n• Foreigner would be liable for prosecution/fines as per Indian laws, for any delay in fee payment/document upload/not attending interview etc.\n• Do I need to use my own email-id for registration?\n• Yes. It is mandatory to use personal email ID. Foreigners should use their own email id to ensure data privacy and data security as important communication would be sent to your email.\n• Can I apply for my family members through my own ID?\n• Yes. You can submit applications for your family members from same ID. However you would be required to submit/fill individual online forms for each member of your family.\n• How would I know about status of my application?\n• At every stage of processing, the status of your application would be shared via SMS/Email. You can also track your status by logging into your dashboard through registered Email-ID/Password.\nSource: https://indianfrro.gov.in/efrro/home"
    }
  }
}