{
  "source_file": "indianvisaonline.gov.in_India_Visa_Online_raw_2025-08-10-18-40-34 (4).txt",
  "structured_data": {
    "general_info": {
      "summary": "This document outlines the three-step regular visa application process for India, which involves filling and submitting an online application form, submitting the printed form with supporting documents and passport to an Indian Visa Application Center or Mission, and finally collecting the passport with visa. It also provides technical guidance for using the website, including recommended browsers and software, and directs applicants to the relevant Indian Mission's website for more detailed information.",
      "raw_content": "• Visa Fee\n• Foreigners Act\nTHREE STEP REGULAR VISA APPLICATION PROCESS\nFill and Submit Visa Application Form Securely.\nSubmit your application with required documents at Indian Visa Application Center or at Indian Mission.\nCollect your passport/visa from Indian Mission/Visa Application Center or by post.\nApplicants may fill the online application form by going to the tab placed below. Once the form is filled and submitted, applicant must print the completed application form and sign and submit the physical copy along with the supporting documents and the Passport to the concerned Indian Visa\nApplication Center (IVAC) or directly at the Indian Mission on the scheduled appointed date. The instructions for filling the form and scheduling the appointment can be seen at Instructions for Regular Visa Application.\nThe status of Visa Application can be seen on the link for Visa Enquiry.\nThe applicants are also requested to visit website of the Indian Mission concerned for detailed information about Indian visa.\nComplete Partially Filled Regular/Paper Visa Form\nCheck your Visa Status\nPrint Registered Application Form\nTechnical information: This site is best viewed in Mozilla Firefox,Google Chrome,Internet Explorer (Windows) version 9.0 and above.The applicant must also have Adobe Acrobat Reader version 7.0 or higher installed on your PC in order to download and print the completed application form. This website is compatible with Android and IOS devices.\nOnline Portal for Visa Application to Indian Missions/Posts\nContent managed by Bureau of Immigration, MHADesigned & Developed by NIC\nSource: https://indianvisaonline.gov.in/visa/"
    },
    "admission_requirements": {
      "summary": "This document lists authorized Indian Customs Ports (ICPs) for regular visa entry and exit in India, noting that this list is subject to regular/sticker visa endorsements and that E-Visa has different authorized entry points. Specific authorized locations mentioned include Agati and Minicoy Island Lakshdwip UT, Munabao Rail Check Post, Attari Rail Check Post, Gede Rail and Road Check Post, and Haridaspur Rail Check Post.",
      "raw_content": "List of Authorised ICPs for ENTRY#$/EXIT# in India on Regular Visa\n# Subject to Regular/Sticker Visa Endorsements\n$ Check Authorised Entry Points for E-Visa\n• Agati and Minicoy Island Lakshdwip UT\n• Munabao Rail Check Post\n• Attari Rail Check Post\n• Gede Rail and Road Check Post\n• Haridaspur Rail Check Post"
    }
  }
}