{
  "source_file": "niu.edu.in_niuijhr_-_Noida_International_University_raw_2025-08-10-18-48-38.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text outlines various aspects of NIU (presumably a university), including its administrative structures like the Court, Board of Governors, and Academic Council, along with various policy documents such as HR, CRS, Transport, and Scholarship policies. It also details sections on NIU's history, leadership, recognitions, awards, and collaborations, including international MOUs. Notably, it highlights the NIU International Journal of Human Rights (NIU IJHR), a UGC CARE listed, peer-reviewed journal established in 2014 that focuses on multi-disciplinary discussions in social sciences, law, and humanities, aiming to disseminate high-quality research with a commitment to diversity and inclusion.",
      "raw_content": "ICAIMISMDAHSSICADISNIRFNIIMSCAREERSR&DNIUMOOCSGRIEVANCES\n• CAREERS\nCode of ConductIQACAnnual ReportsIICNISP 2019\nUNIVERSITY AUTHORITIES\nCourtBoard of GovernorsExecutive CouncilAcademic CouncilCOMMITTEES\nHR PoliciesCRS PoliciesTransport PoliciesScholarship PoliciesMigration Policy\nSports Scholarship PolicyUniversity Hostel PolicySports PoliciesFee Payment PolicyFee Payment ProcedureAdmission Withdrawal Policy\nUniversity OrdinancesUniversity StatuteUniversity ACTBalance Sheet\n• About NIULeadershipRecognitions & ApprovalsDASAAwards & AchievementsCollaborationsInternational MOUs\n• Leadership\n• Code of ConductIQACAnnual ReportsIICNISP 2019\n• Annual Reports\n• NISP 2019\n• UNIVERSITY AUTHORITIES\n• Board of Governors\n• CRS Policies\n• Scholarship Policies\n• Sports Scholarship Policy\n• University Hostel Policy\n• Fee Payment Policy\n• Fee Payment Procedure\n• University Ordinances\n• University Statute\n• University ACT\nNIU ClubsEvent VideoNotice BoardCampus Virtual TourSports\nNIU International Journal of Human Rights, a UGC CARE listed, peer-reviewed annually published journal since 2014 seeks to provide a platform for engaging in multi-disciplinary discussions on themes of social sciences, law and humanities. The journal has a global reach and is widely read by scholars and practitioners across the world. The purpose of the journal is to disseminate research results and the content supports high level learning, teaching and research in human rights & allied disciplines.\nNIU IJHR disseminates high-quality research, and we are committed to diversity and inclusion in publishing. We encourage submissions from a diverse range of authors from across all countries and backgrounds."
    },
    "admission_requirements": {
      "summary": "This text appears to be a navigational or informational listing related to university admissions, likely for CUET (Common University Entrance Test). It outlines various aspects of the application and admission process, including counseling, fee structures for 2025-26, scholarship and loan options, transport, hostels, and admission alerts. It also mentions specific teams, doctoral admissions, and brochures for Indian students, along with a call to \"Apply Now 2025.\"",
      "raw_content": "Apply for CUET CounsellingAdmission ProcessCourses & Fee Structure For 2025-26Scholarship & Bank LoanTransportHostels\nAdmission AlertsAdmission and Outreach TeamPh.D. AdmissionsDomestic Brochure (Indian Students)Prospectus\n• Apply for CUET CounsellingAdmission ProcessCourses & Fee Structure For 2025-26Scholarship & Bank LoanTransportHostels\n• Apply for CUET Counselling\n• Admission AlertsAdmission and Outreach TeamPh.D. AdmissionsDomestic Brochure (Indian Students)Prospectus\n• Admission and Outreach Team\n• Domestic Brochure (Indian Students)\n• Apply Now 2025"
    },
    "university_administration": {
      "summary": "This document lists three foundational legal and administrative documents pertaining to a university: the University Ordinances, the University Statute, and the University ACT.",
      "raw_content": "• University Ordinances\n• University Statute\n• University ACT"
    },
    "research_and_publications": {
      "summary": "The NIU International Journal of Human Rights is a UGC CARE listed, peer-reviewed journal published annually since 2014. It serves as a platform for interdisciplinary discussions in social sciences, law, and humanities, aiming to disseminate high-quality research globally. The journal encourages diverse submissions and covers a wide range of topics related to human rights, emphasizing ethical publishing practices and adherence to COPE principles to prevent academic integrity violations.",
      "raw_content": "NIU INTERNATIONAL JOURNAL OF HUMAN RIGHTS 2024NIU INTERNATIONAL JOURNAL OF HUMAN RIGHTS 2023NIU INTERNATIONAL JOURNAL OF HUMAN RIGHTS 2022NIU INTERNATIONAL JOURNAL OF HUMAN RIGHTS 2021NIU INTERNATIONAL JOURNAL OF HUMAN RIGHTS 2020NIU INTERNATIONAL JOURNAL OF HUMAN RIGHTS 2019NIU INTERNATIONAL JOURNAL OF HUMAN RIGHTS 2018NIU INTERNATIONAL JOURNAL OF HUMAN RIGHTS 2017NIU INTERNATIONAL JOURNAL OF HUMAN RIGHTS 2016NIU INTERNATIONAL JOURNAL OF HUMAN RIGHTS 2015\n• NIU INTERNATIONAL JOURNAL OF HUMAN RIGHTS 2024\n• NIU INTERNATIONAL JOURNAL OF HUMAN RIGHTS 2023\n• NIU INTERNATIONAL JOURNAL OF HUMAN RIGHTS 2022\n• NIU INTERNATIONAL JOURNAL OF HUMAN RIGHTS 2021\n• NIU INTERNATIONAL JOURNAL OF HUMAN RIGHTS 2020\n• NIU INTERNATIONAL JOURNAL OF HUMAN RIGHTS 2019\n• NIU INTERNATIONAL JOURNAL OF HUMAN RIGHTS 2018\n• NIU INTERNATIONAL JOURNAL OF HUMAN RIGHTS 2017\n• NIU INTERNATIONAL JOURNAL OF HUMAN RIGHTS 2016\n• NIU INTERNATIONAL JOURNAL OF HUMAN RIGHTS 2015\nNIU International Journal of Human Rights, a UGC CARE listed, peer-reviewed annually published journal since 2014 seeks to provide a platform for engaging in multi-disciplinary discussions on themes of social sciences, law and humanities. The journal has a global reach and is widely read by scholars and practitioners across the world. The purpose of the journal is to disseminate research results and the content supports high level learning, teaching and research in human rights & allied disciplines.\nNIU IJHR disseminates high-quality research, and we are committed to diversity and inclusion in publishing. We encourage submissions from a diverse range of authors from across all countries and backgrounds.\nClick Here to Submit\nNIU INTERNATIONAL JOURNAL OF HUMAN RIGHTS is an interdisciplinary journal of rights, broadly conceived. It welcomes qualitative and theoretical interventions, interpretations, and engagements with political events, institutions, cultures, and issues as they impact upon rights. It provides a forum appealing to academics and practitioners who work at the intersections of politics, culture, economy, aesthetics, philosophy, and the arts. The journal publishes innovative, double-blind peer-reviewed, and theoretically engaged articles in the\nhumanities and the social sciences, as well as academic focus essays and is open to other forms of writing and representations on the subject.\nChildrenCitizenship and ParticipationCulture and SportDemocracyDisability and DisablismDiscrimination and IntoleranceEducationEnvironmentGenderGlobalisation: HealthMediaMigrationPeace and violencePovertyReligion and BeliefRemembranceWar and TerrorismWorkGeneral Human Rights\n• Privacy StatementThe names and email addresses entered in this journal site will be used exclusively for the stated purposes of this journal and will not be made available for any other purpose or to any other party.\n• Ethics StatementNIUIJHR is committed to meeting and upholding the standard of ethical behavior at all stages of the publication process. Conformance to standards of ethical behavior is expected of all parties involved: authors, editors and reviewers.Furthermore, this ethics and malpractice statement sets out the specific responsibilities for all parties involved to ensure that NIUIJHR complies with internationally accepted guidelines on carrying out ethical and culturally competent research.\n• Plagiarism StatementNIUIJHR urges all authors submitting manuscripts to follow principles of scientific transparency, honesty, thoroughness and excellence in research, transparency, respect for co-authors or research participants, etc.The journal follows ethical and integrity standards of science and adheres to the COPE principles. It prevents any academic integrity violations\nThe journal follows ethical and integrity standards of science and adheres to the COPE principles. It prevents any academic integrity violations\n"
    },
    "editorial_board": {
      "summary": "This text lists individuals associated with academic institutions and professional organizations, primarily in India and some international locations, serving in editorial and advisory roles. It includes names, titles, affiliations, and email addresses, suggesting a committee or editorial board for a publication or initiative.",
      "raw_content": "• Prof. (Dr.) Aparna Sharma (Editor-in-Chief)Dean, School of Liberal Arts, Noida International University, U.P., Indiadir.sla@niu.edu.in\n• Prof. (Dr.) Manu Singh (Associate Editor)Dean, School of Law and Legal Affairs, Noida International University, U.P. Indiadir.slla@niu.edu.in\n• Dr. Manju Kundu (Member)Assistant Professor, Department of Political Science/International Relation, School of Liberal Arts, Noida International University, U.P. Indiamanju.kundu@niu.edu.in\n• Dr. Mohd. Asif (Member)Assistant Professor, Department of Public AdministrationSchool of Liberal Arts, Noida International University, U.P. Indiamohd.asif@niu.edu.in\n• Dr. Rachna Davi (Member)Associate Professor, Department of EnglishSchool of Liberal Arts, Noida International University, U.P. Indiarachna.davi@niu.edu.in\n• Prof. David W. Tushaus, J.D.Professor of Legal Studies, Missouri Western State University, USAtushaus@missouriwestern.edu\n• Prof. (Dr.) Sanjeev Kumar SharmaVice ChancellorMahatma Gandhi Central University, Biharsanjeevaji@gmail.com\n• Dr. Veerendra Kumar MishraIndian Police Service Officer Police Headquarters, Bhopalvmishra2005@gmail.com\n• Prof. (Dr.) Anil SehrawatDeputy Director, AICC Amity University, Noidaanilsehrawat@hotmail.com\n• Prof. (Dr.) Abdulrahim P. Vijapur (Retd.)Department of Political Science,Aligarh Muslim University, Indiavijapur_rahim@rediffmail.com\n• Prof. Amos MeggedHead of the Program in Religious StudiesDepartment of General History, University of Haifa, Israelmegged@research.haifa.ac.il\n• Prof. Leni Widi Mulyani, SH, MHHead of Clinical Legal Education,Faculty of Law, Bandung, University of Indonesialeniwidimulyani16@gmail.com\n• Dr. Saumyajit RayAssistant Professor, School of International StudiesJawaharlal Nehru University, New Delhiray.saumyajit@gmail.com\n• Prof. (Dr.) Uday ShankarProfessor, IIT Kharagpuruday@iirkgp.ac.in\n• Dr. Veena RalliAdvocate, Senior Mediator,Organizing Secretary, Samadhan, Delhi High Courtveena.ralli@gmail.com\n• Dr. Dhiraj Kumar NiteAssistant Professor, History Ambedkar University Delhidhirajnite@gmail.com\n• Prof. Pinki SharmaFaculty of Law, University of Delhi pinki_sharma2004@yahoo.co.in\n• Prof. (Dr) Asha VermaPro Vice-Chancellor, IILM University Gurugramasha.verma@iilm.edu\n• Dr Sangita LahaAssociate Professor& Assistant RegistrarNational University of Study & Research in Law, Ranchisangitalaha05@rediff.com\n• Dr. Tapan ChandolaDean ICFAI Law School, Dehradunapanchandola76@gmail.com\n• Dr. Parag GargPrincipal Law Department, S.R.C. Law College, Meerutparag22garg@rediffmail.com\n• Dr. Nitesh UpadhyayAssociate Professor of Law, Symbiosis Law School, NoidaResearch Advisor South Ural State University, Russianiteeshupadhyay1988@gmail.com\n• Dr. Virendra Singh BithooAssistant Professor, Department of HistoryCollege of Vocational Studies, University of Delhivirendrasinghcharan@gmail.com\n• Dr. Vikram SrivastavaAdvocate and Managing Partner, Technical Regional Advisor, SAIEVAC(South Asia Initiative to End Violence Against Children)vikram.ithought@gmail.com\n• Prof. (Dr.) Tariq AhmadDepartment of Law, Aligarh Muslim University\n• Dr. Labrina GiotiAssistant Professor,Aristotle University of Thessaloniki, Greece I"
    },
    "feedback_mechanisms": {
      "summary": "This document lists various categories of feedback collected within an educational institution. It enumerates feedback sources such as students, teachers, alumni, parents, and employers, focusing on aspects like curriculum, teaching quality, and the university in general. The list appears multiple times, with some variations in formatting and repetition.",
      "raw_content": "Student Feedback About Curriculum\nStudents Feedback About Teachers\nStudents Feedback About University in General\nTeachers’ Feedback About Curriculum\nAlumni Feedback\nParent’s Feedback\nCourse Exit Survey\nEmployer’s Feedback\n• Student Feedback About Curriculum\n• Students Feedback About Teachers\n• Students Feedback About University in General\n• Teachers’ Feedback About Curriculum\n• Alumni Feedback\n• Parent’s Feedback\n• Course Exit Survey\n• Employer’s Feedback\n• Feedback\nStudent Feedback About CurriculumStudents Feedback About TeachersStudents Feedback About University in GeneralTeachers’ Feedback About CurriculumAlumni FeedbackParent’s FeedbackEmployer’s Feedback\n"
    }
  }
}