{
  "source_file": "niu.edu.in_School_Of_Pharmacy_-_Noida_International_University_raw_2025-08-10-18-48-40.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text appears to be a navigation or site map excerpt from a university website, likely the National Institute of Education (NIU). It lists various sections such as Careers, Feedback, About NIU, Leadership, Academic Policies (like IQAC, Annual Reports, NISP, University Policies, Fee Payment), University Authorities, and specific policies like Scholarship and Hostel policies. It also includes a mission statement about changing the world through education and an investment in education paying dividends, suggesting an opening or welcoming statement.",
      "raw_content": "• CAREERS |\n• FEEDBACK |\n• About NIULeadershipRecognitions & ApprovalsDASAAwards & AchievementsCollaborationsInternational MOUs\n• Leadership\n• Code of ConductIQACAnnual ReportsIICNISP 2019\n• Annual Reports\n• NISP 2019\n• UNIVERSITY AUTHORITIES\n• Board of Governors\n• CRS Policies\n• Scholarship Policies\n• Sports Scholarship Policy\n• University Hostel Policy\n• Fee Payment Policy\n• Fee Payment Procedure\n• University Ordinances\n• University Statute\n• University ACT\n• COVID-19\n“Our goal is to change world through education”\n“An investment in education pays best dividend.” I look forward to welcoming you to the School of"
    },
    "admission_requirements": {
      "summary": "Admission to the first year requires a 10+2 qualification with Physics, Chemistry, and Mathematics or Biology, achieving at least 50% marks from a recognized board, or through university entrance tests like UPSEE. Lateral entry into the second year is available for students with a D.Pharm degree and a minimum aggregate of 45% for general/OBC candidates and 40% for SC/ST candidates.",
      "raw_content": "Qualification for admission in 1\" year : 10+2 with PCM/PCB Subjects minimum 50% marks from a recongnized education board or through counseling from UniversityRANCE TEST NIU Uttar Pradesh,\n• 10+2 with PCM/PCB subjects\n• Minium 50% marks 3 subjects (PCM/PCB) from a recognized education board & 40% for SC/ST or through UPSEE.\nQualification for admission in 2\" year (Lateral Entry): D.Pharm with minium aggregate of 45% for general & OBC and 40% for SC/ST\nQualification for admission in 1\" year : 10+2 with PCM/PCB Subjects minimum 50% marks from a recongnized education board or through counseling from UNIVERSITY ENTRANCE TEST NIU.\nQualification: 10+2 with PCM/PCB Subjects minimum 50% marks from a recongnized education board or through counseling from UNIVERSITY ENTRANCE TEST NIU."
    },
    "career_prospects": {
      "summary": "The provided text outlines career opportunities and prospects for pharmacy graduates in India, detailing top recruiters like Lupin, Cipla, and international companies such as Pfizer and GlaxoSmithKline. It elaborates on various job profiles such as Pharmacist, Pharmacologist, Food and cosmetic products development scientist, Clinical Trial Research Associate, and Drug Inspector, along with their typical annual average salaries. The document also highlights career paths after completing a Diploma in Pharmacy (D.Pharm), including immediate employment as a pharmacist, opening a drugstore, or working in various sectors of pharmaceutical companies, with the option to pursue further studies like a Bachelor of Pharmacy (B.Pharm) or even a law degree. For those with a B.Pharm, additional roles are listed, including Quality Assurance, Drug Regulatory Affairs, and positions like Analytical Chemist, Food and Drug Inspector, and Medical Representative, emphasizing the diverse and vital roles pharmacy professionals play in healthcare and product development.",
      "raw_content": "Top Recruiters in Pharmacy\nThe top recruiters that employ the Pharmacy graduates are given in the table below.\nIndian Recruiters: International Recruiters\n· Lupin· Cipla· Piramal· Sun Pharmaceuticals· Aurobindo Pharma· Dr, Reddy’s Laboratories· Serum Institute of India Ltd· Biocon: · Pfizer· AbbVie· GlaxoSmithKline· Johnson & Johnson· GlaxoSmithKline· Amgen· Merck\nIndian Recruiters\n· Dr, Reddy’s Laboratories\n· Serum Institute of India Ltd\nCandidates can look at the job profile they can opt for after pursuing the Pharmacy courses.\nJob Profiles | Annual Average Salary (in INR) * | Job Details\nPharmacist | 2.2 lakh | A pharmacist is usually associated with healthcare centres, individual medical practitioners, hospitals, and every medical association. Their responsibilities include advising medical practitioners in the healthcare industry, i.e. doctors, nurses, and medical technicians, about drugs and their uses, dosage, as well as side effects. They also check for safety standards of new medicines developed, give advice on medicines with suitable diets, dosages, or prescription or no prescription drugs, as well as suggest the most appropriate form of medications such as tablets, vaccinations, drops, ointments, liquid syrups, inhalers, etc. The sales, marketing, and distribution of medicines are also managed by pharmacists.\nPharmacologist | 4.8 lakh | A person holding a degree in Pharmacology specialisation works in the research and development of drugs for the Pharmacy Industry. A Pharmacologist study observes and alters the drugs developed as per the standards of Pharmacy Regulations. They majorly work in cardiovascular pharmacology, Neuropharmacology, psychopharmacology, Clinical Pharmacology, safety pharmacology, Toxicology, and more.\nFood and cosmetic products development scientist | 10.1 lakh | A pharmacy degree holder is not just restricted to preparing drugs; they are also involved in researching and developing products beyond medicines, such as cosmetics and food.Some people are allergic to a certain food, such as gluten allergy, lactose intolerance, etc., and on the consumption of such foods, they develop serious allergies; therefore, pharmacy scientists research to develop food free from these allergic elements. Similarly, they help develop harmless and non-allergic cosmetic products. For a scientist, a laboratory is a workplace; most of the time is invested in writing about research carried out by them along with the right instructions. All the how-to-use instructions, best before/expiry dates, ingredients, and any specific notes you find on medicines, cosmetics, and food products are scientists’ work. They send the guidelines/instructions after lab testing as per the standards set by the regulatory authorities to the manufacturing units.\nClinical Trial Research Associate | 3.2 lakh | This role is relatively crucial because, as an associate in Clinical Trial Research, the collected data in research studies, interpret it, and document the research. Moreover, the CTR Associate is responsible for verifying the vaccinations, medicines, medical devices, and other clinical monitoring tools. They are involved in ensuring that protocols are followed and regulations are considered, as well as authenticating the CRT data and information. The CRT associates manage the clinical studies for diseases, diagnostics, and monitoring the clinical study labs, as well as risk management in clinical trials.\nDrug Inspector | 7 lakh | Drug inspectors, often known as quality control inspectors, are responsible for ensuring that medicines are safe for human consumption. The duties of a drug inspector include inspecting medicines at various phases of research and development, distribution, and selling to ensure that the requirements have been reached.\nAnnual Average Salary (in INR) *\nA pharmacist is usually associated with healthcare centres, individual medical practitioners, hospitals, and every medical association. Their responsibilities include advising medical practitioners in the healthcare industry, i.e. doctors, nurses, and medical technicians, about drugs and their uses, dosage, as well as side effects. They also check for safety standards of new medicines developed, give advice on medicines with suitable diets, dosages, or prescription or no prescription drugs, as well as suggest the most appropriate form of medications such as tablets, vaccinations, drops, ointments, liquid syrups, inhalers, etc. The sales, marketing, and distribution of medicines are also managed by pharmacists.\nA person holding a degree in Pharmacology specialisation works in the research and development of drugs for the Pharmacy Industry. A Pharmacologist study observes and alters the drugs developed as per the standards of Pharmacy Regulations. They majorly work in cardiovascular pharmacology, Neuropharmacology, psychopharmacology, Clinical Pharmacology, safety pharmacology, Toxicology, and more.\nFood and cosmetic products development scientist\n10.1 lakh\nA pharmacy degree holder is not just restricted to preparing drugs; they are also involved in researching and developing products beyond medicines, such as cosmetics and food.\nSome people are allergic to a certain food, such as gluten allergy, lactose intolerance, etc., and on the consumption of such foods, they develop serious allergies; therefore, pharmacy scientists research to develop food free from these allergic elements. Similarly, they help develop harmless and non-allergic cosmetic products. For a scientist, a laboratory is a workplace; most of the time is invested in writing about research carried out by them along with the right instructions. All the how-to-use instructions, best before/expiry dates, ingredients, and any specific notes you find on medicines, cosmetics, and food products are scientists’ work. They send the guidelines/instructions after lab testing as per the standards set by the regulatory authorities to the manufacturing units.\nClinical Trial Research Associate\nThis role is relatively crucial because, as an associate in Clinical Trial Research, the collected data in research studies, interpret it, and document the research. Moreover, the CTR Associate is responsible for verifying the vaccinations, medicines, medical devices, and other clinical monitoring tools. They are involved in ensuring that protocols are followed and regulations are considered, as well as authenticating the CRT data and information. The CRT associates manage the clinical studies for diseases, diagnostics, and monitoring the clinical study labs, as well as risk management in clinical trials.\nDrug inspectors, often known as quality control inspectors, are responsible for ensuring that medicines are safe for human consumption. The duties of a drug inspector include inspecting medicines at various phases of research and development, distribution, and selling to ensure that the requirements have been reached.\n*Disclaimer: The average salary mentioned is as per Industry trends. It may vary as per actuals.\nFUTURE PROSPECTS AFTER D PHARMA\nD Pharma certificate holders can immediately start working as pharmacists in India. Drug stores are everywhere, ranging from government hospitals to community health centres and private hospitals. They can also choose to open their own drugstore. If you have good aptitude and interpersonal skills and a desire to help others, you can choose Pharmacy as your career. Pharmacists are vital for the primary health care system all around the world. The minimum requirement to become a registered pharmacist in India is a Diploma in pharmacy (D.Pharm).\n• Safe and accurate processing of prescriptions.\n• Dispensing and compounding of medicines.\n• Accurate record-keeping is required under the Food and Drug Act.\n• Purchasing, Merchandising, and Inventory Control.\n• Pharmaceutical Jurisprudence (laws regulating the profession of pharmacy).\n• Regulatory requirements involving testing, screening, and clinical trials of drugs.\nThere are many opportunities after completion of the D.Pharma course:\n• You can get a job at drugstores or private or government hospitals.\n• You can work in health clinics, NGOs, and community health centres by checking the prescriptions, dispensing medicines, and giving them advice and directions.\n• You may get entry-level jobs in pharmaceutical companies at various divisions like Process Control, Manufacturing, and Quality Control.\n• You can also work as Medical Representative.\n• If you have entrepreneurial spirit, you can open your own retail pharmacy outlet, wholesale business, or surgical items shop.\nTo further enhance your chances of success, you can pursue further studies:\n• If you have found your calling and passion in pharmaceutical studies, you can go for a bachelor's degree in pharmacy. In case you have already done D.Pharm, you can directly apply for 2nd year of B.Pharm. Thereafter, you can also pursue postgraduate degrees.\n• Another interesting future for your career can be a degree in Law after D.Pharma. Many pharmaceutical companies hire Litigation and IPR (Intellectual property) lawyers.\nFUTURE PROSPECTS AFTER B PHARMA\n• Quality Assurance and Quality Control\n• Drug Regulatory Affairs\n• Drug Inspectors\n• Drug Controllers\n• Lecturer for D.Pharm. Colleges\nFollowing a B. Pharma, you can work in the following fields:\n• Analytical ChemistChemists are experts who dispense medications that a doctor has recommended for any patient or someone who is ailing physically. In India, there are around 14 lakh chemists. Chemists are also responsible for prescribing medications to anyone without first contacting a doctor, for which they must meet the requirements.\n• Food and Drug InspectorFood and drug inspectors carry out inspections of facilities where foods, medications, and related consumer goods are produced, handled, stored, or sold to uphold the legal requirements for grade, purity, and sanitation.\n• Hospital Drug CoordinatorThe clinical coordinator manages and plans the daily operations of patient care facilities, including hospitals, clinics, and other healthcare settings. He oversees the hospital staff’s daily activities as well. His primary responsibilities include working with various departments, guaranteeing proper patient care, supervising employees, helping specific patients in designated units, and attending regular meetings.\n• Drug TherapistDrug therapists, commonly referred to as substance abuse counsellors, assist those who abuse or depend on legal or illicit drugs. Before considering whether being a drug therapist is the right career for you, it is wise to weigh the benefit s and drawbacks of the position.\n• Chemical TechnicianTo ensure that goods adhere to norms and specifications, chemical processes must be monitored and product quality tested. Set up and care for the tools and equipment used in laboratories. Investigate instrument malfunctions or production issues. Get your chemical solutions ready.\n• Drug TechnicianReads medicine orders and prescriptions, prepare labels, calculates quantities, and assembles intravenous solutions and other pharmacological therapy before organizing medications for the pharmacist to distribute. Keeps data current by logging and organizing doctor’s orders and medicines.\n• Drug InspectorThe drug inspector’s role begins when a drug is authorized for general public sale. They need to make sure that medications are produced correctly and packaged securely. They are in charge of the product’s and its packaging’s quality. They must also perform routine inspections to ensure the manufacturing process’s efficacy and the medicine’s quality. Medication inspectors are employed by drug production facilities and have a crucial role to play.\n• Health InspectorA health inspector’s primary duty is to verify that all public spaces, including hospitals, schools, restaurants, and hotels, maintain the same sanitary standards. In India, a sanitary inspector’s responsibilities include ensuring that a public space operates in a hygienic atmosphere.\n• PharmacistIn addition to dispensing medications, pharmacists advise on how to use them properly and lead healthier lives. Additionally, pharmacists do health exams, immunize patients against infections, and track how much medication each patient takes daily.\n• Research OfficerOften known as a research officer, a researcher manages research programs to achieve particular goals. They are responsible for determining the organization’s budgets, developing procedures, and identifying research goals.\n• Pathological Lab ScientistTechnicians at medical and pathology laboratories conduct clinical tests on samples of biological fluids and tissues to learn more about a patient’s condition or the reason for death.\n• Research & Development ExecutiveToday’s medications and vaccinations result from research and development (R&D). One of the most crucial positions in the pharmaceutical sector is that of the R&D scientist. Research and development (R&D) scientists are expected to thoroughly understand chemistry and biology, conduct animal and human trials, write reports on medical findings, evaluate existing medications, and develop better formulations. These are just a few of the main expectations of R&D scientists.\n• Making Prescriptions to PatientsA pharmacist prepares drugs for use or delivery and ensures that patients receive all of their prescribed medication. They then disperse them as needed to meet the needs of each person.\n• Medical WriterMedical writers translate drug trials, scientific research, and clinical data for use in regulatory presentations, medical journal abstracts, and distribution to a professional audience.\n• Clinical ResearcherCoordinating the trial’s execution with medical professionals, consultants, or investigators. Establishing the trial sites entails ensuring each facility has the trial supplies, including the trial medicine, also known as the investigational medicinal product.\n• Medical RepresentativePharmaceutical corporations employ medical representatives (MRs), who meet with doctors to inform them of the new medications the company has introduced to the market. They resemble marketing managers for the company’s goods. Because MRs are in charge of generating sales of produced pharmaceuticals, this is a crucial position. They must be well knowledgeable about every drug that their company manufactures.\nFollowing a B. Pharma, you can work in the following fields:\n• Lecturer for D.Pharm. Colleges\n• Marketing Managers or a Sales Manager\nD Pharm certificate holders can immediately start working as pharmacists in India. Drug stores are everywhere, ranging from government hospitals, community health centres and private hospitals. They can also choose to open their own drug store. If you have good aptitude and interpersonal skills and a desire to help others, you can choose Pharmacy as your career. Pharmacists are vital for the primary health care system all around the world. The minimum requirement to become a registered pharmacist in India is Diploma in pharmacy (D.Pharm).\n• Accurate record keeping as required under Food and Drug Act.\n• Purchasing, Merchandising and Inventory control.\n• Regulatory requirements involving testing, screening and clinical trials of drugs.\nThere are many opportunities after completion of D.Pharma course:\n• You can get job at drug stores of private or government hospitals.\n• You can work in health clinics, NGOs, community health centres by checking the prescriptions, dispensing medicines and give them advice and directions.\n• You may get entry level jobs in pharmaceutical companies at various divisions like Process Control, Manufacturing and Quality Control.\n• If you have entrepreneurial spirit, you can open your own retail pharmacy outlet, wholesale business or surgical items shop.\nTo further enhance your chances of success you can pursue further studies:\n• If you have found your calling and passion in pharmaceutical studies, you can go for bachelor’s degree in pharmacy. In case you have already done D.Pharm you can directly apply for 2nd year of B.Pharm Thereafter, you can also pursue postgraduate degrees.\n• Another interesting future for your career can be degree in Law after D.Pharma Many pharmaceutical companies hire Litigation and IPR (Intellectual property) lawyers.\n"
    },
    "student_feedback": {
      "summary": "This collection of testimonials highlights Noida International University (NIU) as a highly regarded institution in Delhi NCR, praised for its excellent learning environment, quality of education, helpful faculty, and strong placement support. Students express satisfaction with the university's facilities, including its library and campus, and appreciate the assistance provided by faculty and placement teams, which has led to successful career opportunities in various reputable companies.",
      "raw_content": "I am doing MA from NIU and I like the university and I am very happy to be a part of this university. This is one of the best university in Delhi (NCR). I select this university for the best environment and good library and also the behavior of teachers and friends are also very good. I am not feeling like outside to my country. The study quality is also very best\nIt was my golden phase during my tenure at Noida International University where I learnt and take a leap forward towards my career growth. The entire faculty and department leaves no stone unturned to shape one's future. It’s been a wonderful experience of learning with prolific exposure to outside. A big thanks to the Placement Team of Noida International University for providing great opportunities and supporting me by providing best career option.\nPaytm Services Pvt. Ltd.\nNIU is one of the best international university in Delhi Ncr. I am a fourth semester BA Student. Till now my experience with NIU is very good. All the faculty members are very helpful. Education system is also very good. I am very happy to be a part of this university.\nNIU is one of the best university in India. All the teachers and friends are very helpful. Education system is also very interesting.I am very happy for being a part of this university\n\" Noida International University has given me an astonishing platform for the overall growth and development. Every faculty member of MBA department continuously provided assistance to grow in academics and my skills. NIU Placement is working hard for all students to get placed. \"\nNoida International University has provided us a very efficient platform for the exposure to the training and placement. I am very grateful to the university for providing us the best of placement opportunities and finally I got placed in HDFC and taken the first step to fulfilled my dreams.\nI was pleasantly surprised by the beautiful campus and the quality of facilities that Noida International University provides. Eventually the excellent pedagogy of the teachers and the amazing help I received to enhance my skill and improve my knowledge convinced me of the Excellency of Noida International University.\nNoida International University has always believed in helping and guiding its students and it was no different during the placement season. Regular classes held at our college to help us with our legal studies and skills were of great help. Our placement administration officers also guided and encouraged us at each step thereby helping me secure my placement at such a reputed company.\nI would like to thank our faculty members who have provided a very supportive environment. NIU undertakes and promotes various managerial, cultural, creative and many other diversified activities, which reflects the grand vision of the NIU and all such activities, helped in my overall development. I also like to thank our placement division who had provided us ample of opportunities and finally got me placed with Capital Brix\nCapital Brix Pvt. Ltd.\nNoida International University has been a great contributor towards the development of my personality. The infrastructure of Noida International University is one of the finest in the NCR region is what stands out the most. NIU, has best faculties with an attitude of being ever ready to help, and not only delivering classroom teachings, but also providing the students with real-time case technical projects and hands on industry experience with field work.\nIt been some of the lovely and memorable days I spent in Noida International University. NIU & its wonderful faculties are very cooperative and university environment is really good. Placement department has continuously provided assistance and gives opportunities in some of the best organizations in our country. NIU has made the best efforts to provide all the facilities for the students like Faculties, events, sports, etc.\nI'm so thankful that I chose Noida International University for my B.Tech program. I cherish the moments spent under the guidance of eminent faculty members, my mentors and Career Development Team. I highly recommend the University for giving an excellent learning environment and shaping my career.\nIngenious Energy Infratech Pvt. Ltd."
    },
    "admission_process": {
      "summary": "This text provides a list of links and information related to admissions, including applying for CUET Counselling, the admission process and alerts, details about the Admission and Outreach Team, Ph.D. admissions, and access to a domestic brochure for Indian students and a prospectus.",
      "raw_content": "Apply for CUET Counselling\nAdmission Process\nAdmission Alerts\nAdmission and Outreach Team\nPh.D. Admissions\nDomestic Brochure (Indian Students)\nProspectus\n• Apply for CUET Counselling\n• Admission Process\n• Admission AlertsAdmission and Outreach TeamPh.D. AdmissionsDomestic Brochure (Indian Students)Prospectus\n• Admission and Outreach Team\n• Domestic Brochure (Indian Students)"
    },
    "training_placement": {
      "summary": "This text appears to be a sitemap or navigation structure for a university department, likely focused on international students and MBA programs. It lists various sections related to scholarships, MBA programs, team information, training and placement processes, industry visits, placement records, recruiters, alumni, and contact information. The structure highlights key areas such as the placement policy and recruitments.",
      "raw_content": "• International Scholarship\n• Global MBA new\nOverviewThe TeamTraining & Placement ProcessPlacement PolicyIndustry Visit\nPlacement RecordRecruitersOur PlacementsNIU Star AlumniPlacement Contact\n• OverviewThe TeamTraining & Placement ProcessPlacement PolicyIndustry Visit\n• Training & Placement Process\n• Placement RecordRecruitersOur PlacementsNIU Star AlumniPlacement Contact\n• Recruiters"
    },
    "student_feedback_topics": {
      "summary": "The provided text lists various categories of feedback collected within an educational institution, including feedback from students on the curriculum, teachers, and the university overall, as well as feedback from teachers on the curriculum. It also includes feedback from alumni, parents, and employers, along with course exit surveys and a general feedback category.",
      "raw_content": "Student Feedback About Curriculum\nStudents Feedback About Teachers\nStudents Feedback About University in General\nTeachers’ Feedback About Curriculum\nAlumni Feedback\nParent’s Feedback\nCourse Exit Survey\nEmployer’s Feedback\n• Student Feedback About Curriculum\n• Students Feedback About Teachers\n• Students Feedback About University in General\n• Teachers’ Feedback About Curriculum\n• Alumni Feedback\n• Parent’s Feedback\n• Course Exit Survey\n• Employer’s Feedback\n• Feedback"
    },
    "university_administration": {
      "summary": "The provided text outlines various organizational structures and policy documents related to a university. It lists university authorities such as the Court, Board of Governors, Executive Council, and Academic Council, as well as various committees. Additionally, it enumerates a wide range of policies including HR, CRS, transport, scholarship, migration, sports, hostel, fee payment, and admission withdrawal policies. The text also mentions university ordinances, statutes, the university act, and financial documents like the balance sheet.",
      "raw_content": "Code of ConductIQACAnnual ReportsIICNISP 2019\nUNIVERSITY AUTHORITIES\nCourtBoard of GovernorsExecutive CouncilAcademic CouncilCOMMITTEES\nHR PoliciesCRS PoliciesTransport PoliciesScholarship PoliciesMigration Policy\nSports Scholarship PolicyUniversity Hostel PolicySports PoliciesFee Payment PolicyFee Payment ProcedureAdmission Withdrawal Policy\nUniversity OrdinancesUniversity StatuteUniversity ACTBalance Sheet\n"
    }
  }
}