{
  "source_file": "niu.edu.in_Best_Nursing_College_in_Delhi-NCR_NIU_raw_2025-08-10-18-48-40.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text appears to be a collection of navigation links or keywords from a university website, covering various aspects such as university authorities, committees, policies, schools, admissions, career services, placements, feedback, and general information like annual reports and conduct codes. It lists specific departments, academic programs, and administrative procedures, indicating a comprehensive overview of the institution's structure and offerings.",
      "raw_content": "ICAIMISMDAHSSICADISNIRFNIIMSCAREERSR&DNIUMOOCSGRIEVANCES\n• CAREERS\nCode of ConductIQACAnnual ReportsIICNISP 2019\nUNIVERSITY AUTHORITIES\nCourtBoard of GovernorsExecutive CouncilAcademic CouncilCOMMITTEES\nHR PoliciesCRS PoliciesTransport PoliciesScholarship PoliciesMigration Policy\nSports Scholarship PolicyUniversity Hostel PolicySports PoliciesFee Payment PolicyFee Payment ProcedureAdmission Withdrawal Policy\nUniversity OrdinancesUniversity StatuteUniversity ACTBalance Sheet\n• About NIULeadershipRecognitions & ApprovalsDASAAwards & AchievementsCollaborationsInternational MOUs\n• Leadership\n• Code of ConductIQACAnnual ReportsIICNISP 2019\n• Annual Reports\n• NISP 2019\n• UNIVERSITY AUTHORITIES\n• Board of Governors\n• CRS Policies\n• Scholarship Policies\n• Sports Scholarship Policy\n• University Hostel Policy\n• Fee Payment Policy\n• Fee Payment Procedure\n• University Ordinances\n• University Statute\n• University ACT\nSchool Of Business ManagementSchool Of Allied Health SciencesSchool Of Liberal ArtsSchool Of Pharmacy\nSchool Of NursingSchool Of Law & Legal AffairsSchool of Engineering & TechnologySchool Of Sciences\nSchool Of Journalism & Mass CommunicationSchool Of EducationSchool of Fine Arts & DesignNIIMS\n• School Of Business ManagementSchool Of Allied Health SciencesSchool Of Liberal ArtsSchool Of Pharmacy\n• School Of Business Management\n• School Of Allied Health Sciences\n• School Of Liberal Arts\n• School Of NursingSchool Of Law & Legal AffairsSchool of Engineering & TechnologySchool Of Sciences\n• School Of Nursing\n• School Of Law & Legal Affairs\n• School of Engineering & Technology\n• School Of Journalism & Mass CommunicationSchool Of EducationSchool of Fine Arts & DesignNIIMS\n• School Of Journalism & Mass Communication\n• School of Fine Arts & Design\nApply for CUET CounsellingAdmission ProcessCourses & Fee Structure For 2025-26Scholarship & Bank LoanTransportHostels\nAdmission AlertsAdmission and Outreach TeamPh.D. AdmissionsDomestic Brochure (Indian Students)Prospectus\n• Apply for CUET CounsellingAdmission ProcessCourses & Fee Structure For 2025-26Scholarship & Bank LoanTransportHostels\n• Apply for CUET Counselling\n• Courses & Fee Structure For 2025-26\n• Scholarship & Bank Loan\n• Admission AlertsAdmission and Outreach TeamPh.D. AdmissionsDomestic Brochure (Indian Students)Prospectus\n• Admission and Outreach Team\n• Domestic Brochure (Indian Students)\nComputer LabsWorkshops & ClassroomsLaboratoriesLibrary\nNIU ClubsEvent VideoNotice BoardCampus Virtual TourSports\n• International Scholarship\n• Global MBA new\nOverviewThe TeamTraining & Placement ProcessPlacement PolicyIndustry Visit\nPlacement RecordRecruitersOur PlacementsNIU Star AlumniPlacement Contact\n• OverviewThe TeamTraining & Placement ProcessPlacement PolicyIndustry Visit\n• Training & Placement Process\n• Placement RecordRecruitersOur PlacementsNIU Star AlumniPlacement Contact\n• Recruiters\n• Feedback\nStudent Feedback About CurriculumStudents Feedback About TeachersStudents Feedback About University in GeneralTeachers’ Feedback About CurriculumAlumni FeedbackParent’s FeedbackEmployer’s Feedback\n• Apply Now 2025\nCAREERS\nLeadership\nNISP 2019\nAnnual Reports\nBoard of Governors\nUniversity Ordinances\nUniversity ACT\nUniversity Statute\nFee Payment Policy\nFee Payment Procedure\nScholarship Policies\nSports Scholarship Policy\nCRS Policies\nUniversity Hostel Policy\nSchool Of Business Management\nSchool Of Nursing\nSchool Of Law & Legal Affairs\nSchool Of Journalism & Mass Communication\nSchool Of Allied Health Sciences\nSchool of Engineering & Technology\nSchool of Fine Arts & Design\nSchool Of Liberal Arts\nApply for CUET Counselling\nScholarship & Bank Loan\nDomestic Brochure (Indian Students)\nAdmission and Outreach Team\nCourses & Fee Structure For 2025-26\nGlobal MBA new\nTraining & Placement Process\nRecruiters\n• COVID-19"
    },
    "admission_requirements": {
      "summary": "This document outlines admission information for various courses, including CUET Counselling, Ph.D. Admissions, Bachelor of Science in Nursing (B.Sc.), and General Nursing & Midwifery (GNM). For the B.Sc. Nursing program, applicants must be at least 17 years old and have passed 10+2 with Science (PCB) and English, with a minimum of 45% or 50% aggregate marks. The GNM program also requires a minimum age of 17 and 10+2 with English, with specific mark requirements for general, vocational ANM, and vocational healthcare science streams. Disability and SC/ST reservation policies are also mentioned for GNM admissions.",
      "raw_content": "• Apply for CUET Counselling\n• Admission Process\n• Domestic Brochure (Indian Students)\n• Ph.D. Admissions\nB.Sc. | Bachelor of Science in Nursing | The minimum age for admission shall be 17 years on 31st December of the year in which admission is sought with 10+2 class passed with Science (PCB) & English Core/English Students appearing in 10+2 examination in Science conducted by National Institute of Open School with 45% marks. Elective with aggregate of 50% marks from recognized board and | 4 | 181500 | 168000 | 175000 | 182400 | N/A | 706900 | Enquire Now\nGNM | General Nursing & Midwifery | The minimum age for admission shall be 17 years on 31st December of the year in which admission is sought with 10+2 with English and must have obtained a minimum of 50% at the qualifying examination and English individually for any recognized board and 10+2 with English having 50% of marks in vocational ANM course from the school recognized by Indian Nursing council and 10+2 with English having 50% of marks in Vocational Stream-Health care Science from a recognized CBSE board/Centre. For disabled candidates: 3% Disability reservation to be considered and 5% is relaxed for SC/ST candidates. | 3 | 136500 | 120000 | 125000 | N/A | N/A | 381500 | Enquire Now"
    },
    "student_feedback": {
      "summary": "This document contains a collection of positive student feedback regarding Noida International University (NIU). Students consistently praise the university's excellent infrastructure, helpful and knowledgeable faculty, and the positive cross-cultural environment. Many highlight the university's role in their personal and academic development, with specific mentions of supportive teachers, well-equipped labs and libraries, and opportunities for clinical practice. The feedback also touches upon the university's ability to foster discipline, motivate students, and provide a welcoming atmosphere for international students.",
      "raw_content": "Student Feedback About Curriculum\nStudents Feedback About Teachers\nStudents Feedback About University in General\nTeachers’ Feedback About Curriculum\nAlumni Feedback\nParent’s Feedback\nCourse Exit Survey\nEmployer’s Feedback\n• Student Feedback About Curriculum\n• Students Feedback About Teachers\n• Students Feedback About University in General\n• Teachers’ Feedback About Curriculum\n• Alumni Feedback\n• Parent’s Feedback\n• Course Exit Survey\n• Employer’s Feedback\nNoida International University has been a great contributor to the development of my personality. The infrastructure of Noida International University is one of the finest in NCR region is what stand out the most. The best thing about the University is the cross-culture interaction between students from various part of the world. The professor here make the University what is today. With an attitude of being ever ready to help and not only delivering classroom teaching, but they are also the pillars of the learning gained from the esteemed University and this is treasure for life I am very happy with my university. Thank you.\nUDIT GOUR - B.Sc. (N) 1ST YEAR\nMy name is Tulsi Rana and I am pursuing B.Sc. Nursing from Noida International University. I am glad to provide you with my feedback about the university. I see a bright future for myself in Nursing that's why I chose to study B.Sc. Nursing and this university is one of the best to study. This university keep students in discipline and help the students to build their bright future. Faculty here are very good and always help the students in their studies. I suggest everyone to take admission in NIU because of its infrastructure and its way of teaching. Thank you.\nTULSI RANA – B.SC. (N) 1ST YEAR\nGood morning everybody. I would like to thank to organizer for their kind invitation towards me to enabling me to participate in this wonderful forum. I am Anand Singh GNM 1st year, School of Nursing Noida International University. My university is the best in our city. All the teacher of my university are very sincere and kind hearted. My favourite teacher is MC. Kniranda ma’am. Our university has a very big campus, there is a computer lab, science lab and a big library. I have free ranging in the university and this rule is very nice of the university I am proud being a student of this university. We all study here like a family I have full faith that I willget success through this university. Thank you.\nANAND KUMAR SINGH – GNM 1ST YEAR\nHi hi!! are you looking for a cool and standard university?? Then you should go for Noida International University. Noida international university celebrates a diverse and talented international student community. Our university help to motivate applicants to achieve their personal and academic goals. Our university campus is huge. Our classmates and other prospective are helping. International students doesn’t face language barrier and culture shock in our university. All faculty members are helpful, supportive and especially kind in nature.\nAKANKSHA SHARMA – GNM 1ST YEAR\nI feel great to be in Noida International University. The teachers here are very good and they teach very well and their way of teaching and explaining is very simple. Noida International University being at an international level, we got the opportunity to study with foreign students and learn about their culture. Ragging is absolutely free in Noida International University and the seniors here are also very nice and treat us well and also help us. These activities keep happening from time to time and every time we get to learn something new.\nSHIVAM KUMAR – GNM 1ST YEAR\nMy name is Khushi Joshi, student of GNM 1st year. My experience with NIU is great. Our University has a great infrastructure and up to date furnished classrooms, library, labs, auditorium, and cafeteria. Our staff and faculties are much kind and supportive. They treat us like family members. Facilities like hostel, hospital and transportation are provided.\nKHUSHI JOSHI – GNM 1ST YEAR\nMy experience in Noida International University is very great because we have very good teachers and it is really great. All the teachers support their students and so many books are available in library which is very for a university.\nSAGAR BHATI – GNM 1ST YEAR\nI have the privilege to be in the first batch of B. Sc. Nursing at Noida international University. My experience with NIU has positively impact me personally. It is a great institute for any student, who want to pursue nursing as a career. You got one of the best infrastructure facilities and brilliant faculty, as it gives enough opportunity to every student to shine in their chosen career. I was impress with smart classroom based lectures. It has given me an edge to improve my theoretical knowledge with its well-equipped laboratory and library. It is also attached with best hospital which help to enhance my clinical skills. I would like to thank all the faculty and staffs of NIU for being blessing in my life.\nDEEPAK KUMAR – B.Sc. (N) 1ST YEAR\nMy name is Blessing Benjamin Ebiladei. I am from Africa, Nigeria precisely, I'm pursuing B.Sc. Nursing, from School of Nursing. I was so excited when I heard I am going to be studying in India but I never knew it will be one of the best schools in India, smiles, therefore if I am allowed I would like to express my feelings and would like to share my experience in Noida International University, my experience so far has been the best I would proudly say that my school is outstanding, fun, educative and full of adventures. I remember being angry one particular day and I decided to go outside to see what's happening. As soon as I reached outside I just had to smile because people were dancing and that gave me a reason to smile that's what you experience when you go to an interesting school like Noida International University.\nBLESSING BENJAMIN EBILADEI – B.Sc. (N) 1st YEAR\n'' I am one of the student at the Department of Nursing at Noida International University, Delhi NCR, All our teachers are extremely knowledgeable, and they're always eager to help us in our times of need. They're kind enough to each and every student. They don't differentiate between anyone and so we always felt like we have their affection showered on us equally. We are blessed to find such teachers in our college. Every teacher respects us like a family member, before class joining, I had lots of wrong thoughts in my mind, but after class joining I am so happy to be part of Noida International University. Our respected HOD, Vidya ma’am , Shivani ma’am everyone says \" we can make everything possible\".\nSHOWKAD AHMED – B.Sc. (N) 1ST YEAR\nMy experience in NIU is great. I am proud to be a part of this great University. I am pursuing B.Sc. Nursing from School of Nursing. The faculties are very cooperative and experienced. It has one of the beautiful infrastructure you have ever seen. Also the non - teaching staff and management are very cooperative. The various kinds of extra-curricular activities organised by the University helps you to grow as an individual. It's my honour to be a part of this amazing University.\nNIKHIL SINGH – B.Sc. (N) 1ST YEAR\nIt gives me great pleasure to say with pride that I am doing B.Sc. Nursing from School of Nursing, NIU. The relationship between faculties and students is very cordial, which give me an opportunity to excel in my area of interest. I would like to thanks NIU and the facilities and staff for making me a \"Better Person\".\nMANISH GIRI – B.Sc. (N) 1ST YEAR\nMy experience with the NOIDA INTERNATIONAL UNIVERSITY has positive impact in my profession. It is a very brilliant college for me I am pursuing B.Sc. (Nursing) as a career. I am happy to be a part of this university. The faculties is excellent, they really help every student and they motivate many times. In my 1st semester it was hard but now everything is well. Many labs and practical instruments are there for the practical learning. Most beautiful and fresh environment. I am excited for the next stage.\nKANIKA - B.Sc. (N) 1ST YEAR\nIt is rightly said that UNIVERSITY SHOULD BE A PLACE OF LIGHT - LIBERTY – LEARNING. Our university fulfilled all these three golden \" L \" as related to educational arena . Noida International University is an amazing place where people from different parts of country meet together and share one common goal “EDUCATION . I feel privileged that I got opportunity to meet the dynamic and distinguished faculties, who are enthusiastic, friendly, patient and highly qualified. With their guidance and constant mentoring. \" My experience at Noida International University was nothing but valuable\". The quality education supported by the most passionate and helpful instructors helped me to my great potential .\nDIVYA SINGH - B.Sc. (N) 1ST YEAR\nNoida International University is not just a university for getting degree but a place which allow you to explore more of yourself and create environment very different from the outside world .This university provides a gadget free and strict environment which encourage you to focus more on you and your surroundings, enhancing your social skills and figuring out the solution on your own . Ever since I entered this institution, I had never looked back or questioned my decision .It has a great infrastructure. Being a student from medical stream ,It was my immense luck and fortune to be a part of NIU family. The entire faculty and department leaves no stone unturned to shape one’s future. The teacher has a helpful attitude and not only believe in classroom teaching but also go beyond to help students achieve academic excellence. Overall it is a great experience and full of learning and grooming oneself.\nYACHIKA SHARMA - B.Sc. (N) 1ST YEAR"
    },
    "event_reports": {
      "summary": "This list details various events, seminars, workshops, lab views, and reports from a nursing and health-related institution. Topics covered include community health, nutrition, pediatrics, mental health awareness days (like World Suicide Prevention Day and World Mental Health Day), health campaigns (like Pulse Polio and TB awareness), educational activities, facility visits, and innovation programs. Several reports are dated in 2022 and 2024, indicating ongoing activities and recent events.",
      "raw_content": "COMMUNITY HEALTH NURSING LAB VIEW 1\nCOMMUNITY HEALTH NURSING LAB VIEW 2\nPRE-SCIENCE LAB VIEW 2\nNUTRITION LAB VIEW 1\nNUTRITION LAB VIEW 2\nPEDIATRIC LAB VIEW 1\nPEDIATRIC LAB VIEW 2\nPRE-SCIENCE LAB VIEW 1\nEXPERT TALK ON WORLD SUICIDE PREVENTION DAY\nREPORTS ON INNOVATION & ENTREPRENEURSHIP PROGRAM\nPLACEMENT REPORT- GNM III YEAR (BATCH 2020-21)\nIntellectual Property Rights (IPR): Innovation In Healthcare\nExpert Talk On Educational Councelling\nReport On Household/ Family Adoption\nREPORT ON WORLD CONTRACEPTION DAY\nREPORT ON WORLD NUTRITION DAY\nREPORT ON WOMEN’S EMPOWERMENT DAY\nReport On One Week Pulse Polio Drop Drive\nREPORT ON ROAD SAFETY PREVENTION\nREPORT ON SCHOOL CHALE HUM\nREPORT ON NATIONAL HIV/ AIDS AND AGING AWARENESS DAY\nREPORT ON STREE SWABHIMAN PROGRAM\nREPORT ON WORDS INTERNATIONAL LITERACY DAY\nREPORT ON POLIOMYELITIS AWARENESS PROGRAM\nREPORT ON MOBILE ADDICTION EFFECTS ON CHILDREN\nREPORT ON SAY NO TO PLASTIC\nREPORT ON COVID 19 BOOSTER DOSE CAMPAIGN\nReport On Primary School Visit Luksar Village\nSeminar On International Safe Abortion Day\nSeminar On Suicide Prevention Day !\nREPORT OF THE ANATOMY & PHYSIOLOGY WORKSHOP\nSON Organises World Suicide Prevention Day\nNoida International University celebrated India’s 75th Independence Day on the morning of 15th August, 2021.\nE-Conference on “Avant Garde Trends in Rehabilitation\nCelebrates Alumni Meet 2021\nREPORT ON VISIT TO OLD AGE HOME (Arya Mahila Ashram)\nREPORT ON TB AWARENESS PROGRAMME CAMPAIGN AT DANKAUR PHC.\nREPORT ON COOKING DEMONSTRATION 01/JULY/2022\nEVENT REPORT ON FEMININE HYGIENE (24th June 2022)\nORIENTATION REPORT 1st August 2022 Academic Session 2022-23\nREPORT ON BREAST FEEDING AWARNESS PROGRAM\nREPORT ON DOOR TO DOOR HEALTH AWARNESS PROGEAM (KHALI BHAV MOZAMPUR)\nREPORT ON MID-DAY MEAL PROGRAM\nREPORT ON NUTRITION AWARENESS PROGRAM\nWORKSHOP REPORT: NEONATAL RESUSCITATION 27th July 2022\nWEBINAR REPORT ON 08/AUGUST/2022\nREPORT ON UNI-ENTRENOVA 2.0 INTERNATIONAL CONFERENCE\nNATIONAL WORKSHOP ON “BIOMEDICAL RESEARCH IN PUBLIC HEALTH”\nTrained Nurses Association Of India (TNAI) Visit – Greater Noida\nReport On Coca-Cola Facility Visit\nReport On Educational Visit To Parag Dairy\nREPORT ON WORLD SUICIDE PREVENTION DAY 2024\nREPORT ON WORLD MENTAL HEALTH DAY 2024\nEVENT REPORT ON “FIRST- AID WEEK”\nBREAST CANCER AWARENESS DAY 2024\nReport On Immunization Awareness Program\nLung Cancer Awareness And Health Education Session\nLAMP LIGHTING AND OATH-TAKING CEREMONY 2024\nReport On AIDS Day Celebration\nReport On Old Age Home Visit And Geriatric Care Awareness\nEvent Report On “Food Fest”\nEvent Report On “Sports Fest 2024-2025”\nReport On Alzheimer’s Awareness Program\nReport On Coca-Cola Visit\nReport On 3-Days Hand On Skill Workshop\nPLACEMENT REPORT- GNM III YEAR (BATCH 2021-24)\nTogether for a period friendly world\nINTERDISCIPLINARY RESEARCH INNOVATIVE SYSTEM AND GRANTS\nSchool Of Nursing Presents Seminar In Association With IIDE CHAT-GPT For Growth Hacking\nPoster Making Competition On National Pollution Day\nHANDS ON TRAINING ON FIRST AID AND CPR\nReport On Motivational Session\nSchool Of Nursing Welcomes Delegates From Norway, Poland And Lithuania\nCOMMUNITY AWARENESS PROGRAM AND EXTENSION ACTIVITY ON WORLD POLIO DAY\nCOMMUNITY AWARENESS PROGRAM AND EXTENSION ACTIVITY ON WORLD GIRL CHILD DAY\nBREAST CANCER AWARENESS PROGRAM ON WORLD BREAST CANCER PREVENTION DAY\nSESSION ON VR FOR HEALTH TRAINING"
    }
  }
}