{
  "source_file": "niu.edu.in_Best_School_of_Education_-_Noida_International_University_raw_2025-08-10-18-48-40.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text appears to be a sitemap or navigation structure for a university website, likely Northern India University (NIU). It lists various sections such as Careers, Feedback, About NIU (including leadership, awards, and international collaborations), IQAC and annual reports, university authorities like the Board of Governors, and various policies related to fees, scholarships, and hostels. It also includes references to specific initiatives like NISP 2019 and NIIMS, as well as a Training & Placement section with details on process, records, recruiters, and alumni. A COVID-19 section is also present.",
      "raw_content": "• CAREERS |\n• FEEDBACK |\n• CAREERS\n• About NIULeadershipRecognitions & ApprovalsDASAAwards & AchievementsCollaborationsInternational MOUs\n• Leadership\n• Code of ConductIQACAnnual ReportsIICNISP 2019\n• Annual Reports\n• NISP 2019\n• UNIVERSITY AUTHORITIES\n• Board of Governors\n• CRS Policies\n• Scholarship Policies\n• Sports Scholarship Policy\n• University Hostel Policy\n• Fee Payment Policy\n• Fee Payment Procedure\n• University Ordinances\n• University Statute\n• University ACT\nNIIMS\n• International Scholarship\n• Global MBA new\n• OverviewThe TeamTraining & Placement ProcessPlacement PolicyIndustry Visit\n• Training & Placement Process\n• Placement RecordRecruitersOur PlacementsNIU Star AlumniPlacement Contact\n• Recruiters\n• Feedback\nCAREERS\nLeadership\nNISP 2019\nAnnual Reports\nBoard of Governors\nUniversity Ordinances\nUniversity ACT\nUniversity Statute\nFee Payment Policy\nFee Payment Procedure\nScholarship Policies\nSports Scholarship Policy\nCRS Policies\nUniversity Hostel Policy\n• COVID-19\n"
    },
    "admission_requirements": {
      "summary": "The provided text outlines the eligibility criteria and fee structure for two educational programs: Bachelor of Education (B.Ed.) and Master of Arts in Education (M.A. Education). For the B.Ed. program, candidates need at least 50% in their Bachelor's or Master's degree in Sciences, Social Sciences, or Humanities, or 55% in Engineering/Technology with a Science/Math specialization. The M.A. Education program requires a minimum of 50% in a B.A. (Hons.) in Education or a Bachelor's degree in any discipline, with a specific mention of 45% if Education is the subject.",
      "raw_content": "B.Ed. – (4 Semesters, 2 Years Course) Candidates with at least 50% (Fifty percent) marks either in the Bachelor’s Degree and/or in the Master’s degree in Sciences/ Social Sciences/ Humanities, Bachelor’s in Engineering or Technology with specialization in Science and Mathematics with 55 % (Fifty-Five percent) marks, or any other qualification equivalent thereto, are eligible for admission to the program.\nM.A. Education—B.A. (Hons.) in Education or Bachelor Degree in any discipline with at least 50% marks in aggregate or 45% marks in the subject of Education.\nPROGRAM | COURSE | ELIGIBILITY | DURATION | IST YEAR FEE | IIND YEAR FEE | IIIRD YEAR FEE | IVTH YEAR FEE | VTH YEAR FEE | FULL COURSE FEE | Enquire Now\nB.Ed | Bachelor of Education | Candidates with at least 50% (Fifty per cent) marks either in the Bachelor’s Degree and/or in the Master’s degree in Sciences/ Social Sciences/ Humanities, Bachelor’s in Engineering or Technology with specialization in Science and Mathematics with 55 % (Fifty-Five per cent) marks or any other qualification equivalent thereto are eligible for admission to the program. | 2 | 54000 | 55300 | N/A | N/A | N/A | 109300 | Enquire Now\nMA-Ed | Master of Arts with specialization in Education | Minimum 50% in B.A (Hons.) in education or Bachelors’s Degree in any discipline with at least 50% marks in aggregate or 50% marks in the subject of Education | 2 | 44000 | 44800 | N/A | N/A | N/A | 88800 | Enquire Now"
    },
    "career_prospects": {
      "summary": "The provided text highlights the increasing demand for teachers in India due to the emergence of new schools annually. It details various career paths available to individuals with a B.Ed. degree, including teaching in government and private schools, becoming school principals, educational assistants, online tutors, coaches, private tutors, educational counselors, content writers, and pursuing higher education to become lecturers or professors.",
      "raw_content": "• Every year, a number of new schools are emerging, which is resulting in the growing demand for teachers in India.\n• Ed degree becomes eligible to get job opportunities as a Teacher in various sectors, including Central Government, State Government, and Private Managed Schools.\n• Ed degree holders can become the Head/Principal of the School.\n• Ed degree becomes eligible to get job opportunities as Educational Assistant in various State Government and Private Educational offices.\n• Ed candidates can go for online tutoring as a profession.\n• Another job option for a B.Ed. degree holder is coaching institutes.\n• Ed degree holders can also become private/home tutors.\n• After B.Ed., candidates can also become educational counsellors to guide students dealing with academic problems.\n• A B.Ed. degree holder can also opt for a content writer job, as various websites and portals these days hire candidates from different professions.\n• A B.Ed. degree holder can also pursue higher education by becoming a lecturer or professor at colleges or universities.\n• Ed candidates can pursue M.Ed. courses.\n• Ed candidates can pursue M.A. Education Courses."
    },
    "alumni_testimonials": {
      "summary": "Dr. Hari Narayan Hota describes his positive experience pursuing a PhD and a B.Ed. at Noida International University, highlighting the supportive faculty, good campus environment, and exposure to a multicultural setting. He considers NIU the best option in Delhi/NCR for a B.Ed. degree, emphasizing the quality of education and the enriching learning experience.",
      "raw_content": "Dr. Hari Narayan Hota\nPursuing PhD from Noida International University turned out to be the best decision of my life. The campus environment is really good and faculty members are very supportive. Being an international university, we also get to experience the multi-culture environment at our campus and learn about different cultures and ideologies.\nIt has been a great learning experience so far. Noida International University believes in imparting quality education and their intent is reflected in the course curriculum set for students. I have learned so much here. NIU is the best option in Delhi/NCR to pursue B.Ed. course.\nB.Ed. Session - 2020-2022\nOpting to pursue B.Ed from Noida International University turned out to be the best decision of my life. The campus environment is really good and faculty members are very supportive. Being an international university, we also get to experience the multi-culture environment at our campus and learn about different cultures and ideologies.\nB.Ed. Session - 2021-2023"
    }
  }
}