{
  "source_file": "niu.edu.in_Best_College_of_Allied_Health_Sciences_NIU_raw_2025-08-10-18-48-40.txt",
  "structured_data": {
    "general_info": {
      "summary": "This document appears to be a sitemap or navigation structure for a university website, listing various sections such as student and teacher feedback, university authorities, committees, policies, schools/departments, admissions, scholarships, career services, and leadership. It categorizes information related to academic feedback, administrative bodies, institutional policies, academic programs, student life, and career development.",
      "raw_content": "• CAREERS |\n• FEEDBACK |\nStudent Feedback About Curriculum\nStudents Feedback About Teachers\nStudents Feedback About University in General\nTeachers’ Feedback About Curriculum\nAlumni Feedback\nParent’s Feedback\nCourse Exit Survey\nEmployer’s Feedback\n• Student Feedback About Curriculum\n• Students Feedback About Teachers\n• Students Feedback About University in General\n• Teachers’ Feedback About Curriculum\n• Alumni Feedback\n• Parent’s Feedback\n• Course Exit Survey\n• Employer’s Feedback\nICAIMISMDAHSSICADISNIRFNIIMSCAREERSR&DNIUMOOCSGRIEVANCES\n• CAREERS\nCode of ConductIQACAnnual ReportsIICNISP 2019\nUNIVERSITY AUTHORITIES\nCourtBoard of GovernorsExecutive CouncilAcademic CouncilCOMMITTEES\nHR PoliciesCRS PoliciesTransport PoliciesScholarship PoliciesMigration Policy\nSports Scholarship PolicyUniversity Hostel PolicySports PoliciesFee Payment PolicyFee Payment ProcedureAdmission Withdrawal Policy\nUniversity OrdinancesUniversity StatuteUniversity ACTBalance Sheet\n• About NIULeadershipRecognitions & ApprovalsDASAAwards & AchievementsCollaborationsInternational MOUs\n• Leadership\n• Code of ConductIQACAnnual ReportsIICNISP 2019\n• Annual Reports\n• NISP 2019\n• UNIVERSITY AUTHORITIES\n• Board of Governors\n• CRS Policies\n• Scholarship Policies\n• Sports Scholarship Policy\n• University Hostel Policy\n• Fee Payment Policy\n• Fee Payment Procedure\n• University Ordinances\n• University Statute\n• University ACT\nSchool Of Business ManagementSchool Of Allied Health SciencesSchool Of Liberal ArtsSchool Of Pharmacy\nSchool Of NursingSchool Of Law & Legal AffairsSchool of Engineering & TechnologySchool Of Sciences\nSchool Of Journalism & Mass CommunicationSchool Of EducationSchool of Fine Arts & DesignNIIMS\n• School Of Business ManagementSchool Of Allied Health SciencesSchool Of Liberal ArtsSchool Of Pharmacy\n• School Of Business Management\n• School Of Allied Health Sciences\n• School Of Liberal Arts\n• School Of NursingSchool Of Law & Legal AffairsSchool of Engineering & TechnologySchool Of Sciences\n• School Of Nursing\n• School Of Law & Legal Affairs\n• School of Engineering & Technology\n• School Of Journalism & Mass CommunicationSchool Of EducationSchool of Fine Arts & DesignNIIMS\n• School Of Journalism & Mass Communication\n• School of Fine Arts & Design\nApply for CUET CounsellingAdmission ProcessCourses & Fee Structure For 2025-26Scholarship & Bank LoanTransportHostels\nAdmission AlertsAdmission and Outreach TeamPh.D. AdmissionsDomestic Brochure (Indian Students)Prospectus\n• Apply for CUET CounsellingAdmission ProcessCourses & Fee Structure For 2025-26Scholarship & Bank LoanTransportHostels\n• Apply for CUET Counselling\n• Courses & Fee Structure For 2025-26\n• Scholarship & Bank Loan\n• Admission AlertsAdmission and Outreach TeamPh.D. AdmissionsDomestic Brochure (Indian Students)Prospectus\n• Admission and Outreach Team\n• Domestic Brochure (Indian Students)\nComputer LabsWorkshops & ClassroomsLaboratoriesLibrary\nNIU ClubsEvent VideoNotice BoardCampus Virtual TourSports\n• International Scholarship\n• Global MBA new\nOverviewThe TeamTraining & Placement ProcessPlacement PolicyIndustry Visit\nPlacement RecordRecruitersOur PlacementsNIU Star AlumniPlacement Contact\n• OverviewThe TeamTraining & Placement ProcessPlacement PolicyIndustry Visit\n• Training & Placement Process\n• Placement RecordRecruitersOur PlacementsNIU Star AlumniPlacement Contact\n• Recruiters\n• Feedback\nStudent Feedback About CurriculumStudents Feedback About TeachersStudents Feedback About University in GeneralTeachers’ Feedback About CurriculumAlumni FeedbackParent’s FeedbackEmployer’s Feedback\n• Apply Now 2025\nCAREERS\nLeadership\nNISP 2019\nAnnual Reports\nBoard of Governors\nUniversity Ordinances\nUniversity ACT\nUniversity Statute\nFee Payment Policy\nFee Payment Procedure\nScholarship Policies\nSports Scholarship Policy\nCRS Policies\nUniversity Hostel Policy\nSchool Of Business Management\nSchool Of Nursing\nSchool Of Law & Legal Affairs\nSchool Of Journalism & Mass Communication\nSchool Of Allied Health Sciences\nSchool of Engineering & Technology\nSchool of Fine Arts & Design\nSchool Of Liberal Arts\nApply for CUET Counselling\nScholarship & Bank Loan\nDomestic Brochure (Indian Students)\nAdmission and Outreach Team\nCourses & Fee Structure For 2025-26\nGlobal MBA new\nTraining & Placement Process\nRecruiters\n• COVID-19"
    },
    "admission_requirements": {
      "summary": "The provided text lists five Bachelor of Science (BSc) degrees and one Bachelor of Optometry (B.Optom) degree, all related to specialized healthcare fields including Cardiac Care, Operation Theatre, Optometry, Radiology & Imaging, Renal Dialysis, and Medical Laboratory Technology.",
      "raw_content": "• BSc (Cardiac Care Technology)\n• BSc (Operation Theatre Technology)\n• B.Optom (Bachelor of Optometry)\n• BSc (Radiology & Imaging Technology)\n• BSc (Renal Dialysis Technology)\n• BSc Medical Laboratory Technology"
    },
    "school_details": {
      "summary": "The School of Allied Health Sciences (SOAHS) at Noida International University, associated with a 750-bedded multispecialty hospital, aims to improve global health through teaching, research, and patient care. It seeks to produce skilled healthcare professionals, foster research for advancing healthcare practices and policies, and provide person-centered care focused on patient outcomes and well-being. The SOAHS offers a diverse range of courses taught by experienced faculty, with a curriculum designed to meet industry needs, complemented by interactive learning opportunities and early exposure to a hospital environment. Graduates are prepared for various rewarding careers, and the school plays an integral role in transforming healthcare.",
      "raw_content": "The School of Allied Health Sciences associated with the on-campus 750 bedded NIIMS multispecialty hospital is to improve the health and wellbeing of all nations through exemplary and culturally sensitive teaching, innovative research, and patient care. The Institute of Allied Health Sciences envisages producing a diverse, interprofessionally skilled workforce of healthcare practitioners, educators, researchers, and healthcare leaders. Our college of health sciences aims to conduct research to generate new knowledge that advances the practices and policies of health care.\nThe in-campus hospital provides the science and practice of person-centred care with a focus on patient outcomes, families, communities, integrative health care, health promotion/disease prevention, and the improvement of overall quality of life.\nThroughout our teaching, research, and clinical care, we are committed to engagement with diverse student, faculty, and patient populations to create an inclusive and enriching environment for learning. All Allied Health Sciences Courses are offered, and taught by the best allied health sciences faculties.\nAs Dean of the School of Allied Health Sciences at Noida International University, I extend a most sincere welcome to all prospective students.\nAccounting for nearly two-thirds of the entire health workforce, allied health professionals practice individually and in interdisciplinary teams to provide an extraordinary range of diagnostic, technical, therapeutic, and direct patient care. Allied with one another, as well as with medicine and nursing, the professions represented within the School of Allied Health Sciences work to improve the quality of life for patients, their families, and their communities.\nOur graduates assume rewarding careers as dieticians, medical technologists, physical and occupational therapists, clinical and rehabilitation counsellors, and radiographers, among others. With such diversity, the SOAHS role is integral in transforming health care, not just nationally or internationally but also in local communities.\nI am proud to support our mission and to represent the talented and diverse students, faculty, and staff who make SOAHS so vital and important. I urge you to take a few moments to explore our many programs and services.\n• An industry needs a based, designed curriculum with inputs from top academic & professional bodies.\n• Interactive sessions, workshops, seminars, paper presentations, and quizzes.\n• 750 bedded on- campus Multi-Speciality hospital with all modern facilities and experienced faculty.\n• An early exposure to the hospital environment with hands-on training for students\n"
    },
    "events": {
      "summary": "This compilation lists various events, reports, and academic activities, primarily within the healthcare and education sectors. It includes a range of medical topics such as liver function testing, ergonomics, palliative care, ophthalmology, physiotherapy, and specific procedures like Percutaneous Transluminal Coronary Angioplasty. The list also highlights awareness drives, industry visits, workshops, and student achievements, indicating a focus on professional development, community outreach, and academic engagement.",
      "raw_content": "Recent Advancements Of Liver Function Testing\nWebinar On Human Ergonomics\nPost Event Report Of APHCON 2024 Conference\nReport On TB Awareness Camp\nPercutaneous Transluminal Coronary Angioplasty\nVision Screening Camp On World Optometry Week\n3rd National Conference Of Operation Theatre Technologist 2024\nMultidisciplinary Introduction to the Growing Specialty of Palliative Care\nINSIGHTS OF AN OPTICAL INDUSTRY: LENS DESIGNS FOR EVERY OCCUPATIONAL NEED\nIDOR Report: International Day of Radiology\nNATIONAL ENTREPRENEURSHIP DAY\nPost Event Report – Trip To Surajkund Mela\nPost Event Report – WORLD LEPROSY DAY\nPost Event Report Vision Screening Camp\nCommunity Visit And Awareness Drive For World AIDS Day\nWebinar On Industry Connect: Bynocs\n3-Day Workshop On PCR (Polymerase Chain Reaction) And FNAC (Fine Needle Aspiration Cytology)\nAcademic & Research Committee Meet\nOnline Webinar Session On “Polycystic Ovary Syndrome”\n22nd Annual Palliative Care CME/CNE Of Can Support & AIIMS\nReport On Clinical Observership At Ophthalmology Department, GIIMS\nCommunity Visit For Awareness About Breast Cancer\nNoida International University Shines At Physioconnect 5 International Conference\nRangoli And Craft Making Competition\nOutstanding Performance Of Optometry Students, SOAHS\nLove Your Eyes Kids!\nName Of The Event Vision Screening Camp On World Sight Week\nOptometry Students Excel In Scientific Competitions\nVision Screening Camp For Children At BPBD International School\nDepartment Of Physiotherapy Celebrate World Physiotherapy Day\nIndustrial Visit To TLM Hospital\nINDUSTRY VISIT TO SILVERLINE LABORATORIES: INSIGHTS OF SCLERAL CONTACT LENS FITTING\nScience and Mathematics Resource Centre\nSOE- Scouts & Guide training camp\nSchool of Education Noida International University is organising a National Webinar"
    }
  }
}