{
  "source_file": "niu.edu.in_Best_College_of_Liberal_Arts_in_Delhi-NCR_NIU_raw_2025-08-10-18-48-40.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text appears to be a sitemap or navigation structure for a university website, covering various aspects such as student and teacher feedback mechanisms, university authorities, committees, policies, academic schools, admission processes, career services, and affiliations with regulatory bodies. It lists specific departments, policies, and feedback categories, providing a comprehensive overview of the institution's administrative and academic components.",
      "raw_content": "• CAREERS |\n• FEEDBACK |\nStudent Feedback About Curriculum\nStudents Feedback About Teachers\nStudents Feedback About University in General\nTeachers’ Feedback About Curriculum\nAlumni Feedback\nParent’s Feedback\nCourse Exit Survey\nEmployer’s Feedback\n• Student Feedback About Curriculum\n• Students Feedback About Teachers\n• Students Feedback About University in General\n• Teachers’ Feedback About Curriculum\n• Alumni Feedback\n• Parent’s Feedback\n• Course Exit Survey\n• Employer’s Feedback\nICAIMISMDAHSSICADISNIRFNIIMSCAREERSR&DNIUMOOCSGRIEVANCES\n• CAREERS\nCode of ConductIQACAnnual ReportsIICNISP 2019\nUNIVERSITY AUTHORITIES\nCourtBoard of GovernorsExecutive CouncilAcademic CouncilCOMMITTEES\nHR PoliciesCRS PoliciesTransport PoliciesScholarship PoliciesMigration Policy\nSports Scholarship PolicyUniversity Hostel PolicySports PoliciesFee Payment PolicyFee Payment ProcedureAdmission Withdrawal Policy\nUniversity OrdinancesUniversity StatuteUniversity ACTBalance Sheet\n• About NIULeadershipRecognitions & ApprovalsDASAAwards & AchievementsCollaborationsInternational MOUs\n• Leadership\n• Code of ConductIQACAnnual ReportsIICNISP 2019\n• Annual Reports\n• NISP 2019\n• UNIVERSITY AUTHORITIES\n• Board of Governors\n• CRS Policies\n• Scholarship Policies\n• Sports Scholarship Policy\n• University Hostel Policy\n• Fee Payment Policy\n• Fee Payment Procedure\n• University Ordinances\n• University Statute\n• University ACT\nSchool Of Business ManagementSchool Of Allied Health SciencesSchool Of Liberal ArtsSchool Of Pharmacy\nSchool Of NursingSchool Of Law & Legal AffairsSchool of Engineering & TechnologySchool Of Sciences\nSchool Of Journalism & Mass CommunicationSchool Of EducationSchool of Fine Arts & DesignNIIMS\n• School Of Business ManagementSchool Of Allied Health SciencesSchool Of Liberal ArtsSchool Of Pharmacy\n• School Of Business Management\n• School Of Allied Health Sciences\n• School Of Liberal Arts\n• School Of NursingSchool Of Law & Legal AffairsSchool of Engineering & TechnologySchool Of Sciences\n• School Of Nursing\n• School Of Law & Legal Affairs\n• School of Engineering & Technology\n• School Of Journalism & Mass CommunicationSchool Of EducationSchool of Fine Arts & DesignNIIMS\n• School Of Journalism & Mass Communication\n• School of Fine Arts & Design\nApply for CUET CounsellingAdmission ProcessCourses & Fee Structure For 2025-26Scholarship & Bank LoanTransportHostels\nAdmission AlertsAdmission and Outreach TeamPh.D. AdmissionsDomestic Brochure (Indian Students)Prospectus\n• Apply for CUET CounsellingAdmission ProcessCourses & Fee Structure For 2025-26Scholarship & Bank LoanTransportHostels\n• Apply for CUET Counselling\n• Courses & Fee Structure For 2025-26\n• Scholarship & Bank Loan\n• Admission AlertsAdmission and Outreach TeamPh.D. AdmissionsDomestic Brochure (Indian Students)Prospectus\n• Admission and Outreach Team\n• Domestic Brochure (Indian Students)\nComputer LabsWorkshops & ClassroomsLaboratoriesLibrary\nNIU ClubsEvent VideoNotice BoardCampus Virtual TourSports\n• International Scholarship\n• Global MBA new\nOverviewThe TeamTraining & Placement ProcessPlacement PolicyIndustry Visit\nPlacement RecordRecruitersOur PlacementsNIU Star AlumniPlacement Contact\n• OverviewThe TeamTraining & Placement ProcessPlacement PolicyIndustry Visit\n• Training & Placement Process\n• Placement RecordRecruitersOur PlacementsNIU Star AlumniPlacement Contact\n• Recruiters\n• Feedback\nStudent Feedback About CurriculumStudents Feedback About TeachersStudents Feedback About University in GeneralTeachers’ Feedback About CurriculumAlumni FeedbackParent’s FeedbackEmployer’s Feedback\n• Apply Now 2025\nCAREERS\nLeadership\nNISP 2019\nAnnual Reports\nBoard of Governors\nUniversity Ordinances\nUniversity ACT\nUniversity Statute\nFee Payment Policy\nFee Payment Procedure\nScholarship Policies\nSports Scholarship Policy\nCRS Policies\nUniversity Hostel Policy\nSchool Of Business Management\nSchool Of Nursing\nSchool Of Law & Legal Affairs\nSchool Of Journalism & Mass Communication\nSchool Of Allied Health Sciences\nSchool of Engineering & Technology\nSchool of Fine Arts & Design\nSchool Of Liberal Arts\nApply for CUET Counselling\nScholarship & Bank Loan\nDomestic Brochure (Indian Students)\nAdmission and Outreach Team\nCourses & Fee Structure For 2025-26\nGlobal MBA new\nTraining & Placement Process\nRecruiters\n• COVID-19\nBAR COUNCIL OF INDIA\nCouncil of Architecture\nIndian Association of Physiotherapists\nIndian Nursing Council\nPharmacy Council of India\nAssociation of Indian Universities\n"
    },
    "admission_requirements": {
      "summary": "This data outlines two academic programs: a Bachelor of Arts (Hons) and a Master of Arts. The BA (Hons) is available with various specializations like English, Psychology, and Sociology, requires 50% in 10+2, and has a duration of 3 or 4 years with listed fees for the first four years and a full course fee. The MA program, with specializations including English, Psychology, and International Relations, necessitates 50% in graduation with relevant subjects, spans 2 years, and provides fees for the first two years along with the total course fee. Both programs offer an 'Enquire Now' option.",
      "raw_content": "PROGRAM | COURSE | ELIGIBILITY | DURATION | IST YEAR FEE | IIND YEAR FEE | IIIRD YEAR FEE | IVTH YEAR FEE | VTH YEAR FEE | FULL COURSE FEE | Enquire Now\nBA (Hons) | Bachelor of Arts with specialization in English/Psychology/Public Administration/Geography/Sociology/Political Science/Liberal Arts / International Relations) | Minimum 50% marks in 10+2 | 3 or 4 | 64000 | 65800 | 67800 | 69600 | N/A | 267200 | Enquire Now\nMA | Master of Arts with specialization in English /Psychology/Geography/ International Relations | Minimum 50% marks in Graduation with relevant subjects | 2 | 54000 | 55300 | N/A | N/A | N/A | 109300 | Enquire Now"
    },
    "alumni_feedback": {
      "summary": "The provided text consists of multiple testimonials from students and alumni of Noida International University (NIU). The feedback is overwhelmingly positive, highlighting the university's excellent academic environment, supportive faculty and staff, good library facilities, and the effective placement team which has helped students secure positions in reputable companies. Students express satisfaction with the overall learning experience, personal development, and the university's contribution to their career growth.",
      "raw_content": "I am doing MA from NIU and I like the university and I am very happy to be a part of this university. This is one of the best university in Delhi (NCR). I select this university for the best environment and good library and also the behavior of teachers and friends are also very good. I am not feeling like outside to my country. The study quality is also very best\nIt was my golden phase during my tenure at Noida International University where I learnt and take a leap forward towards my career growth. The entire faculty and department leaves no stone unturned to shape one's future. It’s been a wonderful experience of learning with prolific exposure to outside. A big thanks to the Placement Team of Noida International University for providing great opportunities and supporting me by providing best career option.\nPaytm Services Pvt. Ltd.\nNIU is one of the best international university in Delhi Ncr. I am a fourth semester BA Student. Till now my experience with NIU is very good. All the faculty members are very helpful. Education system is also very good. I am very happy to be a part of this university.\nNIU is one of the best university in India. All the teachers and friends are very helpful. Education system is also very interesting.I am very happy for being a part of this university\n\" Noida International University has given me an astonishing platform for the overall growth and development. Every faculty member of MBA department continuously provided assistance to grow in academics and my skills. NIU Placement is working hard for all students to get placed. \"\nNoida International University has provided us a very efficient platform for the exposure to the training and placement. I am very grateful to the university for providing us the best of placement opportunities and finally I got placed in HDFC and taken the first step to fulfilled my dreams.\nI was pleasantly surprised by the beautiful campus and the quality of facilities that Noida International University provides. Eventually the excellent pedagogy of the teachers and the amazing help I received to enhance my skill and improve my knowledge convinced me of the Excellency of Noida International University.\nNoida International University has always believed in helping and guiding its students and it was no different during the placement season. Regular classes held at our college to help us with our legal studies and skills were of great help. Our placement administration officers also guided and encouraged us at each step thereby helping me secure my placement at such a reputed company.\nI would like to thank our faculty members who have provided a very supportive environment. NIU undertakes and promotes various managerial, cultural, creative and many other diversified activities, which reflects the grand vision of the NIU and all such activities, helped in my overall development. I also like to thank our placement division who had provided us ample of opportunities and finally got me placed with Capital Brix\nCapital Brix Pvt. Ltd.\nNoida International University has been a great contributor towards the development of my personality. The infrastructure of Noida International University is one of the finest in the NCR region is what stands out the most. NIU, has best faculties with an attitude of being ever ready to help, and not only delivering classroom teachings, but also providing the students with real-time case technical projects and hands on industry experience with field work.\nIt been some of the lovely and memorable days I spent in Noida International University. NIU & its wonderful faculties are very cooperative and university environment is really good. Placement department has continuously provided assistance and gives opportunities in some of the best organizations in our country. NIU has made the best efforts to provide all the facilities for the students like Faculties, events, sports, etc.\nI'm so thankful that I chose Noida International University for my B.Tech program. I cherish the moments spent under the guidance of eminent faculty members, my mentors and Career Development Team. I highly recommend the University for giving an excellent learning environment and shaping my career.\nIngenious Energy Infratech Pvt. Ltd."
    }
  }
}