{
  "source_file": "niu.edu.in_The_Team_-_Noida_International_University_raw_2025-08-10-18-48-39.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text outlines the organizational structure and key personnel of Noida International University (NIU), focusing on its academic departments, administrative authorities, committees, and policies. It details various schools within the university, including Business Management, Allied Health Sciences, Liberal Arts, Pharmacy, Nursing, Law, Engineering, Sciences, Journalism, Education, and Fine Arts. The document also highlights the university's career services, including training and placement efforts, and introduces several faculty and staff members, detailing their roles, qualifications, and experience in areas such as soft skills training, technical training, aptitude development, and legal expertise. Notable individuals mentioned include Smita Gupta, Mr. Nikhil Saini, Mr. Deepak Kumar, Saathi Mukherjee, Dr. Garima Rajput, Mr. Vipin Kumar, Ms. Pragya, Mr. Vikas Ranjan, Mr. Prashant Solanki, Ms. Shubhangi Tiwari, Mr. Chetan Kumar, Pratibha Pal, and Ms. Vibha Khajanchi.",
      "raw_content": "ICAIMISMDAHSSICADISNIRFNIIMSCAREERSR&DNIUMOOCSGRIEVANCES\n• CAREERS\nCode of ConductIQACAnnual ReportsIICNISP 2019\nUNIVERSITY AUTHORITIES\nCourtBoard of GovernorsExecutive CouncilAcademic CouncilCOMMITTEES\nHR PoliciesCRS PoliciesTransport PoliciesScholarship PoliciesMigration Policy\nSports Scholarship PolicyUniversity Hostel PolicySports PoliciesFee Payment PolicyFee Payment ProcedureAdmission Withdrawal Policy\nUniversity OrdinancesUniversity StatuteUniversity ACTBalance Sheet\n• About NIULeadershipRecognitions & ApprovalsDASAAwards & AchievementsCollaborationsInternational MOUs\n• Leadership\n• Code of ConductIQACAnnual ReportsIICNISP 2019\n• Annual Reports\n• NISP 2019\n• UNIVERSITY AUTHORITIES\n• Board of Governors\n• CRS Policies\n• Scholarship Policies\n• Sports Scholarship Policy\n• University Hostel Policy\n• Fee Payment Policy\n• Fee Payment Procedure\n• University Ordinances\n• University Statute\n• University ACT\nSchool Of Business ManagementSchool Of Allied Health SciencesSchool Of Liberal ArtsSchool Of Pharmacy\nSchool Of NursingSchool Of Law & Legal AffairsSchool of Engineering & TechnologySchool Of Sciences\nSchool Of Journalism & Mass CommunicationSchool Of EducationSchool of Fine Arts & DesignNIIMS\n• School Of Business ManagementSchool Of Allied Health SciencesSchool Of Liberal ArtsSchool Of Pharmacy\n• School Of Business Management\n• School Of Allied Health Sciences\n• School Of Liberal Arts\n• School Of NursingSchool Of Law & Legal AffairsSchool of Engineering & TechnologySchool Of Sciences\n• School Of Nursing\n• School Of Law & Legal Affairs\n• School of Engineering & Technology\n• School Of Journalism & Mass CommunicationSchool Of EducationSchool of Fine Arts & DesignNIIMS\n• School Of Journalism & Mass Communication\n• School of Fine Arts & Design\nComputer LabsWorkshops & ClassroomsLaboratoriesLibrary\nNIU ClubsEvent VideoNotice BoardCampus Virtual TourSports\n• International Scholarship\n• Global MBA new\nOverviewThe TeamTraining & Placement ProcessPlacement PolicyIndustry Visit\nPlacement RecordRecruitersOur PlacementsNIU Star AlumniPlacement Contact\n• OverviewThe TeamTraining & Placement ProcessPlacement PolicyIndustry Visit\n• Training & Placement Process\n• Placement RecordRecruitersOur PlacementsNIU Star AlumniPlacement Contact\n• Recruiters\n• Feedback\nStudent Feedback About CurriculumStudents Feedback About TeachersStudents Feedback About University in GeneralTeachers’ Feedback About CurriculumAlumni FeedbackParent’s FeedbackEmployer’s Feedback\n• Apply Now 2025\nCAREERS\nLeadership\nNISP 2019\nAnnual Reports\nBoard of Governors\nUniversity Ordinances\nUniversity ACT\nUniversity Statute\nFee Payment Policy\nFee Payment Procedure\nScholarship Policies\nSports Scholarship Policy\nCRS Policies\nUniversity Hostel Policy\nSchool Of Business Management\nSchool Of Nursing\nSchool Of Law & Legal Affairs\nSchool Of Journalism & Mass Communication\nSchool Of Allied Health Sciences\nSchool of Engineering & Technology\nSchool of Fine Arts & Design\nSchool Of Liberal Arts\nGlobal MBA new\n• COVID-19\nSmita Gupta is a strategic and impact-driven higher education and corporate interface professional with over 15 years of versatile experience in institutional advancement, industry-academia partnerships, CSR projects, alumni relations, and talent development. She has successfully driven corporate alliances, placement operations, startup incubation support, and CSR-funded initiatives for leading institutions like Amity University, Manipal Group, and BSE Institute. Smita’s expertise spans stakeholder management, event strategy, legal advisory for startups, and student career services. Known for enhancing placement processes, securing industry collaborations, and driving alumni engagement, she is passionate about fostering industry-ready graduates and strengthening academic ecosystems.\nMr. Nikhil Saini holds the position of Technical Trainer at Noida International University. He is a young and dynamic professional with a B.Tech in Computer Science Engineering and over 3 years of experience in corporate and academic training. A 5-star programmer on CodeChef, he has solved 2000+ DSA problems across various platforms. He specializes in Data Structures & Algorithms, Java Backend, Core CSE subjects, and the MERN stack, and is dedicated to preparing students for industry challenges through practical, concept-driven training.\nMr Deepak Kumar is a dynamic and accomplished Training & Placement Head with over 24 years of extensive experience in the education sector. He has successfully placed over 20,000 engineering and management students across leading corporates in India, with proven expertise in corporate relations, career services, and student skill development. Deepak has a strong track record of building industry-academia collaborations, forging strategic MoUs, and driving placement benchmarks. Adept at team leadership and policy development, he has consistently enhanced placement outcomes and institutional rankings through data-driven strategies, HR conclaves, and student-centric initiatives across premier universities and institutions.\nHolding an LLM in Intellectual Property Rights (IPR) and Technology Law from O.P. Jindal Global Law School, Saathi has cultivated a deep understanding of complex legal frameworks. She also earned her B.A. LLB from Lloyd Law College, which laid the foundation for her legal acumen. Her academic journey reflects a commitment to excellence, with a focus on bridging the gap between theory and practice in the legal domain. A published author and researcher, Saathi has published a book titled “Celebrity Personality Indicia Protection for Voice and Likeliness: A Comparative Legal Analysis,” which explores intellectual property rights across multiple jurisdictions. Her research contributions extend to several peer-reviewed journals, where she has examined topics such as the impact of globalization on multinational corporations, artificial intelligence and job displacement, and the conservation of celebrity rights. She has also authored numerous articles addressing emerging legal and technological issues, published on platforms such as Legal Service India and IRALR Blog. Saathi is certified in Mediation and Arbitration Advocacy, having undergone rigorous training with organizations such as the Global Academy for Advocacy in Dispute Resolution and the Kapila & Nirmal Hingorani Foundation. Additionally, she has completed programs in personality development and faculty training, underscoring her dedication to continuous learning and professional growth. With her blend of expertise in law, training, and research, Saathi Mukherjee continues to make significant contributions to both the academic and legal communities. Her dynamic approach to education and professional development makes her a distinguished professional dedicated to shaping the future of her students and peers.\nDr. Garima Rajput holds the position of Assistant Professor of Soft Skill in Training and Placement Department at Noida International University. She has completed M.Phil in English Language Teaching from Banasthali University Rajasthan and executed her dissertation on “Discourse Analysis of T. S. Eliot’s Selected Poems”. She has also completed Ph.D from Banasthali University Rajasthan on the topic “The Fictional World of Bharati Mukherjee and Hanif Kureishi”. She has 7 years experience as Assistant Professor of Soft Skills at various Engineering Colleges of Ghaziabad and Greater Noida. She has published three research papers in national Journals. She is a driven speaker on Communication, Public Speaking strategies, Literature, Confidence building & many more.\nMr. Vipin Kumar, an MBA postgraduate, boasts 14 years of experience in teaching, training, and development. He holds the position of Manager – Aptitude Training and serves as the core faculty for aptitude and reasoning. Having addressed over 40,000 students, he is a motivated professional committed to fulfilling the educational needs and well-being of his students.\nMs. Pragya, boasting a year of industry experience, currently serves as a Trainer (Computer Science). She possesses a Master’s degree in Computer Applications (MCA), providing her with a robust foundation in computer science and sophisticated technical abilities. In her capacity, she commits to delivering knowledge and training to individuals across diverse technical fields, leveraging her hands-on experience and academic expertise to cultivate an effective learning atmosphere.\nMr. Vikas Ranjan is a young, dynamic professional with an engineering background. As a dedicated educator, he has over eight years of progressive experience in preparing undergraduate and postgraduate students for various entrance tests and competitive exams. He possesses expertise in the comprehensive study of emerging trends related to Quantitative Aptitude and Analytical Reasoning tests conducted by companies, along with a deep understanding of calculative and logical thinking-based problems encountered during campus placements. Proficient in delivering effective presentations and classroom training sessions, he has also guided students in cracking competitive exams for government jobs, training over 20,000 aspirants across different states for various entrance exams.\nHighly motivated, experienced Soft Skills Trainer with 8 + years of experience in facilitating ,presenting leadership workshops,classes and seminars in effective communication, teamwork,customer service ,and conflict resolution.Experienced in analyzing training needs ,developing high quality training, materials,and assessing results. She has trained more than 5000+ students in various colleges ,corporates,NGO’s and other professional institutions on communication skills ,personality development and behavioural training.She has organised more than 50+ co-curricular /extracurricular events for the benefit of students in past 5 years.She provides training based on workplace English and workplace readiness to make students ready for the work area in different sectors\nMr. Prashant Solanki holds the position of Soft Skills Trainer at Noida International University. He holds an M.A. in English literature. He has 8 years of rich experience in academics and management. Previously he was associated with ACMT group of colleges, as an Academic Head where he reviewed and developed training modules and action plans for soft skills training, he later started working with National Institute of Language where he trained international students. He educated employees or students about the art of communication, relationships, and improving public speaking skills.\nMs. Shubhangi Tiwari holds the position of Soft Skill Trainer ( Training and Placement Dept) at Noida International University.\nShe pursued her Master’s in English Literature from Punjab University and did her dissertation on the dystopian novel 1984 by George Orwell and drawing parallelism with Jeremy Bentham Panopticon and the contemporary world.\nShe served as Soft Skill Trainer at Chandigarh group of College for more than a year .\nShe has an interest in public speaking , building up confidence , vocabulary , literature and Grooming.\n• Certification in various leadership development programs organized by AICTE UKIERI.\n• GRID training program organized by CONCEPT HOSPITALITY.\n• Johnson Diversey in (FOOD AND HYGIENE)\n• Skill Deck Bangalore (POSH, Talent Acquisition, Indian Payroll, Learning and Development and Labor Law. \n• Digital Marketing certification course from DOSM Dehradun.\n• Strategic Account Management (SAM)\nMr. Chetan Kumar holds the Senior Associate Aptitude Trainer (Training & Placement Dept) position at Noida International University. He is a civil engineer by profession. He carries rich experience in teaching Quantitative aptitude and reasoning, spanning different educational institutes in the Delhi NCR region. He was previously associated with IIMT University, a prestigious university in Meerut.\nHelp students in pursuing their career goals by conducting regular sessions and delivering aptitude training to students.\nHe trains students for screening tests conducted by leading corporations like (TCS, Infosys, Wipro,Cognizant, Capgemini, AMCAT, Co-Cubes, eLitmus).\nPratibha Pal currently is working as an Executive inTraining & Placement Department at Noida International University.\nShe has 4 years experience of working in the corporate sector. She has worked with so many Indian & Us clients on different projects in various sectors like Data Extraction, Data Handling, Data uploading, Research & Business Development.\nShe has a passion for learning new things every day.\nHer major role includes data collection & maintenance, coordination with schools, organising placement drives etc.\nMs. Vibha Khajanchi holds the position of Manager, Training( Training & Placement Dept) at Noida International University.\nShe possesses an MPhil in English Literature and executed her dissertation on Violence in The Bluest Eye and Beloved penned by Toni Morrison, the Nobel laureate of 1993.\nAs life catapulted her on various missions, she discovered herself crystallising into a budding Yogi. Her physical and spiritual metamorphosis occurred when she graduated from Sri Sri School of Yoga, Art of Living International Centre, Bengaluru as a Yoga Wellness Instructor in 2019 and got certified by the Yoga Certification Board, Ministry of AYUSH which helps her in guiding students well.\nShe brings forth a robust experience of five years as an Assistant Professor of English at Galgotias University.\nShe is a driven speaker on Communication, Public Speaking strategies,Literature, Confidence building, Grooming & many more.\n"
    },
    "admission_requirements": {
      "summary": "This text outlines various aspects of the admission and counseling process for CUET, including applying for counseling, the admission process itself, details on courses and fees for 2025-26, scholarship and bank loan information, transportation, and hostel facilities. It also highlights admission alerts, the admission and outreach team, Ph.D. admissions, and the availability of a domestic brochure for Indian students.",
      "raw_content": "Apply for CUET CounsellingAdmission ProcessCourses & Fee Structure For 2025-26Scholarship & Bank LoanTransportHostels\nAdmission AlertsAdmission and Outreach TeamPh.D. AdmissionsDomestic Brochure (Indian Students)Prospectus\n• Apply for CUET CounsellingAdmission ProcessCourses & Fee Structure For 2025-26Scholarship & Bank LoanTransportHostels\n• Apply for CUET Counselling\n• Admission AlertsAdmission and Outreach TeamPh.D. AdmissionsDomestic Brochure (Indian Students)Prospectus\n• Admission and Outreach Team\n• Domestic Brochure (Indian Students)"
    }
  }
}