{
  "source_file": "niu.edu.in_BFA_in_Animation_and_VFX_BFA_in_Animation_and_VFX_Course_raw_2025-08-10-18-48-40.txt",
  "structured_data": {
    "general_info": {
      "summary": "The provided text is a navigation or content index for the National Institute of Innovation (NIU) School of Fine Arts & Design, outlining various sections such as careers, feedback, research and development, grievance redressal, leadership, academic information, university authorities, and policies related to fees, scholarships, hostels, ordinances, statutes, and acts.",
      "raw_content": "• CAREERS |\n• FEEDBACK |\nICAIMISMDAHSSICADISNIRFNIIMSCAREERSR&DNIUMOOCSGRIEVANCES\n• CAREERS\n• About NIULeadershipRecognitions & ApprovalsDASAAwards & AchievementsCollaborationsInternational MOUs\n• Leadership\n• Code of ConductIQACAnnual ReportsIICNISP 2019\n• Annual Reports\n• NISP 2019\n• UNIVERSITY AUTHORITIES\n• Board of Governors\n• CRS Policies\n• Scholarship Policies\n• Sports Scholarship Policy\n• University Hostel Policy\n• Fee Payment Policy\n• Fee Payment Procedure\n• University Ordinances\n• University Statute\n• University ACT\nSource: https://niu.edu.in/school-of-fine-arts-design/"
    },
    "admission_requirements": {
      "summary": "This document outlines various admission and application processes, including CUET counselling, Ph.D. admissions, and a domestic brochure for Indian students. It also mentions an admission and outreach team and a \"Apply Now 2025\" option.",
      "raw_content": "Apply for CUET Counselling\nAdmission Process\nPh.D. Admissions\nDomestic Brochure (Indian Students)\nProspectus\n• Apply for CUET Counselling\n• Admission Process\n• Admission AlertsAdmission and Outreach TeamPh.D. AdmissionsDomestic Brochure (Indian Students)Prospectus\n• Admission and Outreach Team\n• Domestic Brochure (Indian Students)\n• Apply Now 2025"
    },
    "feedback": {
      "summary": "This document lists various categories of feedback collected from different stakeholders related to a university or educational program. The categories include feedback from students on curriculum, teachers, and the university overall, as well as feedback from teachers on the curriculum, alumni, parents, and employers. Additionally, a \"Course Exit Survey\" and a general \"Feedback\" category are mentioned.",
      "raw_content": "Student Feedback About Curriculum\nStudents Feedback About Teachers\nStudents Feedback About University in General\nTeachers’ Feedback About Curriculum\nAlumni Feedback\nParent’s Feedback\nCourse Exit Survey\nEmployer’s Feedback\n• Student Feedback About Curriculum\n• Students Feedback About Teachers\n• Students Feedback About University in General\n• Teachers’ Feedback About Curriculum\n• Alumni Feedback\n• Parent’s Feedback\n• Course Exit Survey\n• Employer’s Feedback\n• Feedback"
    },
    "student_achievements": {
      "summary": "Garima Verma, a 3rd-year Applied Art student from the School of Fine Arts, achieved significant recognition on World Photography Day. Her photographs were selected for an International Virtual Photography Competition, with one earning first place in the Grassroots Innovations category. Additionally, \"he\" secured third prize in a painting competition focused on circular economy and sustainability during National Productivity Week, and received a Certificate of Excellence for a portrait of Nobel Laureate Amartya Sen in a Sweden India painting contest.",
      "raw_content": "Garima Verma (3rd Year- Applied Art, School of Fine Arts) has received an award in the International Virtual Photography Competition on the occasion of World Photography Day- 19th August 2021. Her three photographs got selected in the competition; one of the photographs has received first position in the category of Grassroots innovations.\nHe secured third prize in the painting competition on the theme “Circular economy for Productivity & sustainability” on the occasion of National Productivity Week Celebration organized by national productivity Council, New Delhi.\nHe has been awarded the Certificate of Excellence for his winning painting of Nobel Laureate Amartya Sen in Sweden India Nobel Memorial Painting Contest organized by Embassy of Sweden."
    },
    "faculty_profiles": {
      "summary": "This document profiles several individuals involved in the arts and academia, highlighting their diverse expertise and contributions. Dr. Mani Nandini Sharma is recognized for her doctoral research on Paul Cézanne, teaching, and artistic exhibitions. Mr. Nitesh is noted for his engagement in performance art, traditional arts like dhokra metal casting, and participation in art events. Anjali Sharma specializes in printmaking and has exhibited her work widely. Mr. Saket is a multimedia professional skilled in video editing and graphic design. Naman Soni is a concept artist with experience in game development and animation. Dr. Vinay Patel is a visual arts scholar whose PhD focused on the representation of identity on Indian postage stamps. Ar. Khushboo is an academician and Head of Department of Design, with published research and teaching experience. Gouri Moharana applies her background in applied arts and cultural studies to research on traditional Odishan art, alongside graphic and textile design work. Lastly, Vidushi is an artist focusing on graphic and creative illustrations, with experience as a mentor and illustrator.",
      "raw_content": "Dr. Mani Nandini Sharma\nMr. Saket Kumar Singh\nDr. Mani Nandini Sharma is an accomplished academician, artist, and has extensive experience in the field of Fine Arts. Doctoral degree earned in Fine Arts Post-Impressionist Paul Cezanne's work, has published significant studies on the inspiration and spirituality in his paintings, and taught a wide range of subjects including Composition, Modern Art History, Post-Impressionism and Art Appreciation. This blend of scholarly research, teaching excellence, and hands-on experience demonstrate Dr. Sharma’s expertise in art criticism and expressive visual vocabulary, has exhibited artworks widely across India and presented research at numerous conferences, demonstrating a commitment to advancing Fine Arts through academics, research, and artistic expression.\nAn avid participant and organizer in the art community, Mr. Nitesh active in various art talks and workshops across India and abroad is actively engaged in performance art, discussions on art and gender equality. Additionally, experience in traditional arts, such as dhokra metal casting, is recognized and awarded by Chandigarh Lalitkala. Has active participation in numerous prestigious exhibitions and art events- to name a few- American Centre in New Delhi, Bikaner House's Kalamkaar Art Gallery.\nAnjali Sharma, is an academician and expertise in Print-Making. She holds a Master's degree in Printmaking from M.S University, Baroda. She has practicing art with variety of disciplines, such as Printmaking, Painting. Significant contributions to the field of art with her expertise in diverse techniques, including etching, aquatint, paper pulp, engraving, woodcut, and collagraphy. Anjali's work has been featured in numerous group exhibition and articles published in esteemed art magazines. Showcasing the talent, and dedicated commitment to Academics. The practices in art is an enrichment to the art community, inspiring both peers and young minds.\nProfessional in Multimedia Mr. Saket specializes in video editing, graphic design, logo creation, and branding. With experience spanning to multiple languages and diverse projects, including corporate work, news channels, documentaries, and music albums, brings a comprehensive skill set to every project. Equipped with latest software expertise in Video Editing Software, VFX Software, Fusion Studio. Expertise in Photoshop, Coral Draw, and Camera Handling of high configuration, photography and Direction. Mr. Saket’s expertise extends beyond traditional editing methods, ensuring a polished and professional outcome in Academics\nAs a seasoned Concept Artist, Naman Soni has earned diverse skill sets. Developed through various roles across multiple locations and industries Naman has experience in creating immersive and competitive game maps, designing environments for 2D animation projects, and developing compelling visual narratives. Experiences-at-hand of establishing consistent design and visual language, alongside illustrating environment concepts to visually develop the storyline, the aptly varied roles have equipped Naman with the ability to visualize and create engaging content across different media, contributing to the holistic understanding of visual storytelling and design.\nDr. Vinay Patel is a Visual Arts Scholar and Academician with extensive research experience, National and international Conferences, Workshops in his name, currently at Noida International University, completed PhD at Jawaharlal Nehru University, New Delhi, in 2022, focusing on the \"Representation of Identity and Cultural Politics on Postage Stamps in India (1947-2017).\" awarded an M.Phil from the same institution, with research on Gandhi’s image on Indian currency and postage stamps. Dr. Vinay Patel earned professional degree in Applied Arts M.F.A. and B.F.A. from BHU; strength areas being Historical and Cultural Studies and Visual Communication Design; qualified National Eligibility Test (NET) in Visual Arts in 2023.\nAr. Khushboo an ardent professional with strong academic foundation has passion for research, dynamic in creating inclusive educational environment with industry experience and professional outlook. In academia: she has taught at Educational institutions of high repute, research articles and book chapters are published in Scopus indexed journals and has presented at various national and international conferences. Presently Head of the Department of Design and NAAC Coordinator, Ar. Khushboo has received accolades such as the Best Presentation Award at the National Conference on Legacy of Islamic Architecture 2022 and the Best Teacher Award 2023 at Noida International University.\nGouri Moharana with a versatile approach towards art and expression in Art has higher Education in Applied Arts and Cultural Studies, a solid academic foundation and passion for research in Indian traditional Art of Odisha, portraying an analytical eye on Patta painting and cow dung toys, Several publications and work presented at notable conferences. Portrays extensive professional experience as Graphic Designer, Textile Designer in multiple advertising agencies, co-operative societies, contributing her expertise to the next generation of professionals and artists. Extensive exhibitions, and participation in numerous art shows, including the IVth International Online Art Exhibition, Khajuraho Art Mart-2021, and Women's Day exhibitions, her work is featured in international and national exhibitions, reflecting her active engagement in the art community.\nVidushi is a prolific Artist with a strong interest in Graphic and Creative Illustrations. She has worked as a personality development mentor for aspiring MBA students.\nShe is a lead illustrator at a Small town Bandits, a Creative Consultancy in India from last 2 years.\nShe has worked as an Intern at Delhi Secretariat under Shri Manish Sisodia in Art, Culture and Linguistic department. Full time job at an Organisation called Expert GRAD as a Research Associate."
    },
    "events_and_workshops": {
      "summary": "This document is a report listing various events and activities organized by or for the School of Fine Arts (SFA), including seminars, workshops, exhibitions, educational tours, and visits to art-related institutions and events. Notable activities include a portrait demonstration, gender issue seminar, India Art Fair visits, an educational tour to Ajanta and Ellora, and a workshop on graphic software.",
      "raw_content": "Report Of Portrait Demonstartion\nReport Of Orientation & Induction 2023\nSeminar On Performance\nEcology And Environmental Art Practices-CONNECTED CONNECTEDNESS\nSFA Induction Programme Report-2022\nSeminar And Demonstration On Gender Issue- SFA\nInduction Programme-2022\nSFA Induction Programme-2022\nOne Day Visit To NGMA-School Of Fine Arts Students\nEducational Tour To Ajanta And Ellora\nIndia Art Fair Visit-2022\nSeminar and Workshop on Art Criticism, Contemporary art practices and Writing\nAnnual art Exhibition 2022-SFA\nUXUI Design Workshop\nThe School of Fine Arts (SFA) Noida International University organised a one day workshop\nA Seven day event of Educational Tour was conducted for the students of School of Fine Arts.\nArtist Studio visit to Kaladham, Noida\n‘One Day For Nation’ Major Sanjay Kumar Visit\nDr Nihar Das, Receives Prestigious Award From President Of India\nLondon 1st Feb 2024 Workshop\nIndia Art Fair 2024\nComic Con Visit 2023\nArt In Ayurveda Talk\nMaati Ki Abhivyakti Workshop\nSOFAD Art Exhibition ABHIVYAKTI : 10th May 2024\nMélange- 2024 (Annual Inter – Institute Cultural Fest) at IMS, GAZIABAD\nReport Of One Day Lecture\nReport Of Farewell 2023\nReport Of Clay Modelling Woekshop\nReport Of Avarniya 2023\nONKAF And KNMA Visit\nReport Of Workshop On FUNDAMENTALS OF GRAPHIC SOFTWARE\nREPORT Of Seminar And Presentation"
    }
  }
}