{
  "source_file": "niu.edu.in_PhD_Admissions_-_Noida_International_University_raw_2025-08-10-18-48-40.txt",
  "structured_data": {
    "general_info": {
      "summary": "Noida International University (NIU) is a multidisciplinary, research-driven university. It is currently inviting applications for its full-time doctoral (Ph.D.) program, adhering to UGC regulations from November 2022. The university also provides information on its leadership, policies, and administrative structures.",
      "raw_content": "• CAREERS |\n• FEEDBACK |\n• CAREERS\n• About NIULeadershipRecognitions & ApprovalsDASAAwards & AchievementsCollaborationsInternational MOUs\n• Leadership\n• Code of ConductIQACAnnual ReportsIICNISP 2019\n• Annual Reports\n• NISP 2019\n• UNIVERSITY AUTHORITIES\n• Board of Governors\n• CRS Policies\n• Scholarship Policies\n• Sports Scholarship Policy\n• University Hostel Policy\n• Fee Payment Policy\n• Fee Payment Procedure\n• University Ordinances\n• University Statute\n• University ACT\nNoida International University (NIU) is a multidisciplinary, research-driven University. The University invites online/offline applications from the eligible candidates for admission to the doctoral (Ph.D.) Programme as per UGC Minimum Standards and Procedures for Awards of Ph.D. Degree Regulations, 2022, published in the Gazette of India on 7th November, 2022.The Ph.D. programme at NIU is a full-time programme and not conducted in distance mode"
    },
    "admission_requirements": {
      "summary": "Noida International University is inviting applications for its Ph.D. program for the 2025-26 July batch, covering a wide array of disciplines across its various schools including Medical Sciences, Engineering, Liberal Arts, Sciences, Allied Health Sciences, Nursing, Business Management, Journalism, Law, Education, and Fine Arts. Eligibility requires a Master's degree with at least 55% marks (or equivalent), with relaxations for reserved categories. Specific criteria apply for candidates with a 4-year Bachelor's degree or an M.Phil. degree. The application process involves submitting a form with a fee of Rs. 1122/- online via the university website (www.niu.edu.in). Admission will be based on an entrance test and interview, with exemptions for certain fellowship holders and M.Phil. graduates from the entrance test.",
      "raw_content": "Applications are invited for Ph.D. programme (2025-26, July Batch) in the following schools:\n• Noida International Institute of Medical Sciences (NIIMS): Anatomy, Medical Biochemistry, Physiology, Pathology.\n• School of Engineering & Technology (SET): Mechanical Engineering, Computer Science Engineering, Biotechnology, Civil Engineering.\n• School of Liberal Arts (SLA): History, International Relations, Public Administration, English, Political Science, Geography, Psychology, Sociology.\n• School of Sciences (SOS): Biotechnology & Microbiology, Computer Sciences & Information Technology, Physics, Chemistry, Mathematics, Agriculture.\n• School of Allied Health Sciences (SOAHS): Public Health, Physiotherapy, Medical Laboratory Technology\n• School of Nursing (SON): Nursing.\n• School of Business Management (SBM): General Management, Marketing & International Business, HR, Economics & Finance.\n• School of Journalism & Mass Communication (SJMC): Advertising/Public Relations/Print Media/Mass Communication/Development Communication/Radio Communication.\n• School of Law & Legal Affairs (SLLA): Mercantile Law/Human Rights/Commercial Law.\n• School of Education (SOE): Educational Philosophy/Educational Psychology/Educational Sociology and School Administration.\n• School of Fine Arts (SFA): Visual Arts.\n• 1-year/2-semester master’s degree programme after a 4-year/8-semester bachelor’s degree programme or a 2-year/4-semester master’s degree programme after a 3-year bachelor’s degree programme or qualifications declared equivalent to the master’s degree by the corresponding statutory regulatory body, with at least 55% marks in aggregate or its equivalent grade in a point scale wherever grading system is followed or equivalent qualification from a foreign educational institution accredited by an assessment and accreditation agency which is approved, recognized or authorized by an authority, established or incorporated under a law in its home country or any other statutory authority in that country to assess, accredit or assure quality and standards of the educational institution.A relaxation of 5% marks or its equivalent grade may be allowed for those belonging to SC/ST/OBC (non-creamy layer)/Differently-Abled, Economically Weaker Section (EWS) and other categories of candidates as per the decision of the Commission from time to time.Provided that a candidate seeking admission after a 4-year/8-semester bachelor’s degree programme should have a minimum of 75% marks in aggregate or its equivalent grade on a point scale wherever the grading system is followed. A relaxation of 5% marks or its equivalent grade may be allowed for those belonging to SC/ST/OBC (non-creamy layer)/Differently-Abled, Economically Weaker Section (EWS) and other categories of candidates as per the decision of the Commission from time to time.\n• Candidates who have completed the M.Phil. programme with at least 55% marks in aggregate or its equivalent grade in a point scale wherever grading system is followed or equivalent qualification from a foreign educational institution accredited by an assessment and accreditation agency which is approved, recognized or authorized by an authority, established or incorporated under a law in its home country or any other statutory authority in that country to assess, accredit or assure quality and standards of educational institutions, shall be eligible for admission to the Ph.D. programme. A relaxation of 5% marks or its equivalent grade may be allowed for those belonging to SC/ST/OBC (non-creamy layer)/Differently-Abled, Economically Weaker Section (EWS) and other categories of candidates as per the decision of the Commission from time to time.\nForms are available on the university website (www.niu.edu.in), which can be submitted along with Online Payment or Demand Draft of Rs. 1122/-. All applications must be submitted online. The applicant can download a copy of the submitted application form from the application submission portal and furnish hardcopy of the application form with photograph and all the documentary evidence in original (testimonials, certificates, publications, work experience and research/professional experience) at the time of interview.\nIncomplete applications will be rejected.\nAdmission to PhD. Program shall be based on merit obtained in entrance test and interview.\nThe students who have qualified UGC-NET with JRF / UGC-CSIR-NET with JRF / teacher fellowship holder or any other Government / Foreign research fellowship holder or have passed M.Phil. Programme (as per UGC Regulations 2009 or amended thereafter) with course work shall be exempted from the entrance test but they have to appear in the interview.\n"
    },
    "admission_process": {
      "summary": "This document outlines the admission process and important dates for a Ph.D. program, likely related to CUET. Key deadlines include July 31, 2025, for application receipt, with the entrance test on August 2, 2025. The program has a minimum duration of 3 years and a maximum of 6 years. It also mentions applying for CUET Counselling and accessing domestic brochures for Indian students.",
      "raw_content": "• Apply for CUET Counselling\n• Admission Process\n• Apply for CUET Counselling\n• Admission AlertsAdmission and Outreach TeamPh.D. AdmissionsDomestic Brochure (Indian Students)Prospectus\n• Admission and Outreach Team\n• Domestic Brochure (Indian Students)\nLAST DATE FOR RECEIPT OF APPLICATION FORM: 31st July, 2025\nDATE OF ENTRANCE TEST: 2nd August, 2025\nDECLARATION OF ENTRANCE TEST RESULT: 5th August, 2025\nINTERVIEW: 8th August, 2025\nFINAL RESULT: 11th August, 2025\nLAST DATE OF FEE PAYMENT: 16th August, 2025\nREGISTRATION & ORIENTATION DAY: 18th August, 2025\nCOMMENCEMENT OF COURSEWORK CLASSES: 18th August, 2025\nPh.D. programme shall be a minimum duration of 3 years, including course work and for a maximum duration of 6 years.\n• Apply Now 2025\nApply for CUET Counselling"
    },
    "scholarship_details": {
      "summary": "The provided text indicates a topic related to financial aid, specifically mentioning \"Scholarship & Bank Loan\" as a point of reference.",
      "raw_content": "• Scholarship & Bank Loan\n"
    },
    "feedback": {
      "summary": "This document compiles various types of student and stakeholder feedback regarding Noida International University (NIU). The feedback highlights positive aspects such as the university's environment, library facilities, teacher behavior, study quality, career growth support, placement opportunities, helpful faculty, interesting education system, beautiful campus, and excellent pedagogy, leading to a generally high level of satisfaction among students and alumni.",
      "raw_content": "Student Feedback About Curriculum\nStudents Feedback About Teachers\nStudents Feedback About University in General\nTeachers’ Feedback About Curriculum\nAlumni Feedback\nParent’s Feedback\nCourse Exit Survey\nEmployer’s Feedback\n• Student Feedback About Curriculum\n• Students Feedback About Teachers\n• Students Feedback About University in General\n• Teachers’ Feedback About Curriculum\n• Alumni Feedback\n• Parent’s Feedback\n• Course Exit Survey\n• Employer’s Feedback\n• Feedback\nStudent Feedback About CurriculumStudents Feedback About TeachersStudents Feedback About University in GeneralTeachers’ Feedback About CurriculumAlumni FeedbackParent’s FeedbackEmployer’s Feedback\nI am doing MA from NIU and I like the university and I am very happy to be a part of this university. This is one of the best university in Delhi (NCR). I select this university for the best environment and good library and also the behavior of teachers and friends are also very good. I am not feeling like outside to my country. The study quality is also very best\nIt was my golden phase during my tenure at Noida International University where I learnt and take a leap forward towards my career growth. The entire faculty and department leaves no stone unturned to shape one's future. It’s been a wonderful experience of learning with prolific exposure to outside. A big thanks to the Placement Team of Noida International University for providing great opportunities and supporting me by providing best career option.\nPaytm Services Pvt. Ltd.\nNIU is one of the best international university in Delhi Ncr. I am a fourth semester BA Student. Till now my experience with NIU is very good. All the faculty members are very helpful. Education system is also very good. I am very happy to be a part of this university.\nNIU is one of the best university in India. All the teachers and friends are very helpful. Education system is also very interesting.I am very happy for being a part of this university\nI was pleasantly surprised by the beautiful campus and the quality of facilities that Noida International University provides. Eventually the excellent pedagogy of the teachers and the amazing help I received to enhance my skill and improve my knowledge convinced me of the Excellency of Noida International University.\n"
    },
    "entrance_exam_details": {
      "summary": "This document outlines the structure and evaluation criteria for an examination, likely for a postgraduate or research program. The exam consists of two papers, Paper-I and Paper-II, each worth 50 marks and lasting one hour. Paper-I covers Research Methodology and Aptitude, while Paper-II focuses on Subject Specific content aligned with UGC/CSIR NET syllabi. Both papers have a 50% weightage. The entrance test itself is qualifying with a 50% pass mark. The final merit list is determined by combining the entrance test score (70% weightage) with interview marks (30% weightage). The interview performance is assessed based on competence for research, suitability of the plan, and novelty of the plan, each contributing 10 marks.",
      "raw_content": "S.NO. | EXAM | MARKS | DURATION | TIMING\n1 | Paper-I | 50 | 1hr. | 10:00 AM to 11:00 AM\n2 | Paper-II | 50 | 1hr. | 11:30 AM to 12:30 PM\n10:00 AM to 11:00 AM\n11:30 AM to 12:30 PM\nSection A – Research Methodology and Aptitude (Research Aptitude, General Awareness, Logical Reasoning, Analytical Reasoning, Numerical Ability, English Language, Statistics) {50% weightage}Section B – Subject Specific (As per UGC/CSIR NET Syllabus) {50% weightage}\n• Entrance test shall be qualifying with qualifying marks as 50%.\nEntrance test shall be qualifying with qualifying marks as 50%.\n• Final merit list will be prepared by adding marks obtained in the entrance test (70% out of 100 marks) and 30% marks to the interview obtained (as per latest UGC regulations).\nFinal merit list will be prepared by adding marks obtained in the entrance test (70% out of 100 marks) and 30% marks to the interview obtained (as per latest UGC regulations).\n• The interview will be based on allotment of marks as per the following criteria:✓ Competence for proposed research – 10 marks✓ Feasibility/suitability of plan – 10 marks✓ Novelty of Plan – 10 marks\nThe interview will be based on allotment of marks as per the following criteria:✓ Competence for proposed research – 10 marks✓ Feasibility/suitability of plan – 10 marks✓ Novelty of Plan – 10 marks"
    },
    "university_policies": {
      "summary": "This document appears to be an index or a list of various policies and procedures related to a university, covering areas such as human resources, corporate responsibility, transport, scholarships (including sports-specific ones), student accommodation, sports, fee payments, admissions, university ordinances, statutes, and acts.",
      "raw_content": "HR PoliciesCRS PoliciesTransport PoliciesScholarship PoliciesMigration Policy\nSports Scholarship PolicyUniversity Hostel PolicySports PoliciesFee Payment PolicyFee Payment ProcedureAdmission Withdrawal Policy\n• CRS Policies\n• Scholarship Policies\n• Sports Scholarship Policy\n• University Hostel Policy\n• Fee Payment Policy\n• Fee Payment Procedure\n• University Ordinances\n• University Statute\n• University ACT\nFee Payment Policy\nFee Payment Procedure\n"
    }
  }
}