{
  "source_file": "niu.edu.in_Placement_Policy_-_Noida_International_University_raw_2025-08-10-18-48-39.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text appears to be a sitemap or navigational structure for a university website, likely Noida International University (NIU). It lists various feedback categories from students, teachers, alumni, parents, and employers, along with sections on university authorities, committees, policies, schools/departments, and administrative information like annual reports and acts. It also includes contact information and a source URL.",
      "raw_content": "• CAREERS |\n• FEEDBACK |\nStudent Feedback About Curriculum\nStudents Feedback About Teachers\nStudents Feedback About University in General\nTeachers’ Feedback About Curriculum\nAlumni Feedback\nParent’s Feedback\nCourse Exit Survey\nEmployer’s Feedback\n• Student Feedback About Curriculum\n• Students Feedback About Teachers\n• Students Feedback About University in General\n• Teachers’ Feedback About Curriculum\n• Alumni Feedback\n• Parent’s Feedback\n• Course Exit Survey\n• Employer’s Feedback\nICAIMISMDAHSSICADISNIRFNIIMSCAREERSR&DNIUMOOCSGRIEVANCES\n• CAREERS\nCode of ConductIQACAnnual ReportsIICNISP 2019\nUNIVERSITY AUTHORITIES\nCourtBoard of GovernorsExecutive CouncilAcademic CouncilCOMMITTEES\nHR PoliciesCRS PoliciesTransport PoliciesScholarship PoliciesMigration Policy\nSports Scholarship PolicyUniversity Hostel PolicySports PoliciesFee Payment PolicyFee Payment ProcedureAdmission Withdrawal Policy\nUniversity OrdinancesUniversity StatuteUniversity ACTBalance Sheet\n• About NIULeadershipRecognitions & ApprovalsDASAAwards & AchievementsCollaborationsInternational MOUs\n• Leadership\n• Code of ConductIQACAnnual ReportsIICNISP 2019\n• Annual Reports\n• NISP 2019\n• UNIVERSITY AUTHORITIES\n• Board of Governors\n• CRS Policies\n• Scholarship Policies\n• Sports Scholarship Policy\n• University Hostel Policy\n• Fee Payment Policy\n• Fee Payment Procedure\n• University Ordinances\n• University Statute\n• University ACT\nSchool Of Business ManagementSchool Of Allied Health SciencesSchool Of Liberal ArtsSchool Of Pharmacy\nSchool Of NursingSchool Of Law & Legal AffairsSchool of Engineering & TechnologySchool Of Sciences\nSchool Of Journalism & Mass CommunicationSchool Of EducationSchool of Fine Arts & DesignNIIMS\n• School Of Business ManagementSchool Of Allied Health SciencesSchool Of Liberal ArtsSchool Of Pharmacy\n• School Of Business Management\n• School Of Allied Health Sciences\n• School Of Liberal Arts\n• School Of NursingSchool Of Law & Legal AffairsSchool of Engineering & TechnologySchool Of Sciences\n• School Of Nursing\n• School Of Law & Legal Affairs\n• School of Engineering & Technology\n• School Of Journalism & Mass CommunicationSchool Of EducationSchool of Fine Arts & DesignNIIMS\n• School Of Journalism & Mass Communication\n• School of Fine Arts & Design\n• International Scholarship\n• Global MBA new\n• Feedback\nStudent Feedback About CurriculumStudents Feedback About TeachersStudents Feedback About University in GeneralTeachers’ Feedback About CurriculumAlumni FeedbackParent’s FeedbackEmployer’s Feedback\n• Apply Now 2025\nCAREERS\nLeadership\nNISP 2019\nAnnual Reports\nBoard of Governors\nUniversity Ordinances\nUniversity ACT\nUniversity Statute\nFee Payment Policy\nFee Payment Procedure\nScholarship Policies\nSports Scholarship Policy\nCRS Policies\nUniversity Hostel Policy\nSchool Of Business Management\nSchool Of Nursing\nSchool Of Law & Legal Affairs\nSchool Of Journalism & Mass Communication\nSchool Of Allied Health Sciences\nSchool of Engineering & Technology\nSchool of Fine Arts & Design\nSchool Of Liberal Arts\n• COVID-19\nCampus: Noida International University, Plot No. 1, Sector-17 A, Yamuna Expressway, Gautam Budh Nagar, Uttar Pradesh 201312\nAligarh office: Near Vikas Sweet Shop, Samad Road Centre Point, Aligarh-202001\nFaridabad office: Space Centre, Parsvnath City Mall, Tf-01, 3rd Floor Sector-12, Faridabad (Haryana)\nSource: https://niu.edu.in/placement-policy/"
    },
    "admission_requirements": {
      "summary": "This text provides a list of key information related to university admissions and student services. It covers application processes like CUET counselling, details on courses and fees for 2025-26, scholarship and loan options, transport, and hostels. Additionally, it highlights admission alerts, the admission and outreach team, PhD admissions, and access to a domestic brochure for Indian students.",
      "raw_content": "Apply for CUET CounsellingAdmission ProcessCourses & Fee Structure For 2025-26Scholarship & Bank LoanTransportHostels\nAdmission AlertsAdmission and Outreach TeamPh.D. AdmissionsDomestic Brochure (Indian Students)Prospectus\n• Apply for CUET CounsellingAdmission ProcessCourses & Fee Structure For 2025-26Scholarship & Bank LoanTransportHostels\n• Apply for CUET Counselling\n• Admission AlertsAdmission and Outreach TeamPh.D. AdmissionsDomestic Brochure (Indian Students)Prospectus\n• Admission and Outreach Team\n• Domestic Brochure (Indian Students)"
    },
    "placement_policy": {
      "summary": "This document outlines the placement policy and process at Noida International University. It details the roles and responsibilities of the Placement Cell, the classification of companies, and the steps involved in inviting companies, sharing job details, and scheduling campus drives. The policy also covers student eligibility, conduct during recruitment, offer letter procedures, and consequences for misconduct or withdrawing from offers. Key requirements for students include maintaining 75% attendance and adhering to strict discipline.",
      "raw_content": "OverviewThe TeamTraining & Placement ProcessPlacement PolicyIndustry Visit\nPlacement RecordRecruitersOur PlacementsNIU Star AlumniPlacement Contact\n• OverviewThe TeamTraining & Placement ProcessPlacement PolicyIndustry Visit\n• Training & Placement Process\n• Placement RecordRecruitersOur PlacementsNIU Star AlumniPlacement Contact\n• Recruiters\nNoida International University Placement policy is defined by below roles\n• The Placement Cell (which is the nodal centre for placements at Noida International University) sends invitations to companies/organizations along with the relevant information.\n• Classification of Companies will be based on salary packages, brand value of the company,, relationship, & past record of recruitment at Noida International University.\n• Placement Cell will obtain all information available on the Internet or a physical visit to the company if required to check the profile and track record of the company prior to conducting the campus drive.\n• Placement Cell will ask the company to share the Job Description/Job Announcement, Details of Organization, Job Profile, Salary Details, Selection Process, Minimum Qualification Required, Probation Period, Documents required for Joining, Tentative Date of Joining, etc.\n• The details provided by the companies through Job Description and company brochures will be displayed in the placement cell, and these details will also be shared with the concerned school Placement co-ordinator and their respective students.\n• With the mutual consent of the respective school Head of Department, the Placement Department/ Cell will suggest two or three dates for companies/organizations to conduct campus or off-campus drives (depending on the total participating students for a particular drive).\n• The company/organization will choose one date from the suggested dates and will inform the Placement department.\n• Placement official will convey the confirmed date via official email to the head of the Department, the placement coordinator of the respective school, and the students applying for the respective company.\n• The company will visit the campus or invite them to their respective office (in case of off-campus drive) on the allotted date to conduct tests and/or interviews according to their recruitment process.\n• Placement officials will conduct mock GD/PI//PD sessions two days before the recruitment drive. This will help the students to build up their confidence.\n• The company/organization shall be requested to furnish the final list of selected students on the same day of campus drive or after the document verification.\n• The company shall hand over the duly signed hard copy or soft copy via official email ID of the final list of selected candidates to the placement department.\n• The company shall provide the offer letters to the Placement department and not directly to the students.\n• For any campus drive, Placement Cell will make necessary arrangements for the hospitality of executives.\n• After placement drives, results should be displayed on placement cell notice boards.\n• All students of the final year are eligible to participate in the placement; however, they shall be permitted to join the assignment only in the last semester.\n• Students have to ensure that they report on time as informed by the placement team/coordinators. Students coming late will be strictly not allowed to appear in that process.\n• All students need to ensure that they are meeting the eligibility criteria of the company as mentioned in the Job Description. All mark sheets are checked at the time of joining, and if the company finds that you have manipulated your marks or documents at the time of Campus Recruitment your job offer will be terminated and your name will be blacklisted forever.\n• It is mandatory to maintain 75% attendance in the concurrent semester to appear for any campus placement.\n• Strict discipline needs to be followed by every student during the recruitment process. Any students found misbehaving or during misconduct will be debarred from the entire placement season. No casual talks or remarks should be extended by any students during the process or even after the process to company delegates.\n• Students are not allowed to contact Company officials directly for any reason. If they are facing any problem, they have to first contact their Placement coordinator/officer available and discuss their problem with them. Respective Placement Officers may consult the Placement Head to resolve the issues instead of bringing insignificant issues before company representatives.\n• Proper diligence should be done before accepting or declining an offer letter. Once the offer letter is accepted by the student, thereafter if he/she declines the acceptance, then such student will be debarred and will not be allowed to appear in any other future placement events, except in genuine and special circumstances.\n• If the student’s name appears on the final shortlist declared after the Company’s selection process through the Placement Cell, then that would be considered an offer to the student.\n• If any student quits in between, he/she will be debarred & will not be allowed to appear in any other future placement events, except in special circumstances.\n"
    }
  }
}