{
  "source_file": "noida.agbs.in_noida_agbs_in_raw_2025-08-11-11-45-06.txt",
  "structured_data": {
    "general_info": {
      "summary": "Amity Global Business School Noida is a prominent business school in Noida, offering a comprehensive management education. It features a blend of academic and industry faculty, and its Corporate Resource Cell regularly organizes international summits, conferences, and guest lectures. The curriculum focuses on recent case studies, management philosophies, business communication, personality development, and soft skills, with periodic updates reviewed by industry experts. The campus provides a conducive learning environment with modern infrastructure, including Wi-Fi, air-conditioned facilities, a library, auditoriums, sports fields, and hostel accommodation, aiming to provide a holistic learning experience for its students.",
      "raw_content": "AMITY GLOBAL BUSINESS SCHOOL NOIDA Amity Global Business School Noida is a leading Business School, located in the heart of Noida city. The Institution encompasses a blend of faculty members from the academia and industry. The Corporate Resource Cell of Amity Global Business School Noida organises time to time – International Summits– Conferences and Conclaves alongside guest lectures, workshops and seminars delivered by eminent industry stalwarts. Our management training modules generally revolve around recent case studies with extended application of management p h i l o s o p h i e s . B u s i n e s s C o m m u n i c a t i o n , P e r s o n a l i t y Development and soft skills training is integral to enhance the employability of our students. A periodic review is undertaken for curriculum updation vetted by industry experts and academicians. We provide a conductive learning atmosphere for our students with quality infra-structure including a fully Wi-Fi campus, air conditioned classrooms, air-conditioned world- class central library, auditoriums, seminar halls, swimming pool, shooting range, sports fields, hostel facilities, banks, ATMs and other amenities within the campus. Amity Global Business School Noida offers world class management education – making students learning a holistic experience."
    },
    "admission_requirements": {
      "summary": "Admission to this program is determined by a combination of factors: the applicant's percentage in their qualifying exam, their performance on an English Essay Test, and an interview.",
      "raw_content": "ADMISSION CRITERIA Admission will be based on percentage in the qualifying exam, English Essay Test and Interview"
    },
    "hostel_fees": {
      "summary": "This text provides the annual hostel fees, differentiating between non-air-conditioned rooms at ₹94,500 per year and air-conditioned rooms at ₹1,76,500 per year.",
      "raw_content": "HOSTEL FEES : Non AC ₹94,500/- per year | AC: ₹1,76,500/- per year"
    },
    "social_media": {
      "summary": "This text provides a list of social media and professional networking platform links for AGBs Noida, allowing users to connect with the institution on various platforms like Facebook, Twitter, Instagram, Pinterest, YouTube, and LinkedIn.",
      "raw_content": "Connect with us: facebook.com/agbsnoida/ twitter.com/noidaagbs/ instagram.com/agbsnoida/ in.pinterest.com/agbsnoida/ youtube.com/c/agbsnoida/ linkedin.com/school/agbsnoida"
    },
    "industry_interactions": {
      "summary": "This text provides a list of individuals and their respective corporate roles and affiliations, primarily within the Indian industry. It features names such as Pradeep Hatgaonkar from Hitachi Astemo India, Sanjay Banga from Cement Corporation of India Ltd, and Swati Dash from HCL Technologies, among others, indicating a focus on HR and leadership positions across various sectors.",
      "raw_content": "INDUSTRY INTERACTIONS CORPORATE SPEAK Mr. Pradeep Hatgaonkar Country Head - HR Hitachi Astemo India Mr. Sanjay Banga Chief Managing Director Cement Corporation of India Ltd (CCI) Mr. Sabih Kidwai Director Schneider Electric Mr. Ayush Gupta Director HR Gail India Limited Mr. Dibendu Das Director-Finance Engineering Projects (India) Ltd. Ms. Swati Dash Director HR HCL Technologies Mr. Ramkrishna Sataluri Executive Vice Presidents and Country Head Tata Power Soler Systems Limited Mr. Pradyumna Pandey Chief Human Resource Officer Mother Dairy Mr. Amit Jewar Business Head Dabur India Limited 4"
    },
    "testimonials": {
      "summary": "This text contains reflections from four alumni of AGBS Noida, expressing their gratitude for the excellent learning experience. They highlight the supportive faculty who fostered confidence and personal growth, the rigorous coursework, practical learning opportunities, and the development of crucial life skills. The alumni also appreciate the opportunities for exploration and making connections, ultimately feeling transformed and more confident after their time at the institution.",
      "raw_content": "7 ALUMNI REFLECTIONS The experience at AGBS NOIDA has been excellent. All the renowned faculty members treat the students like their children, pushing them for betterment, instilling the confidence that a student desires in their career, encouraging us, and ensuring that we develop and evolve as a whole. Thank you AGBS and all the teachers. This has truly been the best learning and developing experience. Sadhna Mishra MBA BATCH 2022-24 I am immensely grateful for the unwavering support, mentorship, and resources that I have received from the faculty, placement cell and peers of my AGBS Noida. The rigorous coursework, engaging discussions, and practical learning opportunities have equipped me with the skills and knowledge needed to excel in the dynamic business landscape. AGBS Noida truly captured the essence of the holistic learning experience that I have been fortunate to be a part of. Mayank Kumar Jha MBA BATCH 2022-24 As a student at Amity Global Business School, I can confidently say that my experience here has been transformative. Not only have I gained valuable knowledge in my chosen field, but I've also developed crucial life skills such as time management, critical thinking, and effective communication. The opportunities for personal and academic growth are abundant, and I'm grateful for the supportive environment that encourages exploration and discovery. Shaurya Makheja BBA BATCH 2021-24 I feel highly obliged and grateful to AGBS for giving me a lifetime opportunity to explore new horizons and make reliable and resourceful connections. Amity has provided me numerous opportunities for the overall development. I feel more confident after connecting with Amity. Rishika Singh BBA BATCH 2023-26"
    },
    "recruiters": {
      "summary": "This text lists several recruiters and notable alumni associated with various companies. The individuals mentioned include Hardeep Singh, Vikas Garg, Vikas Joon, Shubham Sinha, Shubhashish Banerjee, Vaibhav Fadnavis, Kamayani Rajvanshi, and Megha Dhawan, who are affiliated with organizations such as CBRE India, Noon-Dubai, Eventoss Entertainment Pvt. Ltd., Unicommerce, MRG WORLD, Kotak Mahindra Bank, and Infosys, with Amazon also mentioned.",
      "raw_content": "6 FEW OF OUR RECRUITERS NOTABLE ALUMNI CBRE India Hardeep Singh Vikas Garg Noon- Dubai Vikas Joon Eventoss Entertainment Pvt. Ltd. Shubham Sinha Unicommerce Shubhashish Banerjee MRG WORLD Kotak Mahindra Bank Vaibhav Fadnavis Kamayani Rajvanshi Infosys Megha Dhawan Amazon"
    },
    "source": {
      "summary": "This text provides a web source link to a PDF brochure hosted on the agbs.in domain, specifically for Noida.",
      "raw_content": "Source: https://noida.agbs.in/brochure.pdf"
    }
  }
}