{
  "source_file": "www.galgotiasuniversity.edu.in_Student_Visa_for_International_students_raw_2025-08-10-18-45-10.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text appears to be metadata or identifying information related to Galgotias University, potentially including references to the India Today Media Institute, its Vision 2030 plan, an annual report for 2022-23, copyright information, development details by City Innovates, and a source URL for student visa information for international students.",
      "raw_content": "• India Today Media Institute\n• Galgotias University\n• Galgotias University Vision 2030\n• GU Vision Plan_2030 21-01-2024\n• Annual Report-2022-23\n• © 2025 Copyrights Galgotias. All rights reserved.\n• Designed, developed & maintained By : City Innovates\nSource: https://www.galgotiasuniversity.edu.in/p/student-visa-for-international-students"
    },
    "placements": {
      "summary": "The provided text outlines various aspects of career planning and placement services offered by an organization, including the Career Planning and Development Division (CPDD), associated recruiters, placement records, policies, and testimonials from students and recruiters, as well as highlighting top performers and a placement gallery.",
      "raw_content": "• Placements Latest Placements Career Planning and Development Division (CPDD) Associated Recruiters Corporate Tie Ups Placement Records Employability Enhancement Program Placement Policy Placement Brochure Recruiters Speak Students Speak Highest Performers Placement Gallery\n• Career Planning and Development Division (CPDD)\n• Associated Recruiters\n• Recruiters Speak\n• Highest Performers"
    },
    "research": {
      "summary": "This text outlines various aspects of research and global engagement initiatives, likely from an academic institution. It lists key departments, centers, and activities such as research ethics, publication summaries, organized events (international and national), faculty development programs, research awards, citation metrics, media outreach, student projects, and recognition of honorary professors and centers of excellence. The text appears to be a structured overview of a university's research-focused departments and their achievements.",
      "raw_content": "• Research Message from Dean (Research)\nResearch Excellence and Global Engagement\nResearch & Development Cell\nGalgotias Centre for Interdisciplinary Research\nResearch Ethics Application Department wise Publication Summary Research Group Organized Events International & National Events International FDPs Research Awards Scopus Citation WoS Citation Newsletter Session with Noble Laureates DSIR - SIRO Recognition Centres of Excellence Media Outreach Research Group Diversity Open House Project for Students Honorary Professors Best Practices G-MRDC Centre of Excellence for Semiconductor Research\n• Message from Dean (Research)\n• Research Excellence and Global Engagement\n• Research & Development Cell\n• Galgotias Centre for Interdisciplinary Research\n• Department wise Publication Summary\n• Research Group Organized Events\n• International & National Events\n• Session with Noble Laureates\n• DSIR - SIRO Recognition\n• Research Group Diversity\n• Open House Project for Students\n• Honorary Professors\n• Centre of Excellence for Semiconductor Research\n"
    },
    "campus_life": {
      "summary": "This text provides a comprehensive overview of a campus's offerings, highlighting various aspects of student life and institutional resources. It details campus facilities such as the hostel, library, and transportation, alongside extracurricular activities like societies, clubs, the National Cadet Corps (NCC), and the National Service Scheme (NSS). The information also includes sports, recreation, cafeteria services, healthcare, and cultural events such as Unifest and the Smart India Hackathon 2022.",
      "raw_content": "• Campus Life About the Campus Student Organization Societies & Clubs Hostel Library Transportation Services National Cadet Corps (NCC) National Service Scheme (NSS) Sports & Recreation Cafeteria Healthcare Facilities Unifest Events, Arts & Culture Resources & Facilities Convocation Smart India Hackathon 2022 Toycathon Launchpad\n• National Cadet Corps (NCC)\n• National Service Scheme (NSS)\n• Events, Arts & Culture\n• Smart India Hackathon 2022"
    },
    "governance_and_policies": {
      "summary": "This text outlines various institutional mechanisms and policies designed to address discrimination and grievances. It specifically mentions an online portal for students and employees to report issues, a committee to prevent caste-based discrimination in the workplace, an anti-ragging policy, and a committee focused on preventing sexual harassment.",
      "raw_content": "• Online Complaints Prevention of caste based discrimination at workplace committee Students Online portal for Redressal of Grievances Employee Online portal for Redressal of Grievances Anti-ragging Policy Complaint Committee for Prevention of Sexual Harassment\n• Prevention of caste based discrimination at workplace committee\n• Students Online portal for Redressal of Grievances\n• Employee Online portal for Redressal of Grievances\n• Complaint Committee for Prevention of Sexual Harassment"
    },
    "university_structure": {
      "summary": "The provided text outlines the organizational structure and offerings of Galgotias University. It details various sections such as 'About Us', 'Leadership', 'Awards, Rankings & Certifications', and 'Partnerships & Collaborations'. A significant portion is dedicated to listing the university's schools, including specialized ones like the School of Defence Technology, School of Computer Science & Engineering, School of Artificial Intelligence, and broader fields like Business, Law, and Media & Communication Studies.",
      "raw_content": "• About GU About Us Galgotias University Our Legacy The Galgotias Story Leadership Governance International Academic Team Awards, Rankings & Certifications Accreditations Mandatory Disclosures Policies & Regulations Partnerships & Collaborations iOS Development Center Virtual tour\n• Leadership\n• Awards, Rankings & Certifications\n• Partnerships & Collaborations\n• Schools School of Defence Technology School of Computer Science & Engineering School of Artificial Intelligence School of Aviation, Logistics & Tourism Management School of Computer Applications & Technology School of Engineering School of Business School of Law View More\n• School of Defence Technology\nSchool of Defence Technology\n• School of Computer Science & Engineering\nSchool of Computer Science & Engineering\n• School of Artificial Intelligence\nSchool of Artificial Intelligence\n• School of Aviation, Logistics & Tourism Management\nSchool of Aviation, Logistics & Tourism Management\n• School of Computer Applications & Technology\nSchool of Computer Applications & Technology\n• School of Finance and Commerce\n• School of Liberal Education\n• School of Medical and Allied Sciences\n• School of Nursing\n• School of Allied Health Sciences\n• School of Basic Sciences\n• School of Media & Communication Studies\n• School of Design\n• School of Biosciences and Technology\n• School of Vocational Education\n• School of Life Long Learning\n"
    },
    "international_admissions": {
      "summary": "This text outlines various resources and information available for international students, including details on admissions, programs, scholarships, the application process, support services like visa assistance and grievance handling, and preparatory courses. It also mentions clubs and events specifically for international students and provides general contact and resource links.",
      "raw_content": "• International Admissions About International Office Clubs for International Students International student programs Foundation and Bridge Courses for International Students Message from Director International Relations Programmes and Fees Scholarships Eligibility Admission Process Preparatory English Foundation Program Pre & Post Arrival Information for International Students International Students Grievances Wing Visa and FRRO Support International Apply Now Contact Us FAQs Download Brochure Testimonials Events Study in India\n• Clubs for International Students\n• International Students Grievances Wing"
    }
  }
}