{
  "source_file": "www.sharda.ac.in_International_Academic_Tie-Ups_-_Sharda_University_raw_2025-08-10-18-29-10.txt",
  "structured_data": {
    "general_info": {
      "summary": "This document outlines various programs and schools within Sharda University, including the School of Dental Sciences, School of Medical Sciences & Research, and Sharda School of Nursing Science & Research, for the 2025-26 academic year. It also lists key reports, initiatives, and resources such as examination reports, the Academic Bank of Credits, curricula feedback, university brochures, leadership information, tenders, legal documents, COVID-19 updates, counseling services, skill enhancement programs, entrepreneurship initiatives, FM radio, course fees, recruiters, and international programs, including campuses in Uzbekistan and Agra. Additionally, it mentions specific courses on human values and professional ethics, and awareness of cyber crime reporting.",
      "raw_content": "• Programme 2025-26\n• School of Dental Sciences\nSchool of Medical Sciences & Research\nSharda School of Nursing Science & Research\n• School of Medical Sciences & Research\n• Sharda School of Nursing Science & Research\nExamination Annual Report\nAcademic Bank of Credits (ABC)\nCurricula Feedback\nUniversity Brochure\n• Examination Annual Report\n• Academic Bank of Credits (ABC)\n• Curricula Feedback\n• University Brochure\n• Get to know sharda\n• Perspective Plan\n• Leadership\n• History\n• Statutory Bodies of the University\n• Sharda Tenders\n• Act, Statutes and Ordinances\n• COVID19\n• Family & Couple Counselling Services(FCCS)\n• Capacity Development & Skill Enhancement\n• Language and Communication Skill Initiatives: Sharda Skills\n• Soft Skill Initiatives : Career Counseling and Development Center\n• Awareness of Trends in Technology : IIC\n• Entrepreneurship\n• Innovation and Entrepreneurship\nFM Radio: Suno Sharda-90.8FM\n• FM Radio: Suno Sharda-90.8FM\n• Course Fee\n• Recruiters\n• Covid 19 Updates\n• Sharda University Uzbekistan\n• Sharda University Agra\n• Courses on Human Values and Professional ethics\n• National Cyber Crime Reporting Portal\n• International Credit Transfer Programme"
    },
    "general_info_links": {
      "summary": "The provided text lists two main categories: \"Global Knowledge Seekers\" and \"Our Recruiters\", with each category also appearing as a sub-point.",
      "raw_content": "Global Knowledge Seekers\n• Global Knowledge Seekers\nOur Recruiters\n• Our Recruiters"
    },
    "university_services": {
      "summary": "This document outlines guidelines related to banking and postal services, specifically mentioning directives for Visa and Foreigners Regional Registration Offices (FRRO), as well as guidelines for medical insurance.",
      "raw_content": "Banking And Postal Services\n• Banking And Postal Services\nGuidelines for Visa and FRO/FRRO\nGuidelines for Medical Insurance\n• Guidelines for Visa and FRO/FRRO\n• Guidelines for Medical Insurance\n"
    },
    "general_university_info": {
      "summary": "This document outlines various aspects of an organization, likely a university named Sharda. It covers leadership, history, statutory bodies, tenders, and relevant legal frameworks like acts, statutes, and ordinances. Additionally, it highlights several functional areas and initiatives including COVID-19 response, counseling services, capacity development, language and communication skills, soft skills, awareness of technological trends, entrepreneurship, innovation, and an FM radio station.",
      "raw_content": "Perspective Plan\nLeadership\nHistory\nStatutory Bodies of the University\nSharda Tenders\nAct, Statutes and Ordinances\nCOVID19\nFamily & Couple Counselling Services(FCCS)\nCapacity Development & Skill Enhancement\nLanguage and Communication Skill Initiatives: Sharda Skills\nSoft Skill Initiatives : Career Counseling and Development Center\nAwareness of Trends in Technology : IIC\nEntrepreneurship\nInnovation and Entrepreneurship\nFM Radio: Suno Sharda-90.8FM"
    },
    "other_programs": {
      "summary": "This text lists two distinct programs: Observership Programmes and Paramarsh- Our Mentoring Portal. Each program is mentioned twice.",
      "raw_content": "Observership Programmes\n• Observership Programmes\nParamarsh- Our Mentoring Portal\n• Paramarsh- Our Mentoring Portal"
    },
    "international_university_profiles": {
      "summary": "This document provides a comprehensive, albeit unorganized, list of universities and educational institutions from around the world. It includes brief descriptions, founding dates, locations, and sometimes student or staff numbers for each institution. The entries vary in detail, ranging from single-line mentions to multi-paragraph descriptions, and cover a wide geographical spread, highlighting the diversity of higher education globally.",
      "raw_content": "KING'S UNIVERSITY COLLEGE, UNIVERSITY OF WESTERN ONTARIO\nFounded in 1954, Kings University College at Western University is a Catholic, liberal arts university college affiliated with a large, world class university. Kings students enjoy “The Best of Both Worlds” - small classes led by outstanding faculty on a small, beautiful campus while enjoying the experiences of being part of a comprehensive university. Kings students have complete access to all the facilities and services at Western University and graduate with a Western degree. As a Catholic university, Kings emphasizes the value of each individual and the importance of social justice. Students from all faiths and backgrounds are most welcome. Respect for the human person is behind our commitment to diversity, accessibility, social justice and to building the common good. An inclusive, supportive community is one of King's greatest strengths.\nCurtin University Of Technology\nAdministrative staff - 3,689 Started in 1966 ties with 90 exchange universities in 20 countries 95 specialists centres/courses 5-star university as per the QS Stars university ratings Largest University in Western Australia.\nTaipei Medical University\nTaipei Medical University in Taiwan is located in Taipei's Xinyi District. Founded as Taipei Medical College in 1960, it was renamed as Taipei Medical University in 2000. It underwent the processes to building the foundation, flourishing, expansion and transformation via innovation.\nTamansiswa University\nUniversitas Sarjanawiyata Taman Siswa Yogyakarta is a university in Yogyakarta City in Indonesia.\nTelecom Ecole de Management\nInstitut Mines-Télécom Business School is a French state-funded Management School, a member of Institut Mines-Telecom, the number one group of engineering and management graduate schools in France.\nUniversity of Al Nahreen\nNahrain University (Arabic), (also known as Al-Nahrain University), is a coeducational public university established in 1987 and located in Baghdad, Iraq. The university offers undergraduate and postgraduate education as well as research opportunities. From 1987 to the 2003 Invasion of Iraq, the university was known as Saddam University which was then changed to its current name \"Nahrain\" meaning The Two Rivers (as in the two rivers of Iraq: Tigris and Euphrates).\nUniversity of Alexandria\nAlexandria University (Arabic:‎) is a public university in Alexandria, Egypt. It was established in 1938 as a satellite of Fouad University (the name of which was later changed to Cairo University), becoming an independent entity in 1942. It was known as Farouk University until the Egyptian Revolution of 1952 when its name was changed to the University of Alexandria. Taha Hussein was the founding rector of Alexandria University. It is now the second largest university in Egypt and has many affiliations to various universities for ongoing\nUniversity of Babylon\nThe University of Babylon is a university located in Babylon, Iraq. It consists of 20 colleges within three compounds, located seven kilometers south of the city of Hillah, in Babylon Province.\nUniversity of Baltimore\nThe University of Baltimore is a public university and member of the University System of Maryland located in midtown Baltimore, Maryland, in the Mt. Vernon neighborhood at 1420 N.\nUniversity of Illinois\nThe University of Illinois at Urbana–Champaign is a public research university in Illinois and the ... The campus library system possesses the second-largest university library in the United States by holdings after Harvard University.\nUniversity of Bremen\nThe University of Bremen (German Universität Bremen) is a public university in Bremen, Germany, with approximately 23,500 people from 115 countries. It is one of 11 institutions which were successful in the category \"Institutional Strategies\" of the Excellence Initiative launched by the Federal Government and the Federal States in 2012. The university was also successful in the categories \"Graduate Schools\" and \"Clusters of Excellence\" of the initiative.\nUniversity of Finance and Administration\nThe University of Finance and Administration is a private business school in the Czech Republic. It was founded by the Bank Academy and Czech Coal Group in 1999 and was one of the first private business schools in the country.\nRoyal Melbourne Institute Of Technology (Rmit)\nFounded in 1887 83,024+ students Grown to 87 buildings Academic staff - 4947 Spread across 7,800,000 sq ft.\nUniversity of Idaho\nThe University of Idaho is a public university in Moscow, Idaho. It is the state's land-grant and primary research university. The University of Idaho was the state's sole university for 71 years, until 1963, and its College of Law, established in 1909,\nUniversity of Malta\nThe University of Malta is the highest educational institution in Malta. It offers undergraduate bachelor's degrees\nUniversity of Missouri at Kansas City\nThe University of Missouri-Kansas City (UMKC) is a public research university in Kansas City, .... In the 2015 U.S. News and World Report Best Colleges rankings,\nUniversity of Muhammadiyah Sumatera Utara\nUniversitas Muhammadiyah Sumatera Utara (UMSU) adalah salah satu Perguruan Tinggi Swasta di Medan Sumatra Utara. UMSU merupakan salah satu kampus terbaik di Medan,\nUniversity of Mustansiriah\nMustansiriyah University (Arabic) is a university in Baghdad, Iraq. The original Mustansiriya Madrasah,\nUniversity of New York Tirana\nUniversity of New York Tirana is an accredited private higher education institution in Tirana\nUniversity of Raparin\nThe University of Raparin is a public university in Ranya, in the Sulaymaniyah Governorate of the Kurdistan Region of Iraq.\nUniversity of Tennessee at Chattanooga\nThe University of Tennessee at Chattanooga, is a public university located in Chattanooga, Tennessee, United States.\nUniversity of The Gambia\nThe University of The Gambia admits students from Africa, Europe, Asia and other parts of the world. In its quest to deliver excellence,\nUniversity of Warsaw\nThe University of Warsaw is the largest university in Poland and a leading research centre in the country.\nHochschule Bremerhaven - University Of Applied Sciences\n3091 students from 66 nations\n150 employees in teaching and administration\nThere are altogether four storeys with an area of 2500 m² used for classrooms, self-study rooms, a School Laboratory.\nUniversity of Wasit\nDescriptionUniversity of Wasit is one of the Iraqi Universities established in 2003 in Al Kut, Wasit, Iraq.\nUniversity of Western Ontario\nThe University of Western Ontario, corporately branded as Western University as of 2012 and commonly shortened to Western,\nVetha Center for Transdisciplinary Studies\nAt Vetha Center we believe in tuition-free education, modeled after educational ... research, knowledge exchange.\nVictoria University\nDescriptionVictoria School of Management, formerly known as Victoria University, is a private,\nWachemo University\nWachemo University in Hosaena, Ethiopia - Wachemo University Wachemo University (WCU) is one of the public higher educational institutions\nWuchang University of Technology\nWuchang University of Technology (the former WUST, Zhongnan Branch) is a ... in the southeast part of Wuhan in Central China's Hubei province, the university .\nXi'an Eurasia University began in 1995 as a simple Language training school and now has grown ... Around 22,000 Chinese students fill this campus each year.\nZhengzhou Normal University\nZhengzhou University colloquially known in a Chinese as Zhèngdà is a public university located in Zhengzhou, Henan, People's Republic of China.\nHuanghuai University\nEstablished in 1972, Huanghuai University is a higher education institution located in the medium-sized city of Zhumadian (population range of 500,000-1,000,000 inhabitants), Henan. Officially accredited and/or recognized by the Department of Education, Henan Province, Huanghuai .\nJinan University\nJinan University is a public research and comprehensive university based in Tianhe District,\nAmerican College Of Greece\nEuropes oldest (and largest) U.S.-accredited academic institution\n64-acre main campus in Athens suburb of Aghia Paraskevi\n27 undergraduate majors; 40 minors; 20 graduate degree Programmes\nOver 2800 graduate and undergraduate students\nOver 450 international students from more than 67 countries\nOver 52,000 alumni\nStembi College of Economic Science\nThe Indonesian Institute of Sciences is the governmental authority for science and research in Indonesia.\nWidya Nusantara Palu College of Health Science\nThis is a list of universities, colleges, polytechnics and other higher educational institutions in ... Polytechnic, which offers vocational degrees in various sciences and .... College of Health Sciences Ahmad Yani Yogyakarta, Sekolah Tinggi Ilmu .\nIslamic College of Economic Science\nEconomics, Science of Economics, and Islamic Economics ... Islamic economics has gained serious attention from various circles in Indonesia, ... used as a study program, either Islamic Higher Education (IHE) nor General College.\nPasundan University\nThe State of Pasundan was a federal state (negara bagian) formed in the western part of the ... Pasundan became a federal state of the United States of Indonesia in 1949 but was incorporated into ... Kahin, George McTurnan (1970), Nationalism and Revolution in Indonesia,\nYpbhk Breber Midwifery Academy\nAkademi Kebidanan YPBHK Brebes adalah salah satu Universitas yang ..\nBanten College of Health Science\nBANTEN SCHOOL HEALTH OF SCIENCE, Bumi Serpong, Jawa Barat, Indonesia. College & University.\nWidya Husada Semarang College of Health Science\nWidya Husada School of Health Sciences\nKhusnul Aini. School Nurse at Widya Husada School of Health Sciences. Location: Semarang Area, Central Java, Indonesia; Industry: Higher Education ...\nBani Saleh Bekasi College of Health Science\nHarapan Bangsa University\nJul 10, 2019 - Universitas Harapan Bangsa (Sebelumnya STIKES Harapan Bangsa Purwokerto) di Banyumas, Jawa Tengah. ... yang tergabung dalam Himpunan Perguruan Tinggi Kesehatan Indonesia (HPTKes) berkunjung ke India .\nDuta Dharma Pati Midwifery Academy\nAcademy midwefery Duta Dharma Pati, Pati, Jawa Tengah, Indonesia. ... Academy midwefery Duta Dharma Pati. College & University. \"DUTADHARMA MIDWIFERY ACADEMY\"\nNational Polytechnic Institute Of Mexico\nIt is one of the largest public universities in Mexico with 171,581 students\nThe institute consists of 98 academic units offering 293 courses\n2More than 17,534 academic staff and 10,383 administrative staff\nIt's main campus is on approximately 530 acres (2.1 km2) north Mexico City\nKarya Husada Semarang College of Health Science\nHealth Science College of Karya Husada Semarang, Semarang, Indonesia. College & University.\nGuna Bangsa Yogyakarta College of Helath Science\nThe journal contents are managed by the health analyst (medical of laboratory ... of radiodiagnostic, College of Health Sciences Guna Bangsa Yogyakarta.\nTamalatea Makassar College of Helath Science\nSelamat datang di website resmi kampus STIK Tamalatea Makassar. ... tinggi swasta pertama di Kawasan Indonesia Timur yang membuka program pendidikan ...\nInsan Cendekia Medika Jombang College of Health Science\nInsan Cendekia Medika Jombang, Jombang, Jawa Timur, Indonesia. 840 likes. Medical School.\nGabes University\nThe University of Gabès is a public university located in southern Tunisia with headquarters in Gabès.\nTeesside University\nTeesside University is a public university with its main campus in Middlesbrough, Teesside in North East England. It has 18,576 students, according to the 2015/16 HESA student record\nWestern Sydney University\nWestern Sydney University, formerly the University of Western Sydney, is an Australian multi-campus university in the Greater Western region of Sydney.\nAreandina University\nPhone, Suggest a phone number ... Universidad del area Andina - Bogotá - Colombia, Bogotá, Colombia. 8 likes. College & University.\nMinistry of Higher Education of Uzbekistan\nThe Ministry of Higher and Secondary-Specialized Education of the Republic of Uzbekistan was formed by the President's Decree dated January 7, 1990.\nUniversity Antonio Narino\nThe Antonio Nariño University (UAN) is a Colombian, private and comprehensive university, founded in 1976. The UAN is committed to democratizing ...\nUral Federal University\nThe number of full-time students studying at UrFU exceeds 33,000 from 80 countries of the world\nMore than 4,200 teachers\n360 Russian and English-taught educational Programmes are provided by 17 institutes\nMore than 300,000 people have graduated from the University.\nThe International School of Medicine is a medical school in Kyrgyzstan established in 2003.\nAPUIHEA Association of private universities\nAssociation of Private Universities and Institutes of Higher Education in Afghanistan, thereafter “APUIHEA” is a national\nNile University\nNile University of Nigeria is a private university in Abuja, Federal Capital Territory of Nigeria\nRomanian American University\nDescriptionThe Romanian-American University is a private university in Bucharest, Romania\nKing's College is a private business school situated at Babarmahal, Kathmandu,\nLa Trobe University\nLa Trobe University is an Australian multi-campus public research university with its flagship campus located in the Melbourne suburb of Bundoora. The university was established in 1964, becoming the third university in the state of Victoria and the twelfth university in Australia. La Trobe is one of the Australian verdant universities and also part of the Innovative Research Universities group.\nUniversitas Islam Syekh-Yusuf\nUniversitas Islam Syekh-Yusuf (UNIS) Tangerang pada tahun 2018 ini telah memasuki usia 52 tahun. Sebuah perjalanan yang sangat panjang bagi sebuah ...\nJami University\nJamayat-E-Islami sometimes shortened to Jamiat, is a Muslim political party in Afghanistan. The oldest Muslim political party in Afghanistan, it was originally formed as a student political society at Kabul University.\nFederal Polytechnic, Oko is a Nigerian polytechnic based in Oko, Anambra State. It was previously known as College of Arts, Science and Technology.\nTertiary Education Commission of Mauritius\nThe Tertiary Education Commission has as objects to promote, plan, develop and coordinate post-secondary education in Mauritius and to implement an ...\nPurbanchal University\nPurbanchal University, a public university in Biratnagar, was established in 1993 by the Government of Nepal with its fundamental objective of preserving, refining, inventing\nLincoln American University\nLincoln American University, School of Medicine, also known as LAU, is a for-profit private medical university based in Guyana, Caribbean. LAU is registered with the National Accreditation Council of Guyana.\nNational University of Tres de Febrero\nThe National University of Tres de Febrero is an Argentine national university\nHuawei Technologies reviews in Almaty, Kazakhstan. A free inside look at company reviews and salaries posted anonymously by ...\nLLC Scientific and Technical Center SOTSB\nhttps://en.wikipedia.org/wiki/Science_and_Technology_Center_in_Ukraine\nThe Science and Technology Center in Ukraine commonly known as the STCU\nLLP Special Design Technological Bureau\nKazakhstan Patent and Trademark Attorney, Eurasian Patent Attorney ... Graduate of the Kazakh National Technical University as engineer in metal sciences ...\nSt. Petersburg National Information Research University\nITMO University official logo horizontal.png. ITMO University (Russian ITMO: Information Technologies, Mechanics and Optics) is a large state university in Saint Petersburg and is one of Russia's National Research Universities.\nRSE Karaganda State Industrial University\nKaraganda State Medical University is one of the leading medical university of the Republic of Kazakhstan\nJSC National Center for Space Research and Technology\nJSC “National Center of Space Researches and Technologies” is 10 years old ... under the aegis of Kazcosmos «Space: science and technology» devoted to ... Chairman of Kazakh National Space Agency Talgat Mussabayev ...\nUniversity of Cordoba,\nThe University of Córdoba, is a university in Córdoba, in Andalusia, Spain, chartered in 1972. It offers undergraduate and postgraduate studies in humanities, social sciences, health sciences, natural sciences and engineering.\nJSC International University\nMinistry of Education and Science “Center for International Programs” established as ... hundreds of universities from all over world in the largest cities of Kazakhstan. ... The Center carries out information work in Kazakhstan on international ...\nuniversity of almeria\nThe University of Almería is a public university situated in Almería, Spain. Located on the shore of the Mediterranean Sea, it belongs to the La Cañada de San Urbano district of Almería City. In 2008 the University offered 38 different degree programmes, with 871 lecturers, and 11,628 students.\nuniversity of monterrey\nThe University of Monterrey is a private Roman Catholic institution of higher learning located in Monterrey, Mexico\nGannan Medical University\nLocated in Ganzhou, a famous historical and cultural city in south of Jiangxi province and beside Beijing-Kowloon Railway, Gannan Medical University (GMU) is the only medical university of Bachelor Degree in Jiangxi province. Professor Han Jisheng, an academician of China Science Academy, works as the honorary president of GMU. GMU was founded as Ganxian Advanced Midwifery Vocational School of Jiangxi Province in 1941, developed to Gannan Medical Technical School in August 1958 and was updated to GMU in April 1988.\nUniversity of Piraeus\nThe University of Piraeus is a Greek public university located in Piraeus, Athens, Greece with a total of nine academic departments focused mainly on Business Management, Economics, Finance, Information Technology, Maritime Studies, and Statistics\nManisa Celal Bayar University\nManisa Celal Bayar University or is a public research university located in Manisa, Turkey. CBU traces its root back to 1959 as an independent sports and teachers' college in Manisa. The main campus is in Muradiye district of Manisa. The university is composed of 14 colleges, 3 schools, and 15 vocational schools.\nUCES University\nUCES University, Argentina\nWuhan University\nWuhan University is in Wuhan, Hubei. It is one of the most prestigious and selective universities in China, which has been selected as a Chinese Ministry of Education Class A Double First Class University.\nUniversity of Sagrado Coracao\nEstablished in 1953, Universidade do Sagrado Coração (Sacred Heart University) is a non-profit private higher education institution located in the small city of Bauru (population range of 250,000-499,999 inhabitants), Sao Paulo. Officially accredited and/or recognized by the Ministério da Educação, Brazil (Ministry of Education, Brazil), Universidade do Sagrado Coração (USC) is a coeducational higher education institution formally affiliated with the Christian-Catholic religion.\nUniversity of Central Arkansas\nThe University of Central Arkansas is a public research university in Conway, Arkansas. Founded in 1907 as the Arkansas State Normal School, the university is one of the oldest in the U.S. state of Arkansas.\nLetourneau University\nLetourneau University, USA\nCollege of Law and Business\nThe College of Law and Business is a private college in Ramat-Gan, Israel. It was established in 1995 by members of the law faculty of Hebrew University of Jerusalem. The president is Moshe Cohen-Eliya.\nIstanbul Aydin University\nIstanbul Aydn University is a private university founded on May 18, 2007 in Istanbul, Turkey by extension of its predecessor, the vocational college of Anadolu BIL that existed since September 26, 2003. The university is a technology center built on an area of 175,000 m²\nUniversity of Cyprus\nThe University of Cyprus is a public research university established by the Republic of Cyprus in 1989. It admitted its first students in 1992 and has approximately 7000 students.\nADA University\nDA was established in 2006, transformed into university by the decree of President in 2014 and is accredited by the Ministry of Education of the Republic of Azerbaijan.\nADA University is dedicated to preparing innovative global leaders and to promoting useful collaborative research on diplomacy, public and international affairs, business, humanities and sciences, information technologies and system engineering.\nIstanbul Sehir University\nIstanbulehir University is a private, non-profit university located in Istanbul, Turkey. It was established in 2008 by the Bilim ve Sanat Vakf?.\nCity Unity College / Cardiff Metropolitan University campus in Cyprus\nKarabuk University\nKarabük University is a public university in Karabük, Turkey. It was founded in 2007 as one of the 17 new universities of that time in Turkey.\nEurasian National University\nThe L. N. Gumilyov Eurasian National University, is a Kazakh national research university and largest institution for higher education in Nur-Sultan. The university was founded on 23 May 1996 as the result of merger of Akmola Civil Engineering Institute and Akmola Pedagogical Institute. It was named L. N.\n3IL Groupe in France. Get all info about the school, programs and application process. Save time and contact the school here!\nAhfad University for Women\nAhfad University for Women is a private women's university in Omdurman, Sudan. that was founded in 1966, by Yusuf Badri, son of the Mahdist soldier, Babiker Badri. The University began with only 23 students and 3 teachers. It was the first Sudanese women's college.\nal mustaqbal university college\nAmerican College of Thessaloniki\nCreate your Future Self at the American College of Greece. Register now online! It is never too late to pursue your Dreams. Learn more here! Study Abroad Program. Scholarships. Internship Opportunities.\nArkansas State University\nArkansas State University is a public research university in Jonesboro, Arkansas. It is the flagship campus of the Arkansas State University System and the second largest university in Arkansas by enrollment. It was founded in 1909 and is located atop 1,376 acres on Crowley's Ridge.\nBakhtar University\nBakhtar University is an established private university in Afghanistan. It is in the capital city, Kabul. The university has developed a research and development cell and will issue its first journal, Bakhtar Journal of Advance Research, soon.\nSolbridge Business School, Woosong University\nSolBridge prepares students to be the Next Generation of Asian Thought Leaders in the fast growing and rapidly changing Asian economy.\nBeijing Wuzi University\nBeijing Wuzi University is a higher education institution based in the capital of China, Beijing.\nCatholic University of Uruguay\nCatholic University of Uruguay is a private university in Uruguay opened in 1985. It was the only private university in the country for 11 years until 1996.\nCatholic University San Antonio Murcia\nhe Universidad Católica San Antonio, also known as the Universidad Católica de Murcia\nDali University\nDali University is a provincial full-time comprehensive university approved by the Chinese Ministry of Education. It is located in the famous tourist city Dali,\nDebre Tabor University\nDebre Tabor University, Ethiopia\nDunya University\nDunya University of Afghanistan is a private university established in 2009 in Kabul, Afghanistan in partnership with the Swiss UMEF University.\nEUDE Business School es entidad colaboradora de la prestigiosa Universidad Camilo José Cela, una institución que cuenta con un amplio reconocimiento nacional e internacional, posicionada como una de las mejores universidades privadas de España\nEURECOM is a French graduate school and a research center in communication systems based in the international science park of Sophia Antipolis within the new Campus SophiaTech, which brings together renowned universities such as TELECOM ParisTech and other European Universities such as the Polytechnic University of Turin, Aalto University (formerly Helsinki University of Technology), Munich University of Technology and the Norwegian University of Science and Technology.\nGalway-Mayo Institute of Technology\nGalway-Mayo Institute of Technology is a third level institute of education and is based at five locations in the west of Ireland.\nGannan Medical University (GMU) Located in Ganzhou, a famous historical and cultural city in south of Jiangxi province and beside Beijing-Kowloon Railway, Gannan Medical University (GMU) is the only medical university of Bachelor Degree in Jiangxi province. Professor Han Jisheng, an academician of China Science Academy,\nSejong University\nEstablished in 1940, Sejong University is a private higher education institution located in the urban setting of the metropolis of Seoul (population range of over 5,000,000 inhabitants). Officially accredited and/or recognized by the Ministry of Education, Korea, Sejong University (SJU) is a large (uniRank enrollment range 15,000-19,999 students) coeducational higher education institution.\nGannan Normal University\nGannan Normal University (GNU), founded in 1958, is a well-known comprehensive ... Students can come to study Chinese for one semester or one year)\nGestión Educativa Consultores (GEC) is a Spanish Organization that helps students from other countries to access Higher Education studies in Spain.\nGhalib University\nGhalib University web ranking & review including accreditation, study areas, degree levels, tuition range, admission policy, ...\nFujairah is an emirate on the east coast of the United Arab Emirates, lying along the Gulf of Oman. It's known for its beaches and the Hajar Mountains,\nGraduate Institute of Science and Management\nOne of the best among the education institutes in Sri Lanka, GISM Campus is a modern centre for higher studies & research with an ... Massey University graduates are highly recognised in both New Zealand and worldwide. ..\nHarare Institute of Technology\nHarare Institute of Technology is a Zimbabwean university offering courses mainly in technology.\nHasan Kalyoncu University\nHasan Kalyoncu Üniversitesi (Hasan Kalyoncu University) is a non-profit private higher education institution located in the large city of Gaziantep (\nHeriot Watt University\nHeriot-Watt University is a public research university based in Edinburgh, Scotland, established in 1821 as the world's first mechanics' institute, subsequently was granted university status by royal charter granted in 1966.\nHigher Institute of Management Studies\nThe Higher Institute of Management Studies (HIMS) is a private Higher Education ... authorized by the Ministry of Higher Education (MINESUP), Cameroon.\nUniversity Of The West Of England\nhe University of the West of England (UWE), located in Bristol, is a modern university with roots that date back to the founding of the 16th century Bristol Society of Merchant Venturers' Navigation School .\nHubei University of Technology\nHubei University of Technology specializing in engineering, was founded in 1952, located in Hugong Residential Community,\nIndustrial University of Tyumen\nDescriptionTyumen State Oil and Gas University is a higher educational institution of Tyumen, one of the largest scientific and educational complexes of Russia including all education levels from the general ...\nInstitute of Professional Studies\nInstitute for Professional Studies offer full time training to the interested ... We are the oldest and most experienced training institute in the capital city of Bhutan.\nInstitute Universitaire de la Cote\nInstitut Universitaire de la Côte (IUC) est une grande institution privée d'enseignement supérieur dont la vocation est la formation intellectuelle et humaine des\nInterNapa College is a private institution of higher education registered with the Ministry of Education & Culture of the Republic of Cyprus to award its own ...\nIthaca College began as a music conservatory in 1892, helping young musicians hone their talents into professional-caliber skills\nJiangxi Science and Technology Normal University\nJiangxi Science and Technology Normal University is a teacher training college located in Nanchang, Jiangxi Province\nJigjiga university\nJigjiga University is a university in Jigjiga town, the capital of the Somali Regional State of Ethiopia\nJinggangshan University\nJinggangshan University is in the Jinggangshan Mountains in Qingyuan District, Ji'an city of Jiangxi province in China.\nKabul University\nKabul University is one of the major and oldest institutions of higher education in Afghanistan. It is located in the 3rd District of the capital Kabul, near the Ministry of Higher Education.\nCARDIFF METROPOLITAN UNIVERSITY\nCARDIFF Metropolitan University is a thriving, modern University based on two teaching campuses in the capital city of Wales.\nCardiff Metropolitan University traces its heritage to 1865 with the formation of the Cardiff School of Art.\nIt offers more than 100 different degree programmes.\nKampala International University\nKampala International University Dar es Salaam College is a constituent college of Kampala International University in Dar es Salaam, Tanzania\nKampala International University is a private multi-campus university in Uganda\nMarmara University\nMarmara University is a public university in the Fatih district of Istanbul, in Turkey.\nMashal University\nMashal University is private university established in 2009, located in the city of Kabul, Afghanistan\nMendel University, Czech Republic\nMendel University in Brno is located in Brno, Czech Republic. It was founded on 24 July 1919 on the basis of the former Tábor Academy. Wikipedia\nMid Western University\nMid Western University is a state-run university in Surkhet, the regional headquarters of the Karnali Province of Nepal, formerly the headquarters of the midwestern development region of Nepal.\nMiddlesex University\nDescriptionMiddlesex University London is a public university in Hendon, north-west London, England\nMogilev A Kuleshov State University\nMogilev State A.Kuleshov University is a large regional educational and scientific centre situated in Mogilev city, Belarus\nMoscow University of Law and Business\nThe business school of the Moscow University of Finance and Law specializes in providing high-quality business education and currently offers \"MBA in Strategic Managment\", and \"Masters in General Management\" programs\nNaryn State University\nNaryn State University was founded in the mountainous place of Naryn on May 22, 1996 by the decree of thefirst President of the Kyrgyz ...\nMissouri State University\nMore than 26,000 students enrolled Universitys main campus, containing over 40 buildings, is located on 225 acres (91.1 ha) in central Springfield Library contains over 877,000 books, subscriptions to over 3,500 periodicals and newspapers 110,000 alumni from around the world Darr Agricultural Center is located on 90 acres (36.4 ha).\nNational University of Mongolia\nThe National University of Mongolia is the oldest university in Mongolia, established in 1942 and originally named in honour of Marshal Khorloogiin Choibalsan.\nNew York College is a group of educational institutions offering high quality multicultural education through its academic collaboration with.\nNoman Sadat University\nNoman Sadat Institute of Higher Education web ranking ... Find out rankings and reviews of all Universities in Afghanistan.\nNorthumbria University\nNorthumbria University, in Newcastle upon Tyne, is an expanding ... further and higher education, industry and commerce throughout the UK, Europe and beyond.\nOmdurman Islamic University\nOmdurman Islamic University is built on an area of size about 800 feddans in Omdurman, Sudan\nOrkhon University\nOrkhon University is nonprofit private university in Ulaanbaatar, Mongolia. Founder Khajidsuren Nyamaa established the university in 1992 as Orkhon Institute of Foreign Languages and Secretarial Training.\nPayap University\nPayap University, established in 1974, is a private and non-profit institution founded by the Foundation of the Church of Christ in Thailand.\nUniversity of Plymouth\nThe University of Plymouth is a public university based predominantly in Plymouth, England where the main campus is located, but the university has campuses and affiliated colleges across South West England.\nPolytechnic Institute of Leiria\nThe Polytechnic Institute of Leiria is a public institution of Higher Education that offers courses of training on an Undergraduate Degree, Masters, Post-Graduate\nRajamangala University of Technology Tganyaburi\nRajamangala University of Technology Thanyaburi has been established in the Rajamangala University of Technology Act on 18 January 2005 by including two units together\nSacred Heart University\nOver 8,500 full and part-time undergraduate and graduate students More than 281 full-time professors and 520 adjunct professors It has the only American-accredited MBA Programmes in the Grand Duchy of Luxembourg 24 club sports active on campus\nRana University\nRANA University is a higher education University in Afghanistan. The University provides degrees in Information Technology, Software Engineering, Law\nRMIT University\nRMIT University is an Australian public research university in Melbourne, Victoria. Founded by Francis Ormond in 1887, RMIT began as a night school offering classes in art, science, and technology, in response to the industrial revolution in Australia.\nSamara State Technical University\nDescriptionSamara State Technical University - Is a higher educational institution in Samara, Russia.\nSari Mutiara University\nUniversitas Sari Mutiara Indonesia (Sari Mutiara Indonesia University) is a private higher education institution located in the ...\nSejong University is a private university located in Seoul, South Korea. The history of Sejong University dates to 1940 when a trust established the Kyung Sung Humanities Institute.\nSIAS International University\nSias University, transliterated Zhengzhou Sias College, and formerly known as Sias International University, is the first solely American-owned post-secondary school in Central China\nSichuan University\nSichuan University is a university in Chengdu, the capital of Sichuan Province, China. It has a long history and many predecessors, of which the earliest one was founded in 1740 with the origin in BCE 141.\nSouthwest Jiaotong University\nSouthwest Jiaotong University is located in national central city Chengdu, Sichuan Province, affiliated to the Ministry of Education of the People's Republic of China.\nTabesh University\nTabesh was established in 2009, i.e. 1388. As a young and growing University with its license from Afghanistan Ministry of Higher Education. It is located in Lab-e-Jar square of Kabul City.\nTAI Madrid School of the Arts, accredited by the Rey Juan Carlos University, is located in the heart of Madrid's historic and art district. It is the only center in Spain ...\n"
    }
  }
}