{
  "source_file": "www.galgotiasuniversity.edu.in_Best_Management_Colleges_in_Noida_Delhi_NCR_raw_2025-08-10-18-45-12.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text lists various services, initiatives, and programs offered or highlighted by an institution, including a Covid-19 Counselling Cell, admission and education loan assistance, ARIIA-2021, tender and vendor registration, Viksit Bharat@2047, IQAC, DPBH 2023, Galgotias University Vision 2030, Galgotias News Network, fees payment, and SIH -2023 and 2024.",
      "raw_content": "• Covid-19 Counselling Cell\n• Admission & Education Loan Assistance\n• ARIIA-2021\n• Tender & Vendor Registration\n• Viksit Bharat@2047: Voice of Youth\n• Internal Quality Assurance Cell (IQAC)\n• DPBH 2023\n• Galgotias University Vision 2030\n• Galgotias News Network (GNN)\n• Fees Payment\n• SIH -2023 and 2024"
    },
    "research": {
      "summary": "This document outlines key aspects of research and global engagement at an institution, likely Galgotias University. It lists various departments, initiatives, and achievements related to research, including a Research & Development Cell, interdisciplinary research centers, publication summaries, organized events, recognition like DSIR-SIRO, and engagement with Nobel laureates and honorary professors. The content emphasizes a commitment to research excellence and global outreach.",
      "raw_content": "• Research Message from Dean (Research)\nResearch Excellence and Global Engagement\nResearch & Development Cell\nGalgotias Centre for Interdisciplinary Research\nResearch Ethics Application Department wise Publication Summary Research Group Organized Events International & National Events International FDPs Research Awards Scopus Citation WoS Citation Newsletter Session with Noble Laureates DSIR - SIRO Recognition Centres of Excellence Media Outreach Research Group Diversity Open House Project for Students Honorary Professors Best Practices G-MRDC Centre of Excellence for Semiconductor Research\n• Message from Dean (Research)\n• Research Excellence and Global Engagement\n• Research & Development Cell\n• Galgotias Centre for Interdisciplinary Research\n• Department wise Publication Summary\n• Research Group Organized Events\n• International & National Events\n• Session with Noble Laureates\n• DSIR - SIRO Recognition\n• Research Group Diversity\n• Open House Project for Students\n• Honorary Professors\n• Centre of Excellence for Semiconductor Research\n"
    },
    "academics": {
      "summary": "This text outlines various academic-related sections, including the academic calendar, learning models like the Choice Based Credit System, curriculum development, the National Education Policy (NEP-2020), examination procedures, available forms, awards, and a holiday list.",
      "raw_content": "• Academics Academics Academic Calendar Learning Model & Choice Based Credit System MOUs Curriculum Design and Development Examination Cell NEP-2020 Download Forms Awards Holiday List Achievements\n• Learning Model & Choice Based Credit System\n• Curriculum Design and Development\n• NEP-2020"
    },
    "placements": {
      "summary": "This text outlines various aspects of a placement and career development division, including their services like career planning, associated recruiters, placement records, employability enhancement programs, and placement policies. It also highlights student and recruiter feedback, top performers, and a placement gallery.",
      "raw_content": "• Placements Latest Placements Career Planning and Development Division (CPDD) Associated Recruiters Corporate Tie Ups Placement Records Employability Enhancement Program Placement Policy Placement Brochure Recruiters Speak Students Speak Highest Performers Placement Gallery\n• Career Planning and Development Division (CPDD)\n• Associated Recruiters\n• Recruiters Speak\n• Highest Performers"
    },
    "accreditation": {
      "summary": "This text outlines Galgotias University's commitment to fostering strong relationships with apex and accreditation bodies to provide students with advanced opportunities in research, innovation, and experiential learning. It lists several key organizations with which the university partners or is accredited by, including the National Council for Teacher Education, Pharmacy Council of India, NAAC (A+ accreditation), NBA (for specific programs), and UGC, among others.",
      "raw_content": "Apex and Accreditation Bodies\nCultivating formidable partnerships with Apex and Accreditation Bodies to empower students with cutting-edge opportunities in research, innovation, and experiential learning excellence\nNational Council for Teacher Education.\nPharmacy Council of India\nThe Indian Association of Physiotherapists\nAssociation of Indian Universities\nGalgotias University accredited by NAAC with the A+\nPrograms are accredited by NBA (CSE, ECE, ME, MBA and B.Pharm)\nAssociation to Advance Collegiate Schools of Business\nUniversity Grants Commission\nAll India Council for Technical Education\nThe Bar Council of India\nIndian Nursing Council"
    },
    "student_life": {
      "summary": "The university offers a vibrant student life with a student council and various groups for connection and growth. It fosters innovation and entrepreneurship through one of India's largest incubation centers, supporting over 100 start-ups. Students can also explore cutting-edge technology in state-of-the-art labs and engage in diverse extracurricular activities and sports, with world-class facilities available to help them reach their full potential.",
      "raw_content": "Student Council & Groups\nBe Part of a Vibrant Community: Our student council and groups offer opportunities to connect, learn, and grow outside of the classroom. Discover how you can get involved today.\nBuilding the Next Big Thing: With 100+ Start-ups, Our incubation center is one of the India’s largest where innovation and entrepreneurship thrive. Join us in creating the future of business, technology, and social impact.\nExplore the Future of Tech: Our tech laboratories offer state-of-the-art equipment and expert faculty to guide you in exploring the latest advancements in tech. Start your journey today.\nUnleash your potential with world-class sports facilities and diverse extracurricular programs at our leading university.\nEmbrace the Opportunities of Our Dynamic Sports and Extracurricular Scene\nTake your Game to the Next Level with our Top-Notch Sports Infrastructure"
    },
    "document_links": {
      "summary": "This document contains a list of links or references to various institutional materials, including a GU Vision Plan for 2030, the Annual Report for 2022-23, an option to \"Chat with an Ambassador,\" copyright information for Galgotias University in 2025, and attribution for design and development to City Innovates. The source of this information is indicated to be the Galgotias University website, specifically the School of Business section.",
      "raw_content": "• GU Vision Plan_2030 21-01-2024\n• Annual Report-2022-23\n• Chat with an Ambassadors\n• © 2025 Copyrights Galgotias. All rights reserved.\n• Designed, developed & maintained By : City Innovates\nSource: https://www.galgotiasuniversity.edu.in/p/schools/school-of-business"
    }
  }
}