{
  "source_file": "www.galgotiasuniversity.edu.in_School_of_Aviation_Logistics_Tourism_Management_raw_2025-08-10-18-45-12.txt",
  "structured_data": {
    "general_info": {
      "summary": "This document lists various sections and offerings of Galgotias University, primarily focusing on its international student programs, campus life, academic schools, administrative functions, and key initiatives. It highlights admissions, student support services, extracurricular activities, grievance redressal mechanisms, and the university's vision and achievements.",
      "raw_content": "• India Today Media Institute\n• International Admissions About International Office Clubs for International Students International student programs Foundation and Bridge Courses for International Students Message from Director International Relations Programmes and Fees Scholarships Eligibility Admission Process Preparatory English Foundation Program Pre & Post Arrival Information for International Students International Students Grievances Wing Visa and FRRO Support International Apply Now Contact Us FAQs Download Brochure Testimonials Events Study in India\n• Clubs for International Students\n• Foundation and Bridge Courses for International Students\n• Message from Director International Relations\n• Preparatory English Foundation Program\n• Pre & Post Arrival Information for International Students\n• International Students Grievances Wing\n• Visa and FRRO Support\n• Login Employee Login Student Login LMS Login\n• Campus Life About the Campus Student Organization Societies & Clubs Hostel Library Transportation Services National Cadet Corps (NCC) National Service Scheme (NSS) Sports & Recreation Cafeteria Healthcare Facilities Unifest Events, Arts & Culture Resources & Facilities Convocation Smart India Hackathon 2022 Toycathon Launchpad\n• National Cadet Corps (NCC)\n• National Service Scheme (NSS)\n• Events, Arts & Culture\n• Smart India Hackathon 2022\n• Online Complaints Prevention of caste based discrimination at workplace committee Students Online portal for Redressal of Grievances Employee Online portal for Redressal of Grievances Anti-ragging Policy Complaint Committee for Prevention of Sexual Harassment\n• Prevention of caste based discrimination at workplace committee\n• Students Online portal for Redressal of Grievances\n• Employee Online portal for Redressal of Grievances\n• Complaint Committee for Prevention of Sexual Harassment\n• About GU About Us Galgotias University Our Legacy The Galgotias Story Leadership Governance International Academic Team Awards, Rankings & Certifications Accreditations Mandatory Disclosures Policies & Regulations Partnerships & Collaborations iOS Development Center Virtual tour\n• Galgotias University\n• Leadership\n• Awards, Rankings & Certifications\n• Partnerships & Collaborations\n• School of Finance and Commerce\n• School of Liberal Education\n• School of Medical and Allied Sciences\n• School of Nursing\n• School of Allied Health Sciences\n• School of Basic Sciences\n• School of Media & Communication Studies\n• School of Design\n• School of Biosciences and Technology\n• School of Vocational Education\n• School of Life Long Learning\n• Covid-19 Counselling Cell\n• Admission & Education Loan Assistance\n• ARIIA-2021\n• Tender & Vendor Registration\n• Viksit Bharat@2047: Voice of Youth\n• Internal Quality Assurance Cell (IQAC)\n• DPBH 2023\n• Galgotias University Vision 2030\n• Galgotias News Network (GNN)\n• Fees Payment\n• SIH -2023 and 2024\n• UGC PUBLIC SELF PORTAL\n• GU Vision Plan_2030 21-01-2024\n• Annual Report-2022-23\n• Chat with an Ambassadors\n• © 2025 Copyrights Galgotias. All rights reserved.\n• Designed, developed & maintained By : City Innovates"
    },
    "research": {
      "summary": "This document outlines various research-related activities and initiatives, likely from an academic institution. It highlights areas such as research excellence, global engagement, specific research centers like the Galgotias Centre for Interdisciplinary Research, and units like the Research & Development Cell. The text also lists various events, recognitions (like DSIR - SIRO Recognition), publications, awards, and engagement opportunities such as sessions with Nobel Laureates and projects for students. Key themes include interdisciplinary research, international collaborations, and fostering research best practices.",
      "raw_content": "• Research Message from Dean (Research)\nResearch Excellence and Global Engagement\nResearch & Development Cell\nGalgotias Centre for Interdisciplinary Research\nResearch Ethics Application Department wise Publication Summary Research Group Organized Events International & National Events International FDPs Research Awards Scopus Citation WoS Citation Newsletter Session with Noble Laureates DSIR - SIRO Recognition Centres of Excellence Media Outreach Research Group Diversity Open House Project for Students Honorary Professors Best Practices G-MRDC Centre of Excellence for Semiconductor Research\n• Message from Dean (Research)\n• Research Excellence and Global Engagement\n• Research & Development Cell\n• Galgotias Centre for Interdisciplinary Research\n• Department wise Publication Summary\n• Research Group Organized Events\n• International & National Events\n• Session with Noble Laureates\n• DSIR - SIRO Recognition\n• Research Group Diversity\n• Open House Project for Students\n• Honorary Professors\n• Centre of Excellence for Semiconductor Research\n"
    },
    "academics": {
      "summary": "This text appears to be a navigation or menu structure for an academic institution's website or portal. It highlights key sections such as the Academic Calendar, Learning Model, Curriculum Design, Examination Cell, NEP-2020 implementation, downloadable forms, awards, and achievements.",
      "raw_content": "• Academics Academics Academic Calendar Learning Model & Choice Based Credit System MOUs Curriculum Design and Development Examination Cell NEP-2020 Download Forms Awards Holiday List Achievements\n• Learning Model & Choice Based Credit System\n• Curriculum Design and Development\n• NEP-2020\n"
    },
    "placements": {
      "summary": "This text outlines key components and resources related to career planning and placements, including information about the Career Planning and Development Division (CPDD), associated recruiters, placement records, an employability enhancement program, placement policies and brochures, and testimonials from recruiters and students.",
      "raw_content": "• Placements Latest Placements Career Planning and Development Division (CPDD) Associated Recruiters Corporate Tie Ups Placement Records Employability Enhancement Program Placement Policy Placement Brochure Recruiters Speak Students Speak Highest Performers Placement Gallery\n• Career Planning and Development Division (CPDD)\n• Associated Recruiters\n• Recruiters Speak\n• Highest Performers"
    },
    "department_overview": {
      "summary": "Galgotias University's School of Aviation, Logistics, and Tourism Management is dedicated to preparing students for leadership roles in these vital global industries. Offering BBA and MBA programs, along with specialized certifications, the school emphasizes value-based education, research, and innovation to provide an industry-aligned, experiential learning environment that fosters critical skills, ethical thinking, and a global perspective.",
      "raw_content": "Enquire Now\nDepartment of Aviation, Logistics & Tourism Management\nCharting the Future of Global Industries\nWelcome to Galgotias University's pioneering School of Aviation, Logistics, and Tourism Management. In an era of unprecedented connectivity and economic transformation, these three dynamic sectors form the backbone of global commerce and human interaction. Our School is dedicated to nurturing a new generation of transformative leaders, innovators, and professionals who will drive growth, efficiency, and sustainability across these vital industries.\nBuilding upon Galgotias University's legacy of value-based education, research, and innovation, our School brings together a comprehensive suite of BBA and MBA programs alongside specialized short and long-term certification courses. We are committed to delivering an industry-aligned, experiential learning environment that equips our students with the critical skills, ethical mindset, and global perspective needed to excel and make a lasting impact."
    },
    "accreditations_and_partnerships": {
      "summary": "This document outlines Galgotias University's commitment to fostering strong relationships with apex and accreditation bodies to provide students with advanced opportunities in research, innovation, and experiential learning. It lists various prestigious organizations with which the university collaborates or has received accreditation, including the National Council for Teacher Education, Pharmacy Council of India, The Indian Association of Physiotherapists, Association of Indian Universities, NAAC (with A+ accreditation), NBA, Association to Advance Collegiate Schools of Business, University Grants Commission, All India Council for Technical Education, The Bar Council of India, and Indian Nursing Council.",
      "raw_content": "Apex and Accreditation Bodies\nCultivating formidable partnerships with Apex and Accreditation Bodies to empower students with cutting-edge opportunities in research, innovation, and experiential learning excellence\nNational Council for Teacher Education.\nPharmacy Council of India\nThe Indian Association of Physiotherapists\nAssociation of Indian Universities\nGalgotias University accredited by NAAC with the A+\nPrograms are accredited by NBA (CSE, ECE, ME, MBA and B.Pharm)\nAssociation to Advance Collegiate Schools of Business\nUniversity Grants Commission\nAll India Council for Technical Education\nThe Bar Council of India\nIndian Nursing Council\n"
    },
    "student_life": {
      "summary": "This text highlights the vibrant student life and opportunities available at a university, including involvement in student councils and groups, a large incubation center fostering over 100 startups, advanced tech laboratories, and top-tier sports facilities and diverse extracurricular programs designed to help students learn, grow, and unleash their potential.",
      "raw_content": "Student Council & Groups\nBe Part of a Vibrant Community: Our student council and groups offer opportunities to connect, learn, and grow outside of the classroom. Discover how you can get involved today.\nBuilding the Next Big Thing: With 100+ Start-ups, Our incubation center is one of the India’s largest where innovation and entrepreneurship thrive. Join us in creating the future of business, technology, and social impact.\nExplore the Future of Tech: Our tech laboratories offer state-of-the-art equipment and expert faculty to guide you in exploring the latest advancements in tech. Start your journey today.\nUnleash your potential with world-class sports facilities and diverse extracurricular programs at our leading university.\nEmbrace the Opportunities of Our Dynamic Sports and Extracurricular Scene\nTake your Game to the Next Level with our Top-Notch Sports Infrastructure"
    },
    "additional_schools": {
      "summary": "The provided text lists a comprehensive range of academic schools within an institution, covering diverse fields such as defense technology, computer science and engineering, artificial intelligence, aviation, business, law, finance, liberal arts, medical and allied sciences, nursing, basic sciences, media, design, biosciences, and vocational education, along with lifelong learning initiatives.",
      "raw_content": "• School of Defence Technology\n• School of Computer Science & Engineering\n• School of Artificial Intelligence\n• School of Aviation, Logistics & Tourism Management\n• School of Computer Applications & Technology\n• School of Engineering\n• School of Business\n• School of Law\n• School of Finance and Commerce\n• School of Liberal Education\n• School of Medical and Allied Sciences\n• School of Nursing\n• School of Allied Health Sciences\n• School of Basic Sciences\n• School of Media & Communication Studies\n• School of Design\n• School of Biosciences and Technology\n• School of Vocational Education\n• School of Life Long Learning"
    },
    "other_services": {
      "summary": "This text lists various aspects of university or college admissions and student services. It covers accommodation options like hostels, the process for lateral entry or migration, details on financial aid and loans, required admission documents, approvals and accreditations, transportation services, PhD admissions, the refund policy, and contact information through an admission helpline. A brochure download is also mentioned.",
      "raw_content": "• Hostels\n• Lateral Entry/Migration\n• Admission Financial Aid & Loan Facilities\n• Admission Documents & Undertaking Approvals & Accreditations Transportation Services Ph.D Admission Refund Policy Download Brochure Admission Helpline\n"
    },
    "source_information": {
      "summary": "This is a link to the School of Aviation, Logistics, and Tourism Management at Galgotias University, India.",
      "raw_content": "Source: https://www.galgotiasuniversity.edu.in/p/schools/school-of-aviation-logistics--tourism-management"
    }
  }
}