{
  "source_file": "www.galgotiasuniversity.edu.in_Best_B_Tech_Mechanical_Engineering_Colleges_in_Noida_India_Galgotias_Universi_raw_2025-08-10-18-45-12.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text lists various sections and offerings of the India Today Media Institute and Galgotias University. It covers international student information, campus life, administrative and grievance redressal mechanisms, university details, various schools and their programs, and specific initiatives like Smart India Hackathon and Viksit Bharat@2047, alongside copyright information.",
      "raw_content": "• India Today Media Institute\n• International Admissions About International Office Clubs for International Students International student programs Foundation and Bridge Courses for International Students Message from Director International Relations Programmes and Fees Scholarships Eligibility Admission Process Preparatory English Foundation Program Pre & Post Arrival Information for International Students International Students Grievances Wing Visa and FRRO Support International Apply Now Contact Us FAQs Download Brochure Testimonials Events Study in India\n• Clubs for International Students\n• Foundation and Bridge Courses for International Students\n• Message from Director International Relations\n• Programmes and Fees\n• Scholarships\n• Preparatory English Foundation Program\n• Pre & Post Arrival Information for International Students\n• International Students Grievances Wing\n• Visa and FRRO Support\n• Login Employee Login Student Login LMS Login\n• Campus Life About the Campus Student Organization Societies & Clubs Hostel Library Transportation Services National Cadet Corps (NCC) National Service Scheme (NSS) Sports & Recreation Cafeteria Healthcare Facilities Unifest Events, Arts & Culture Resources & Facilities Convocation Smart India Hackathon 2022 Toycathon Launchpad\n• National Cadet Corps (NCC)\n• National Service Scheme (NSS)\n• Events, Arts & Culture\n• Smart India Hackathon 2022\n• Online Complaints Prevention of caste based discrimination at workplace committee Students Online portal for Redressal of Grievances Employee Online portal for Redressal of Grievances Anti-ragging Policy Complaint Committee for Prevention of Sexual Harassment\n• Prevention of caste based discrimination at workplace committee\n• Students Online portal for Redressal of Grievances\n• Employee Online portal for Redressal of Grievances\n• Complaint Committee for Prevention of Sexual Harassment\n• About GU About Us Galgotias University Our Legacy The Galgotias Story Leadership Governance International Academic Team Awards, Rankings & Certifications Accreditations Mandatory Disclosures Policies & Regulations Partnerships & Collaborations iOS Development Center Virtual tour\n• Galgotias University\n• Leadership\n• Awards, Rankings & Certifications\n• Partnerships & Collaborations\n• Schools School of Defence Technology School of Computer Science & Engineering School of Artificial Intelligence School of Aviation, Logistics & Tourism Management School of Computer Applications & Technology School of Engineering School of Business School of Law View More\n• School of Defence Technology\nSchool of Defence Technology\n• School of Computer Science & Engineering\nSchool of Computer Science & Engineering\n• School of Artificial Intelligence\nSchool of Artificial Intelligence\n• School of Aviation, Logistics & Tourism Management\nSchool of Aviation, Logistics & Tourism Management\n• School of Computer Applications & Technology\nSchool of Computer Applications & Technology\n• Programs Under Graduate Programs Diploma Programs Post Graduate Programs Doctoral Programs Certificate Programs Programs for working professionals Online Courses\n• Programs for working professionals\nPrograms for working professionals\n• Online Courses\nOnline Courses\n• School of Finance and Commerce\n• School of Liberal Education\n• School of Medical and Allied Sciences\n• School of Nursing\n• School of Allied Health Sciences\n• School of Basic Sciences\n• School of Media & Communication Studies\n• School of Design\n• School of Biosciences and Technology\n• School of Vocational Education\n• School of Life Long Learning\n• Covid-19 Counselling Cell\n• Admission & Education Loan Assistance\n• ARIIA-2021\n• Tender & Vendor Registration\n• Viksit Bharat@2047: Voice of Youth\n• Internal Quality Assurance Cell (IQAC)\n• DPBH 2023\n• Galgotias University Vision 2030\n• Galgotias News Network (GNN)\n• Fees Payment\n• SIH -2023 and 2024\n• UGC PUBLIC SELF PORTAL\n• GU Vision Plan_2030 21-01-2024\n• Annual Report-2022-23\n• Chat with an Ambassadors\n• © 2025 Copyrights Galgotias. All rights reserved.\n• Designed, developed & maintained By : City Innovates"
    },
    "admission_requirements": {
      "academic_programs": [
        {
          "program_name": "Example Bachelor's Degree",
          "eligibility_criteria": [
            "High school diploma or equivalent.",
            "Minimum GPA of 3.0 on a 4.0 scale.",
            "Successful completion of [Specific prerequisite course] with a grade of B or higher."
          ],
          "required_documents": [
            "Completed online application form.",
            "Official high school transcripts.",
            "Letters of recommendation (2).",
            "Personal statement (500-750 words).",
            "Standardized test scores (SAT/ACT, if applicable).",
            "Proof of English proficiency (for international applicants)."
          ],
          "application_deadline": "YYYY-MM-DD"
        },
        {
          "program_name": "Example Master's Program",
          "eligibility_criteria": [
            "Bachelor's degree in a related field.",
            "Minimum GPA of 3.5 on a 4.0 scale.",
            "GRE scores (quantitative and verbal sections)."
          ],
          "required_documents": [
            "Completed online application form.",
            "Official undergraduate transcripts.",
            "Letters of recommendation (3) from academic or professional sources.",
            "Statement of purpose (750-1000 words).",
            "Resume or Curriculum Vitae (CV).",
            "Portfolio (for specific programs).",
            "Proof of English proficiency (for international applicants)."
          ],
          "application_deadline": "YYYY-MM-DD"
        }
      ]
    },
    "research_info": {
      "summary": "This document outlines key research initiatives and achievements, including a message from the Dean of Research, a focus on research excellence and global engagement, the establishment of an R&D cell and an interdisciplinary research center, departmental publication summaries, organized events (international and national), sessions with Nobel Laureates, DSIR-SIRO recognition, research group diversity, student projects, honorary professors, and a center of excellence for semiconductor research.",
      "raw_content": "• Research Message from Dean (Research)\nResearch Excellence and Global Engagement\nResearch & Development Cell\nGalgotias Centre for Interdisciplinary Research\nResearch Ethics Application Department wise Publication Summary Research Group Organized Events International & National Events International FDPs Research Awards Scopus Citation WoS Citation Newsletter Session with Noble Laureates DSIR - SIRO Recognition Centres of Excellence Media Outreach Research Group Diversity Open House Project for Students Honorary Professors Best Practices G-MRDC Centre of Excellence for Semiconductor Research\n• Message from Dean (Research)\n• Research Excellence and Global Engagement\n• Research & Development Cell\n• Galgotias Centre for Interdisciplinary Research\n• Department wise Publication Summary\n• Research Group Organized Events\n• International & National Events\n• Session with Noble Laureates\n• DSIR - SIRO Recognition\n• Research Group Diversity\n• Open House Project for Students\n• Honorary Professors\n• Centre of Excellence for Semiconductor Research"
    },
    "placements": {
      "summary": "The provided text outlines various aspects of career planning and placements, managed by the Career Planning and Development Division (CPDD). It lists key areas such as latest placements, career planning, associated recruiters, recruiter testimonials, student feedback, highest performers, and placement records, indicating a comprehensive approach to student employability and recruitment.",
      "raw_content": "• Placements Latest Placements Career Planning and Development Division (CPDD) Associated Recruiters Corporate Tie Ups Placement Records Employability Enhancement Program Placement Policy Placement Brochure Recruiters Speak Students Speak Highest Performers Placement Gallery\n• Career Planning and Development Division (CPDD)\n• Associated Recruiters\n• Recruiters Speak\n• Highest Performers"
    },
    "department_details": {
      "summary": "The Department of Mechanical Engineering at Galgotias University is dedicated to providing world-class engineering education and interdisciplinary research, fostering a student-centered environment with experienced faculty and state-of-the-art facilities. The department emphasizes hands-on learning, industry collaboration, and has a Centre of Excellence in Electric Vehicle technology, encouraging students to develop innovative solutions to real-world problems and prepare for lifelong learning.",
      "raw_content": "Department of Mechanical Engineering\nCentre of Excellence in Electric Vehicle\n115 + \n584 + \nPublications in Reputed Journals\n100 %\nInternship for UG/PG Students from Government/ PSU\n• Message from the Dean\n• Faculty Members\n• Lab facilities and Infrastructure\n• Industry Mentors\n• Training & Industry Visits\nMessage from the Dean\nDr. Sudhir Kumar Singh\nIt is my pleasure to welcome you to the Department of Mechanical Engineering at Galgotias University. Grounded in our commitment to world class engineering education and interdisciplinary research, we offer a rich educational experience that marries intellectual rigor and cross-disciplinary breadth in a student-centered environment.\nThe department boasts its faculty with many years of industrial experience, exemplary qualifications and accomplishments. Our faculties are engaged in cutting-edge research projects and build immersive & hands-on learning environments that stretch beyond traditional classroom models. Our students take advantage of these opportunities for collaborative learning and explore the engineering theories & principles, as well as propose fresh ideas for solving real-world problems. Students also benefit from innovative curricula and a teamwork approach of the department facilitating project-based learning.\nStudents have access to state-of-the-art, well-equipped facilities along with hands-on engineering experience. Co-operative education is an integral part of our curricula. Faculty and corporate partners help students to take advantage of the opportunities through many companies and available projects.\nThe faculty of Mechanical Engineering have maintained its long-standing reputation for academic and research, both nationally and internationally. Committed to excellent teaching and innovation, the faculty inspire students to translate the knowledge acquired to get real-life solutions.\nThe School of Engineering (SOE) provides an environment that encourages holistic development and helps them transform into lifelong learners with the ability to thrive in an ever-changing world. Our programs equip students with the knowledge and required skills to excel in their chosen field. We emphasize on integrated classroom learning, internships, and experiential projects, ensuring that our students are well-prepared to adapt to challenges and opportunities in their careers. We are committed to employing pedagogical methods that promote inclusivity and diversity.\nStudents have an option to choose specialization courses in our undergraduate programs. The specialization courses are designed to develop skills with respect to current trends and Industry requirements.\nOur faculty comes from reputed institutes in India and abroad with post-doctoral experience from some of the best Universities abroad. SOE regularly hosts national level events such as Smart India Hackathon, Toycathon, Go- Kart India Karting race, AMD AI challenge and NASA app challenge, showcasing our commitment to innovation and cutting-edge research.\nOur faculty pursue impactful research with an interdisciplinary focus to address the complex societal challenges. This spirit of inquiry and exploration translates directly into the classroom, enriching our students' learning experiences and preparing them to be ethical problem solvers.\nSOE has a Centre of Excellence (COE) in Electric Vehicle that fosters interdisciplinary, cutting-edge research towards developing Electric Vehicle Technology and industry sponsored labs.\nWe welcome you to be part of the SOE family as a prospective student, current student, an alumnus, academic partner, or industry collaborator. I encourage you to visit the webpages of individual departments to learn more about the impressive work of our faculty, students, and alumni."
    },
    "school_listing": {
      "summary": "The provided text lists various schools within an institution, covering diverse disciplines such as finance, liberal arts, medical sciences, nursing, allied health, basic sciences, media and communication, design, biosciences and technology, vocational education, and lifelong learning.",
      "raw_content": "• School of Finance and Commerce\n• School of Liberal Education\n• School of Medical and Allied Sciences\n• School of Nursing\n• School of Allied Health Sciences\n• School of Basic Sciences\n• School of Media & Communication Studies\n• School of Design\n• School of Biosciences and Technology\n• School of Vocational Education\n• School of Life Long Learning"
    },
    "financial_aid": {
      "summary": "This text refers to financial aid and loan facilities, indicating a context related to funding or financial assistance, likely in an educational or economic setting.",
      "raw_content": "Financial Aid & Loan Facilities"
    },
    "admission_process": {
      "summary": "This document pertains to admission documents and includes an undertaking.",
      "raw_content": "Admission Documents & Undertaking"
    },
    "other_services": {
      "summary": "This text lists various services and information points related to an educational institution, including transportation services, Ph.D. admissions, the refund policy, brochure downloads, and an admission helpline.",
      "raw_content": "Transportation Services\nPh.D Admission\nRefund Policy\nDownload Brochure\nAdmission Helpline"
    }
  }
}