{
  "source_file": "www.sharda.ac.in_MDS_Periodontology_Course-_Fees_Eligibility_Syllabus_Admission_raw_2025-08-10-18-29-16.txt",
  "structured_data": {
    "general_info": {
      "summary": "This document outlines various aspects of Sharda University, including its academic programs and schools (Dental Sciences, Medical Sciences & Research, Nursing Science & Research), administrative reports (Examination Annual Report, Academic Bank of Credits), student-focused initiatives (Curricula Feedback, University Brochure, Global Knowledge Seekers, Our Recruiters, Career Counseling, Skill Enhancement), and university governance (Leadership, History, Statutory Bodies, Tenders, Act, Statutes and Ordinances). It also details specific services and activities like Banking and Postal Services, COVID-19 information, Family & Couple Counselling, Language and Communication Skills, Soft Skills, Technology Trends awareness, Entrepreneurship, FM Radio, a Mentoring Portal, and information on international campuses and special courses.",
      "raw_content": "• Programme 2025-26\n• School of Dental Sciences\nSchool of Medical Sciences & Research\nSharda School of Nursing Science & Research\n• School of Medical Sciences & Research\n• Sharda School of Nursing Science & Research\nExamination Annual Report\nAcademic Bank of Credits (ABC)\nCurricula Feedback\nUniversity Brochure\n• Examination Annual Report\n• Academic Bank of Credits (ABC)\n• Curricula Feedback\n• University Brochure\nGlobal Knowledge Seekers\n• Global Knowledge Seekers\nOur Recruiters\n• Our Recruiters\nBanking And Postal Services\n• Banking And Postal Services\nPerspective Plan\nLeadership\nHistory\nStatutory Bodies of the University\nSharda Tenders\nAct, Statutes and Ordinances\nCOVID19\nFamily & Couple Counselling Services(FCCS)\nCapacity Development & Skill Enhancement\nLanguage and Communication Skill Initiatives: Sharda Skills\nSoft Skill Initiatives : Career Counseling and Development Center\nAwareness of Trends in Technology : IIC\nEntrepreneurship\nInnovation and Entrepreneurship\n• Get to know sharda\n• Perspective Plan\n• Leadership\n• History\n• Statutory Bodies of the University\n• Sharda Tenders\n• Act, Statutes and Ordinances\n• COVID19\n• Family & Couple Counselling Services(FCCS)\n• Capacity Development & Skill Enhancement\n• Language and Communication Skill Initiatives: Sharda Skills\n• Soft Skill Initiatives : Career Counseling and Development Center\n• Awareness of Trends in Technology : IIC\n• Entrepreneurship\n• Innovation and Entrepreneurship\nFM Radio: Suno Sharda-90.8FM\n• FM Radio: Suno Sharda-90.8FM\nParamarsh- Our Mentoring Portal\n• Paramarsh- Our Mentoring Portal\n• Covid 19 Updates\n• Sharda University Uzbekistan\n• Sharda University Agra\n• Courses on Human Values and Professional ethics\n• National Cyber Crime Reporting Portal\n• International Credit Transfer Programme"
    },
    "career_path": {
      "summary": "This text outlines the diverse career paths available after completing a course in Periodontology and Oral Implantology. Graduates can pursue academic careers in dental institutes, work as consultant periodontists in hospitals and clinics, or establish their own private practice.  Further opportunities include government positions in health departments, research roles with organizations like ICMR, employment in public sector undertakings and the Indian Army, international relocation after equivalent examinations, specialization in oral implantology, and the pursuit of a Ph.D.",
      "raw_content": "Career path you can choose after the course\n• Can work as an Academician with provision of teaching Jobs in various dental Institutes across India in the department of Periodontology and Oral Implantology.\n• Opportunity to work as a Consultant Periodontist at Dental Hospitals and other Dental Clinics for specialized Perio cases.\n• To become an entrepreneur to establish a clinic. Government jobs in department of health and family welfare and to carry out research work.\n• Jobs in public sector undertaking (PSU) and Jobs in Indian Army Corps.\n• Opportunity to relocate in Foreign Countries after passing equivalent examination\n• Opportunity to practice specialized Oral Implantology.\n• To be able to persue Ph.D conduct various research acitivities in collaborations with organizations like ICMR."
    },
    "visa_guidelines": {
      "summary": "This document outlines guidelines related to visas and FRO/FRRO, as well as guidelines concerning medical insurance. The content appears to be a simple list or header indicating the availability of these guidelines.",
      "raw_content": "Guidelines for Visa and FRO/FRRO\nGuidelines for Medical Insurance\n• Guidelines for Visa and FRO/FRRO\n• Guidelines for Medical Insurance"
    },
    "observership_programmes": {
      "summary": "This text appears to be a heading or title related to \"Observership Programmes,\" possibly indicating a section or category dedicated to such programs.",
      "raw_content": "Observership Programmes\n• Observership Programmes"
    }
  }
}