{
  "source_file": "www.sharda.ac.in_Student_Testimonial_-_Sharda_University_raw_2025-08-10-18-29-11.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text provides a comprehensive overview of Sharda University, covering its various academic programs, schools, fee structures, scholarships, and student support services. It highlights the university's commitment to student development through initiatives like career counseling, skill enhancement programs, and a strong emphasis on faculty mentorship. The majority of the content consists of student testimonials, detailing positive experiences with faculty, the placement process, and the overall learning environment, with many students expressing gratitude for the opportunities provided and the personal and professional growth they achieved during their time at Sharda.",
      "raw_content": "• Programme 2025-26\n• School of Dental Sciences\nSchool of Medical Sciences & Research\nSharda School of Nursing Science & Research\n• School of Medical Sciences & Research\n• Sharda School of Nursing Science & Research\nExamination Annual Report\nAcademic Bank of Credits (ABC)\nCurricula Feedback\nUniversity Brochure\n• Examination Annual Report\n• Academic Bank of Credits (ABC)\n• Curricula Feedback\n• University Brochure\nProgramme Fee\nHostel Fee\nTransportation Fee\nScholarship\nInnovative Idea Scholarship\n• Programme Fee\n• Hostel Fee\n• Transportation Fee\n• Scholarship\n• Innovative Idea Scholarship\n• Fee Structure for Previous Year Students\n• SUAT 2025\nSample Papers\n• Sample Papers\nGlobal Knowledge Seekers\n• Global Knowledge Seekers\nOur Recruiters\n• Our Recruiters\nBanking And Postal Services\n• Banking And Postal Services\nPerspective Plan\nLeadership\nHistory\nStatutory Bodies of the University\nSharda Tenders\nAct, Statutes and Ordinances\nCOVID19\nFamily & Couple Counselling Services(FCCS)\nCapacity Development & Skill Enhancement\nLanguage and Communication Skill Initiatives: Sharda Skills\nSoft Skill Initiatives : Career Counseling and Development Center\nAwareness of Trends in Technology : IIC\nEntrepreneurship\nInnovation and Entrepreneurship\n• Get to know sharda\n• Perspective Plan\n• Leadership\n• History\n• Statutory Bodies of the University\n• Sharda Tenders\n• Act, Statutes and Ordinances\n• COVID19\n• Family & Couple Counselling Services(FCCS)\n• Capacity Development & Skill Enhancement\n• Language and Communication Skill Initiatives: Sharda Skills\n• Soft Skill Initiatives : Career Counseling and Development Center\n• Awareness of Trends in Technology : IIC\n• Entrepreneurship\n• Innovation and Entrepreneurship\nFM Radio: Suno Sharda-90.8FM\n• FM Radio: Suno Sharda-90.8FM\nAccommodation Fee\nGuidelines for Visa and FRO/FRRO\nGuidelines for Medical Insurance\nObservership Programmes\n• Accommodation Fee\n• Guidelines for Visa and FRO/FRRO\n• Guidelines for Medical Insurance\n• Observership Programmes\nParamarsh- Our Mentoring Portal\n• Paramarsh- Our Mentoring Portal\nIn my experience all the teachers are very supportive and friendly and the placement process has been very smooth throughout. I would always be very grateful for the lifelong connections I made\nMBA – Business Analytics, 2022-23\nPlaced In : EY Global Delivery Services\n\"My experience at Sharda University is great and memorable. The mentors at Sharda University helped us enhance my academic and interpersonal skills. I am thankful to Training & Placement cell for providing a platform to enhance my skills and an opportunity to showcase them. In the last I am saying that The World is here at Sharda University.\"\nB.Tech (CSE) , 2017-2021\n“It was a great experience studying at Sharda University, a memory to cherish for lifetime. My experience at Sharda was full of learning and grooming. Being a global university It gave me an opportunity to meet different kind of people from around the world and learnt many things from them. I am thankful to all the faculties, mentors and entire SET department for providing us with quality education. I am also grateful to TNP Cell for organising placements in this pandemic and helping me to get placed in 3 companies on Campus including Tcs Digital. Overall it was a great experience and lifetime memory at Sharda University. If you want to make a career in CSE I would highly recommend you to join Sharda University.”\nB.Tech. (CSE) , 2017-2021\nPlaced In : TCS Digital\nIt was my immense luck and fortune to be the part of Sharda University where I can grow. The entire faculty and department leaves no stone unturned to shape one\\'s future. My four years at Sharda have been a wonderful experience of learning with prolific exposure to outside. Huge respect, love and devotion for entire faculty members and department. It\\'s their efforts that make me to count myself into better professionals.\nB.Tech - Mechanical Engineering, 2019-2020\nPlaced In : Dorset Industries Pvt. Ltd\nSharda University has been a great contributor to the development of my personality. I have established my leadership, time management and team skills and have also been able to advance these skills to the whole new augment level. The infrastructure of Sharda University is one of the finest in the NCR region is what stands out the most. The best thing about this University is the cross-culture interaction between students from various parts of the world. The professors here make the university what it is today. With an attitude of being ever ready to help, and not only delivering classroom teachings, but they are also the pillars of the learning gained from this esteemed university and this is a treasure for life.\nMy four years at Sharda were great and a memory to cherish for lifetime. It was full of learning and grooming oneself. It gave me an opportunity to meet different kind of people and learned many things. I am thankful to all the faculties, mentors and entire SET as well as placement cell. Overall it was a great experience and lifetime memory at Sharda.\nB.Tech - Computer Science, 2019-2020\nPlaced In : NTT Data\nHarsh Pratap Singh\nGreat experience from Sharda. You get a lot of opportunities. Work hard to get it. Be prepared for everything. Maintain your attendance.\nPlaced In : Think & Learn (BYJUs)\nB.Tech - Computer Science (Cloud Computing And Information Security), 2019-2020\nPlaced In : Tech Mahindra\nSharda University is a place where you can find an amalgamation of learning. I feel great studying at Sharda University as it gives great opportunity as well as support from faculties and placement officers. Getting placed in Wipro is an achievement for me for which i would like to thank Sharda university.\nPlaced In : Wipro Technologies\nSharda University is great place to learn.It gives me great to say with pride that i have completed my B.tech in cse from this University.The relationship between faculities and student is very cordial, which gave me an opportunity to excel in my area of interest. The T and P cell is very supportive and they have conducted various sessions which helped me to get placed.\nPlaced In : Daffodil Software\nSharda University and SET faculties have put in all the efforts to groom us and make us corporate professionals. It was a wonderful experience at Sharda University.\nB-Tech- Computer Science(Cloud Computing And Information Security), 2019-2020\nHarshita Sachdeva\nMy bachelor degree at Sharda in computer science consisted of many projects based evaluation and faculty connect. The mentors at Sharda University helped us enhance my academic and interpersonal skills. The regular interaction with the Placement team also encouraged me to excel in my interview and developing skills that are required for future use.\nB.Tech : Computer Science(Cloud Computing And Information Security), 2019-2020\nMy experience at Sharda University is great and memorable. The teachers and mentors are really helpful and helped me to improve my academic and interpersonal skills.\nB.Tech- Computer Science(Cloud Computing And Information Security)\nMy bachelor\\'s degree at Sharda in computer science consisted of many projects based evaluation and faculty connect. The mentors at Sharda University helped us enhance my academic and interpersonal skills. The regular interaction with the Placement team also encouraged me to excel in my interview and developing skills that are required for future use.\nMy bachelor degree at Sharda in computer science consisted of many project based evaluation and faculty connect. The mentors at Sharda helped us enhance my academic and interpersonal skills.\nSharda University has always believed in helping and guiding its students and it was no different during the placement season. Regular classes held at our college to help us with our aptitude and technical skills were of great help. Our placement administration officers also guided and encouraged us at each step thereby helping me secure my placement at such a reputed company\nB. Tech - CSE, 2018-19\nMy four years at Sharda University have been excellent and a memory to cherish for a lifetime. The years spent here have been full of learning opportunities that were full of fun and frolic and sometimes with academic grind that one has to go through. The international exposure makes you a better man to face the challenges of the corporate world.\nB.Tech CSE, 2017-18\nPlaced In : Bhushan Power & Steels Ltd\nI really like the placement process of our university, everyone is working really hard for all students so that they could get easily placed in best companies, I was really lucky that I got placed in our first ever placement drive at VVDN Technologies.\nPlaced In : VVDN Technologies\nSharda University is a place of learning, fun, culture, culture, lore, literature and many such life preaching activities. Studying at the Sharda University brought an added value to my life. It gave me an opportunity to meet different kind of people and learn a number of things. I have received a great support from faculties & placement office. I am thankful to Training & Placement cell for providing a platform to enhance my skills and an opportunity to showcase them.\nPlaced In : Alight Solutions (formerly Aon ...\nAditi Semwal\nDue to the efforts made by the faculty and placement cell at Sharda University i was able to bag a job in the second company that i applied for. They always provided me with the assistance that i required for my overall development and to improve my technical knowledge. I will always be grateful to them for providing me a platform of practical learning and preparing me for the corporate life.\nPlaced In : Liquid Hub Analytics\nI thank Sharda University & SET faculties for putting in all the efforts to groom us and make us corporate professionals. It was a wonderful experience at Sharda University.\nPlaced In : Xavient Information Systems. ...\nI would like to appreciate the placement cell at Sharda for the efforts they made for providing a fair and ample amount of chances to us students. The faculty members worked so hard on our overall development and conducted boot-camps and extra classes for us to enhance our technical and interpersonal skills. I loved my time here at Sharda.\nMy life at Sharda university made me stronger and took me a step ahead for being an independent women. I am thankful to all the teachers who supported us and corrected us throughout our bachelors. I loved the infrastructure of Sharda University and its International life. The events that I took part helped me to grow my confidence level. I would like to specially thank the placement cell for guiding me and providing me a good platform (company) for my career.\nPlaced In : Think & Learn Pvt. Ltd. - Packa...\nI am grateful to Sharda University - both the faculty and the Training & Placement Department. They\\'ve made efforts ensuring maximum number of placed students. The university started grooming us for placements in the first few months including courses such as Professional Excellence Program and Professional Skills Enhancement. I was completely confident and cracked the aptitude and technical tests and interview rounds due to the mock tests and interviews conducted by the Training & Placement Department and our faculty members. Sharda University provides a great platform for skills enhancement and to get a great learning experience.\nB.Tech-IT\nPlaced In : Cognizant and Tech Mahindra\nSharda university has always believed in helping and guiding its students and it was no different during the placement season. Regular classes held at our college to help us with our aptitude and technical skills were of great help. Our placement administration officers also guided and encouraged us at each step thereby helping me secure my placement at such a reputed company.\nPlaced In : NTT Data and HCL Comnet\nSharda University, The World is Here Where Are You. I used to watch the advertisement of this university. When I chose Sharda for fashion designing i was excited to be in the environment. I came here in 2013 and now I will be graduate from here. The journey was awesome, The faculty members of design department of Sharda university are helpful and cooperative. They always help me in my problems. DESIGN DEPRTMENT fest Aakar also gives the opportunity to students to showcase their talent. Faculties are from industries and they give us right exposure to industries as well. I got the chance to live in the global environment, Students from different culture and countries. I spent my four years in this university and these years are unforgettable.\nB. Design- Fashion Designing\nPlaced In : Rainbow Fab Art, Noida\nGetting placed in a top IT company has always been my goal and Sharda University helped me realize this dream of mine. Thanks to the Department of Corporate Affairs without whose help this would not have been possible. Lastly I would like to say that the environment, the infrastructure and the syllabi provided by Sharda University has been excellent, by giving presentations and projects they have not just improved my domain knowledge but also my confidence and communication skills, which are very important skills required for a successful professional career.\nB.Tech. (CSE)\nPlaced In : Tech Mahindra and Cognizant\nI believe that there exist determination and moral support to achieve an initial step of something best in life. The former part is within ourselves and for the latter there are the people who provide us with utmost help for which, I would like to thank the Training & Placement Department, Sharda University. The culture, values and the morale that the university provided for complete development of my work life balance are undeniable.\nB.Tech-Mechanical\nPlaced In : Asahi India Glass Limited\nHere I came as a school boy and now graduating as a corporate man. Here, I not only developed my academic skills but also got a global exposure in every field be it sports or others. At last I would like to thank all the faculty members for being supportive and helping me in taking off my career to a good start.\nB.Tech-ECE\nPlaced In : NTT Data and Cognizant\nI take pride in being a student of Sharda University and now being an employee of a world renowned MNC. The latter wouldnt have been possible without the support of the former. The teaching and guidance here is just unparalleled. It has imparted a perfect blend of technical and soft skills and made me ready for industry. It was my honour to study under the guidance of such experienced faculties. Finally, a special thanks to our DCA (Department of Corporate Affairs) for inviting such big and renowned companies and organising various aptitude and soft skills sessions. It has left no stone unturned in getting us placed.\nB.Tech. (IT)\nI spent four years studying at Sharda and this was an absolutely unforgettable period in my life. Sharda is not only professional in teaching international students, but the school is also good at taking care of students. I had a very learning experience with the marvelous efforts of all the teachers. They taught me not only to learn but to explore.\nPlaced In : Go Bindas Entertainment\nI am convinced that excellence exists in the performance, and even more in the preparation. Therefore I take this opportunity to thank the Department of corporate affairs, SHARDA UNIVERSITY for helping me in preparations and getting a final offer from Tech-Mahindra. I would also like to extend my courtesy to the DCA particular for their valuable guidelines on the recruitment day and keeping our hopes and aspirations high. I also wish to thank all the student placement coordinators, Akash Bhatia in particular for their dedication and commitment.\nAlthough I am from Electronics background but I got placed in an IT company. I am immensely thankful to the university for providing me the opportunities. Initially I got rejected in 3 companies but I never lost hope. Finally I made through in Fiserv Inc. hard work never goes in vain.\nB.Tech. (ECE)\nPlaced In : Fiserv India\n\"The most important single ingredient in the formula of success is knowing how to get along with people ,and we as scholars learnt that aspect by acquiring the RIGHT ATTITUDE” along with our academic syllabi at SHARDA UNIVERSITY. When we entered the gates of SHARDA with a dream we never thought that these dream would not only make us successful but also achievers in true sense. Through this RIGHT ATTITUDE\"\nWhen I first entered Sharda University I was anxious about my future. Over the four years so many doors were opened for our personal and academic development that I became confident. The university aims at enhancing our knowledge, skills and abilities. It, in fact, didnt leave the attitude part behind as well. These years at Sharda University are the best years concerning learning, experience and gaining exposure to fields relevant to my discipline, all due to my faculty members. So many deserving students of our batch have been placed thanks to them and the Training & Placement Department. Being the placement coordinator of ECE, I personally know about their continuous efforts in getting the right companies for the right candidates. This endeavor will lead our University to incredible heights.\nPlaced In : IBM and Tata Consultancy Servic...\nI am grateful for the efforts of Department of Corporate Affairs to pitch us all at a platform like Tech Mahindra and other renowned companies.\nPlaced In : Cognizant\nOur university has provided us a very enhanced and efficient platform for the exposure to the training and placement. I am very grateful to the university for providing us the best of placement opportunities and finally I got placed in Fiserv India, one of the Fortune-500 companies.\n“Think Different, that is one thing that Sharda University urges in and to far extent succeed in teaching to its students which invariably helps to achieve what you need. It nourished me and thus gave me an opportunity to define me.\nB.Tech-Civil\nPlaced In : Dewan Housing & Finance Limited...\nLaunching your career with an esteem firm like Amara Raja Batteries wasn\\'t short of a dream come true and i would really like to dedicate a great part of my success to university. Sharda being a global university not only provides you some of the finest education across the globe but also foster you to evolve as a true professional. It fills my heart with joy unspeakable to be associated with a university of such stature.\nPlaced In : Amara Raja Batteries\nFor Sharda University, \"The world is here, where are you\" is not just a slogan but I lived it in reality. Sharda is a beautiful and historic place where people from different nationalities meet together to share one common goal, EDUCATION. I had the opportunity to meet with the dynamic and distinguished faculties, who are enthusiastic, friendly patient and highly qualified. With their guidance and constant mentoring I have been able to become a true professional in all the facets of life. Thanks to guidance provided by the Training & Placement Department, without their help I would not have been placed in NTL Electronics Limited. I have emerged as a new individual. All Thanks to my \"UNIVERSITY\".\nPlaced In : NTL Electronics Limited\nI thank my ECE department and its faculty members for encouraging me to think globally and spread my wings to take off for the land of rising Sun and I appreciate the support of my university for shaping my career and getting me placed in such big MNCs.\nPlaced In : Cognizant and IBM\nThe experience at Sharda was enriching in terms of technical skills and research training. Since, my course was very much research driven, I have learned a lot of basics of research and development with the help of distinguish faculties at Material Research Laboratory, and R&D facility at Nanotechnology center of Sharda University.\nThe teaching style was very much impressive in the nanotechnology and material science for sure. The teachers have taken us through numerous research papers to give an insight of the nanotechnology.\nI would say Sharda University has taught me a lot of technical skills and great references to get me into the prestigious Rice University, from which I shaped my career as per my interest. Sharda University proved to be a very well executed precursor in my career growth.\nMaster of Technology (Nanoscience & Technology)\nDuring my stay of four years in Sharda University, I came across various people of different country and culture. I had received a lot of opportunities to groom myself, thanks to my ever inspiring mentors who helped me to discover the talented part of myself. No wonder the university is new and is still striving to achieve excellence, but in the due time it has definitely set some benchmarks in the academia and is relentlessly trying to achieve the heights in rendering the world class education.\nA better human being, a better developer and a dream to achieve something big is all, I hoped for when I joined Sharda University. I am delighted to say that the faculties and the staff has helped me to achieve these dreams. Here, I not only had the chance to develop on my technical skills but also on other aspects such as Leadership & Management skills . The faculties always inspired me to go above and beyond my capabilities. I am grateful to my faculties and the staff of Sharda University for helping me achieve what I dreamt of.\nB.Tech - Computer Science\n• Course Fee\n• Recruiters\n• Covid 19 Updates\n• Sharda University Uzbekistan\n• Sharda University Agra\n• Courses on Human Values and Professional ethics\n• National Cyber Crime Reporting Portal\n• International Credit Transfer Programme\n85924219\n+91-120-4570000\n• +91-120-4570000\n+91-9205586066\n+91-8800998881\nSource: https://www.sharda.ac.in/student-testimonial"
    }
  }
}