{
  "source_file": "www.mha.gov.in_www_mha_gov_in_raw_2025-08-10-18-52-03.txt",
  "structured_data": {
    "visa_categories": {
      "summary": "This document outlines various visa categories for Bangladeshi nationals traveling to India. It details provisions for student visas, long-term employment visas for professionals and those on regular assignments, medical visas for treatment and diagnosis, journalist visas, research scholar visas, and entry visas (X-2 for spouses/children of Indian nationals, X-Misc for artists/professionals). Conference visas are available for attending events, and urgent service visas can be obtained for emergencies. All visas generally allow travel throughout India, with restrictions requiring special permits for protected areas.",
      "raw_content": "(8) Visa for Students : Bangladesh students who have been admitted in government and government approved private Universities, colleges and other educational institutions for general or technical study or training may be issued multiple entry student visas for the period of study or for two years, whichever is less. Visa will be extendable on year to year basis for up to 5 years. Spouse and children of only postgraduate students shall be granted multiple entry dependent visa of appropriate sub- category co-terminus with the visa of the principal Visa holder. (9) Long-term Employment Visa : Professionals of Bangladesh appointed by the Government of India as expatriate consultants or experts under agreement between the two Governments will be issued long-term employment visa (with multiple entry) for the tenure of assignment or one year, whichever is less. Spouse, dependent children and parents of such visa holders shall be granted multiple entry dependent visa of appropriate sub- category co-terminus with the visa of the principal visa holder. Employment visa may be extended up to five years from the date of issue of initial employment visa, on year to year basis. Multiple-entry employment visa valid for one year may be granted to Bangladeshi nationals who visit India on regular assignment for reputed organizations of both the countries (such as Biman Bangladesh Airlines, International Bus Service, Sonali Bank, Air India etc. or Government to Government projects or where a government organization has awarded a contract to a private firm or are inter-corporate transferees of a multi-national company). Spouse, dependent children and parents of such visa holders shall be granted multiple entry dependent visa of appropriate sub- category co-terminus with the visa of the principal visa holder . Visa may be extended on year to year basis up to a period of three years. (10) Medical Visa : Medical visas valid for up to one year or for the period of treatment whichever is less and with three entries with permission for multiple entry on need basis, may be issued to Bangladeshi nationals visiting India for specialized medical treatment with prior appointment from a recognized hospital. Medical attendant visas may be granted to three accompanying attendants, co-terminus with the validity of the Medical Visa granted. The Medical visa and the Medical Attendant visa will be extendable by another one year subject to production of the required medical report. Medical visa may be granted to a Bangladeshi national visiting India for diagnosis also subject to the applicant having a confirmed appointment in recognized Indian hospital and a diagnosis of illness from Bangladeshi doctors reflecting the ailment. (11) Visa for Journalists : Journalists working in reputed print and electronic media of either country will be issued multiple entry visas for one year. The maximum permissible duration of each stay will be thirty days. (12) Research Scholars/Fellows working in Educational/Research Institution : Research Scholars/ fellows working in education/research institutions of Bangladesh on assignment of job/ fellowship in India or for the purpose of scholarly research in archives and libraries will be issued multiple entry research visa for one year, extendable on year to year basis for a maximum period of five years from the issue of initial research visa with no limitation on number of journeys. Spouse, dependent children and parents of such visa holders shall be granted multiple entry dependent visa of appropriate sub- category co-terminus with the visa of the principal Visa holder. (13) Entry (X) Visa : Entry (X) Visa may be granted to the following categories of Bangladesh nationals- (i) Bangladesh national married to an Indian national or their children may be granted X-2 Visa for a period up to five years. (ii) Artistes/ cultural personalities/ academicians/ professionals who visit India to participate in non profitable/ non-commercial performances sponsored by reputed institutions in India may be granted X-Misc Visa up to a period of 6 months. (14) Conference Visa : Conference Visa may be issued to a Bangladesh national whose sole objective of visiting India is to attend conferences, seminars or workshops being held in India. (15) Urgent Service : In case of emergencies, the Bangladeshi nationals will be allowed to obtain visa on payment of a service charge. Note : All visas will be valid for travel to, and stay in, any part of India except protected/ restricted/ Cantonment areas for which foreigners need special permits."
    },
    "documents_required": {
      "summary": "This document outlines the required documents for obtaining different types of Indian visas from Bangladesh. For a Medical Visa, applicants need a citizenship/domicile certificate, an appointment letter from a recognized Indian hospital, and medical records from Bangladesh recommending overseas treatment. A Student Visa requires a citizenship/domicile certificate, an admission letter from an Indian educational institution, and proof of financial standing. An Employment Visa necessitates a citizenship/domicile certificate, a letter from the Bangladeshi employer detailing the applicant and visit purpose, and proof of the employer's registration, along with an invitation letter from the Indian company, proof of employment or contract, and specific documentation for expatriate consultants appointed by the Indian government.",
      "raw_content": "(4) Medical Visa (i) A copy of the Citizenship/domicile certificate along with English translation clearly indicating the address. (ii) A letter of appointment from a government / ICMR (Indian Council of Medical Research)/ NABH (National Accreditation Board for Hospitals & Healthcare Providers)/ MCI (Medical Council of India)/ CGHS (Central Government Health Scheme) recognized hospital in India. (iii) Medical records and diagnostic reports of the medical patient in Bangladesh clearly indicating the diagnosis and recommending treatment abroad for specialized treatment of ailment/ disease for which medical facilities are not easily available in Bangladesh. (5) Student Visa (i) A copy of the Citizenship/domicile certificate along with English translation clearly indicating the address. (ii) The letter of admission from Government and Government approved private Universities, colleges and other educational institutions for general or technical study or training. (iii) Evidence of adequate financial standing to support the academic/living expenses in India during the course of study (bank statements or proof of assured sponsorship/stipend to cover the expenses). While calculating the financial standing of the applicant, the Government of India scholarship, if applicable, will also be taken into account. (6) Employment Visa Documents from Bangladesh (i) A copy of the Citizenship/domicile certificate along with English translation clearly indicating the address. (ii) A letter from the company/ firm/ organization in Bangladesh giving details of the applicant, his/her designation and the purpose of the visit. (iii) A copy of the registration of the company/ firm/ organization in Bangladesh or Membership certificate of any Chamber of Commerce of repute of Bangladesh. Documents from India (i) A letter of invitation from any registered Indian company/ firm/ organization clearly indicating the nature of employment. (ii) Proof of his/her employment or contract or engagement by the company/firm/organization in India. (iii) In the case of professionals of Bangladesh appointed by the Government of India as expatriate consultant or expert under agreement between the Governments of India and Bangladesh , documentary evidence of assignment and copy of the agreement between the Governments of India and Bangladesh ."
    },
    "application_process": {
      "summary": "Bangladeshi nationals are required to submit their visa applications through the online system at https://indianvisaonline.gov.in using the standard visa application form.",
      "raw_content": "4. Application form All Bangladeshi nationals will have to submit applications for visas on the on-line system in the standard visa application form. For this purpose, the applicants may log on to https://indianvisaonline.gov.in ."
    },
    "seamen_rules": {
      "summary": "This text outlines the entry facilities for Bangladeshi seamen visiting India. Seamen with a valid Continuous Discharge Certificate (CDC) holding a photograph are exempt from needing a passport or visa when arriving as crew on a ship. They will receive a Landing Permit. If discharged in India, they get a 7-day Landing Permit and can travel to their home country. However, if a Bangladeshi seaman signs on Bangladeshi articles and needs to join their ship at an Indian port, they require an Indian Visa on their Bangladesh passport, with the CDC attached as proof. This visa is granted after special permission from India's Director General of Shipping. In all other situations, Bangladeshi seamen must adhere to standard travel regulations between the two countries.",
      "raw_content": "6. Seamen Seamen holding a valid Continuous Discharge Certificate (CDC) bearing a photograph and other prescribed particulars will be accorded the following facilities: (a) A seaman of Bangladesh visiting a port in India as a member of the crew of the ship which brings him need not hold a passport or a visa. He will be issued a Landing Permit. (b) A seaman, who arrives at a port in India as member of the crew of the ship which brings him and who is discharged at the port, will not require passport/visa. He will be issued with a Landing Permit valid up to 7 days and will also be allowed to travel to the country of which he is a national. (c) A Bangladeshi Seaman, who has signed on Bangladeshi articles and desires to join his ship at an Indian port, will require an Indian Visa on Bangladesh passport and his CDC is required to be attached with the passport as the proof of a seaman. The visa will be issued after the Director General of Shipping, Government of India gives special permission to the article concerned to join the ship. (d) In all other cases, a seaman of Bangladesh will be subject to the normal requirement governing travel between the two countries."
    },
    "inland_water_transport_rules": {
      "summary": "This text outlines the requirements for inland water transport personnel operating on vessels traveling to or from India. It specifies that such personnel must carry authenticated certificates of employment and permits with photographs. Officers supervising fleets require passports and multiple-entry visas. These provisions apply to personnel from Indian and Bangladeshi Inland Water Transport Corporations and private operators involved in inter-country river trade, who may also obtain multiple-entry visas from the High Commission of India in Dhaka.",
      "raw_content": "7. Inland Water Transport Personnel Ranking personnel and ratings of an inland vessel plying through or to India will carry a certificate of employment and permit with a photograph, duly authenticated by specified authorities of the respective countries. Officers supervising or controlling the fleet of the operators in either country should hold a passport and multiple entry visa. Officers of the Inland Water Transport Corporations of India and Bangladesh, as well as private operators engaged in inter-country trade via river routes, will be covered by these provisions. Such personnel may also be granted multiple entry visa by the High Commission of India, Dhaka."
    },
    "entry_exit_regulations": {
      "summary": "This document outlines the entry and exit regulations for Bangladeshi nationals traveling to India. Generally, they must use authorized immigration check posts and can travel by air, land, or sea. If exiting through a different point than entry, they need to provide prior notification. However, this restriction does not apply to entry or exit through 24 specific international airports and 2 land Integrated Check Posts (ICPs) listed in the text.",
      "raw_content": "8. Entry into India (A) Bangladesh nationals, other than those who hold appropriate documents for border trade, are required to enter and leave India through authorized Immigration check posts. (B) Bangladesh nationals traveling to India may be allowed to travel by air/land (Road and Rail)/sea whichever is convenient to the applicant. However, Bangladesh nationals exiting by designated check posts other than the one used for their entry, would be required to produce evidence of having intimated their new exit points at the point of their entry. Nationals of Bangladesh traveling by air/rail/road and desirous of exiting through a check post other than that of entry may, on application, be given a visa specifying the entry and exit points. Note : The above mentioned entry and exit restrictions will not apply in the case of Bangladeshi nationals entering/ exiting the following 24 international airports and 2 land ICPs:-\n(i) Airports : Ahmedabad, Amousi (Lucknow), Babatpur/ Varanasi, Bangalore, Calicut, Chennai, Cochin, Coimbatore, Dabolim (Goa), Delhi, Gaya, Guwahati, Hyderabad, Jaipur, Kolkata, Mangalore, Mumbai, Nagpur, Pune, Amritsar, Trichy, Trivandrum, Bagdogra and Chandigarh.\n(ii) Land ICPs : Haridaspur and Gede"
    },
    "port_of_exit_changes": {
      "summary": "This document outlines the procedures for changes in the port of exit for Bangladeshi nationals in India. Such changes, requiring bonafide and sufficient reasons, can be granted by FRROs in major cities and State Governments of certain eastern states. Specific guidelines are provided for air travel, allowing exit from different airports than entry points, and for land travel, permitting exit from land ICPs other than the entry point under certain conditions, with special provisions for businesspersons sponsored by reputable chambers of commerce.",
      "raw_content": "9. Changes in the Port of Exit : (i) In case any change in the Port of exit is required after arrival in India, it may be granted, based on bonafide and sufficient reasons, by the following authorities: (i) FRROs at Delhi, Mumbai Kolkata, Hyderabad, Bangalore and Chennai. (ii) The State Governments of Assam, Bihar, Meghalaya, Mizoram, Tripura and West Bengal. (ii) Changes in the port of exit may be granted by the authorities specified above in accordance with the following guidelines:-(i) A Bangladesh national travelling by air is permitted to exit from an airport different from the port of entry, or by land through the Haridaspur ICP. (ii) A Bangladesh national travelling by air can be allowed, in genuine cases, to leave India through the land ICPs, other than Haridaspur, provided advance intimation of the entry is given to the ICP by the authority permitting the change. Otherwise, the Bangladesh national shall travel by the designated port only. (iii) A Bangladesh national entering through the Haridaspur ICP may be allowed to exit through the Kolkata/Delhi Airport. (iv) A Bangladesh businessperson / professional sponsored by a reputed Chamber of Commerce may be allowed to exit from a land ICP different from the ICP of entry."
    },
    "registration_requirements": {
      "summary": "Bangladeshi nationals visiting India with a valid visa who intend to stay for more than six months must register with the FRRO/FRO within 14 days of their arrival and obtain a residential permit.",
      "raw_content": "10. Registration Bangladesh nationals visiting India on a valid visa, who wish to stay for a continuous period exceeding six months, will be required to register within 14 days of arrival with the respective FRRO/ FRO and obtain residential permit. *****"
    },
    "general_info": {
      "summary": "Visa grants for Bangladeshi nationals are regulated by the Revised Travel Arrangements established between India and Bangladesh on January 28, 2013, along with subsequent administrative instructions.",
      "raw_content": "1 VISA FOR BANGLADESH NATIONALS 1. Grant of visa to Bangladesh nationals is governed by the Revised Travel Arrangements signed between India and Bangladesh on 28 th January, 2013 and the administrative instructions issued from time to time"
    }
  }
}