{
  "source_file": "www.sharda.ac.in_Best_Mass_Communication_college_in_Delhi_India_raw_2025-08-10-18-29-19.txt",
  "structured_data": {
    "general_info": {
      "summary": "This document outlines various programs and initiatives at Sharda University, spanning the School of Dental Sciences, Medical Sciences & Research, and Nursing Science & Research. It includes academic components like the Academic Bank of Credits (ABC) and Curricula Feedback, administrative reports such as the Examination Annual Report, and information for prospective students via the University Brochure. The document also highlights university leadership, history, statutory bodies, and student development programs focused on capacity building, skill enhancement, language, soft skills, technological awareness, and entrepreneurship, alongside radio and mentoring platforms.",
      "raw_content": "Programme 2025-26\nSchool of Dental Sciences\nSchool of Medical Sciences & Research\nSharda School of Nursing Science & Research\nSchool of Medical Sciences & Research\nSharda School of Nursing Science & Research\nExamination Annual Report\nAcademic Bank of Credits (ABC)\nCurricula Feedback\nUniversity Brochure\nExamination Annual Report\nAcademic Bank of Credits (ABC)\nCurricula Feedback\nUniversity Brochure\nGet to know sharda\nPerspective Plan\nLeadership\nHistory\nStatutory Bodies of the University\nSharda Tenders\nAct, Statutes and Ordinances\nCOVID19\nFamily & Couple Counselling Services(FCCS)\nCapacity Development & Skill Enhancement\nLanguage and Communication Skill Initiatives: Sharda Skills\nSoft Skill Initiatives : Career Counseling and Development Center\nAwareness of Trends in Technology : IIC\nEntrepreneurship\nInnovation and Entrepreneurship\nFM Radio: Suno Sharda-90.8FM\nParamarsh- Our Mentoring Portal"
    },
    "alumni_testimonial": {
      "summary": "This document contains testimonials from Sharda University alumni who pursued degrees in Journalism and Mass Communication, and Interior Design. Graduates share positive experiences, highlighting the supportive faculty, practical learning, and career opportunities they received. Many alumni have achieved success in media, film, journalism, and design fields, attributing their growth and achievements in part to their education at Sharda University.",
      "raw_content": "Innovations When I look behind, I see the best days which one could spent in their college life. I enjoyed each and every moment spent in Sharda University. I had spent three long years in that University, where I learnt how to grow and grow. I did my Bachelors of Journalism and Mass Communication from Sharda University. Whenever I look behind, I cherish each moment which I had lived there. A girl who has just passed her 12th standard does not know much that what is good for her career, but here in Sharda University I always got motivated from my teachers. They always supported me in my projects. They were always standing behind me in my toughest phase of life where I didn't know what to do in my career. Professors always treated us like their own family\nBJMC, 2015-16\nPlaced In : Maverick\n“Angrezi mein kehte hain” was my rst Bollywood movie as an Assistant Director. This project was initiated during my nal year of graduation in Sharda and I was involved with pre production and post production. I am fortunate enough to start my career in India from NDTV channel and then with this concept based movie with a lot of learning from experienced personalities. Sharda is a key which helped me a lot to go beyond boundaries in excelling my skill set.\nBJMC , 2016-17\nChoosing Journalism and Mass Communication course at Sharda University is the best choice I have made till date. The course structure and learning pattern teaches us a lot. The faculty of the department gave us both theoretical and practical knowledge of the media eld. The support and encouragement helped me to cross all the obstacles. With their support, efforts and teaching knowledge, I got the opportunity to work with the best media houses like Hindustan Times and Hindu newspaper which gave a kick start to my career as a journalist and writer. And, now I am working as an Associate Editor with a web health portal 'Mynahcare.com'. I always embrace my whole journey with the university and faculty. I will definitely recommend everyone to be a part of this.\nBJMC, 2014-15\nPlaced In : Aquarius Media\nMr. Bangwe Naviley Chisenga\nSharda University in Greater Noida is a life-transforming higher learning institution ready to prepare students for challenges and opportunities of the 21st century. My experience as a Journalism and MassCommunication student is such that everyday has been an opportunity to learn an actual practical skill. The lecturers are down to earth and can be accessed anytime to help you succeed. The notes are readily available through LMS which helps you to study anywhere any time. Try Sharda today.\nBJMC, 2019-2020\nPlaced In : Press &Tourism, High Commission...\nMr. Bangwe Naviley Chisenga\nSince March 2017, I have been associated with Salmon & Co, a digital agency as a Producer and Writer. Here, I am a part of the creative process right from ideating, pitching to the clients, handling the process of production, pre-production to post production, including nalizing the budgets. Earlier I was working with Big Synergy Media Ltd. as an Assistant Director with the ction team. I was associated here in the creative process of conceptualizing web series and TV Shows for various channels like SONY, Star, Zee, and digital platforms like Balaji's ALT. Sharda University has been an important part of my growth. Mass Communication Department and its faculty members have been my constant support and strength in helping me realize my potential and dreams. The three years I spent here has given me strength and wisdom to go out and face the world with the values taught.\nPlaced In : Salmon & Co\nThe delicate years of my school life dashed off learning thoughts like 'an aimless person is like a rudderless boat tossing in an ocean.' Alas! it was not until I joined Sharda University, I realised it is only a rudderless boat that has the liberty to oat resolutely at will. Only a rudderless boat can dance to the blithe breeze, play with the maddening waves - all thanks to this glorious institution called Sharda University – it's value based education, practical oriented curriculum, most engaging classroom modules, faculty of astounding wisdom and the university's erudite ambience that never ceases to enchant. Graduating with a bachelors degree in journalism and mass communication and thereafter a brief stint in news reporting, I eventually went on to complete my post gradation in International Journalism from University of Sussex, United Kingdom on a scholarship. Currently, I am working for the international desk of a global news channel in China. Sharda University helped me gain enough of every gratifying experience to keep me smiling for another thousand lifetimes.\nPlaced In : Global News Channel, China\nI did my bachelor degree in Interior Design. The design department has provided well experience visiting faculties and professors during the four years of course. This course has helped me experience and explore many new things which is related to the course. The department got a small number of students and this gave us the opportunity to have more and close interaction with the staffs and faculties. I enjoyed my time at Sharda also I got to meet varieties of label mates from different countries and states.\nDesign, 2012-13\nPlaced In : Wooden Interior Solution, Impha...\nI believe that design as a field is and always will be something very personal, the passion for which comes from within the deepest parts of an individual. One just needs to strive hard to harvest this passion from under the ocean and I am glad to say that the School of Art, Design and Media Studies, Sharda University, was able to help find me this treasure in myself. I would say, the guidance and support I received from my mentors was beyond comparison as, they have always strived in bringing out the passion for design out of every student, who simultaneously had the willingness to travel on the path of self-discovery. The learning experience in Sharda University not only involved academics and practical studio sessions, but also off campus activities like industrial visits and day excursions, which helped in gaining a lot of exposure. Moreover, having studied in a diversified University, where the fellow classmates hailed from various parts of this world, provided a lot of exposure in understanding various cultures, which I believe, in a long run would be beneficial in the field of design\nPlaced In : AV 4th Dimension, Mumbai\nSharda University Department of Design gave me the tools to go out in the world with confidence.The concepts I learned are priceless. Being a designer, inspiration can be hard to come by and at sharda school of design i was taught from the very beginning how to use the resources we had, to create top level designs-even on a small budget. The Sharda University staff are second to none! I challenge any college to find professors who care as much about their student as the ones at Sharda. I interned at Cengres TIles and attended gallery walks and shows while at Sharda University\nPlaced In : Cengetiles ltd\nI like the fact that the no. of students in the classes are not many and the faculties are amazingly friendly, interactive and also very helpful in and outside campus. They are always available and willing to help. They also guide us well and very supportive. The environment there is very sociable with different people from different countries. And yeah the food specially from uncle's cafe and the Lego house was really good. A great place for students..\nPlaced In : Sai lab, Noida\nI absolutely loved this course. It showed me aspects of Interior Design that I didn't consider before and the fact that it covers history as well as architecture in college assignments, it helped me develop my eye for various styles and their decor as they relate to specific areas. It is a great way to analyze and criticizing the interior as well as exterior treatments of various buildings. During my training, I learned many new things, received encouragement to explore my creativity and style as well as improve and obtain more skill in the areas that were my weaker points.\nThis course was definitely worth taking. I plan to explore and expand my creativity using the knowledge and skill acquired from the course in my future career as an Interior Designer.\nPlaced In : Aditya Birla"
    },
    "recruitment_partners": {
      "summary": "The provided text consists of the title \"Our Recruiters\" followed by the heading \"Recruiters\", indicating a section related to recruitment personnel.",
      "raw_content": "Our Recruiters\nRecruiters"
    },
    "university_services": {
      "summary": "This document appears to be a list of categories or topics related to international affairs, potentially for travelers or individuals engaging with foreign services. It covers global knowledge seeking, banking and postal services, visa and immigration guidelines, medical insurance, and observership programs.",
      "raw_content": "Global Knowledge Seekers\nBanking And Postal Services\nGuidelines for Visa and FRO/FRRO\nGuidelines for Medical Insurance\nObservership Programmes"
    },
    "academic_initiatives": {
      "summary": "The provided text lists three distinct items: \"Courses on Human Values and Professional ethics,\" \"National Cyber Crime Reporting Portal,\" and \"International Credit Transfer Programme.\" These appear to be titles or names of specific initiatives, services, or educational offerings.",
      "raw_content": "Courses on Human Values and Professional ethics\nNational Cyber Crime Reporting Portal\nInternational Credit Transfer Programme"
    },
    "other_campus_information": {
      "summary": "The provided text lists two locations associated with Sharda University: Sharda University Uzbekistan and Sharda University Agra.",
      "raw_content": "Sharda University Uzbekistan\nSharda University Agra"
    }
  }
}