{
  "source_file": "www.sharda.ac.in_BSc_Chemistry-_Syllabus_Subjects_Eligibility_Scope_Fees_raw_2025-08-10-18-29-22.txt",
  "structured_data": {
    "general_info": {
      "summary": "This document appears to be a list of various programs, schools, reports, initiatives, and important information related to Sharda University. It covers academic offerings, administrative functions, student support services, innovation and entrepreneurship efforts, outreach programs, and specific university branches and related portals.",
      "raw_content": "• Programme 2025-26\n• School of Dental Sciences\nSchool of Medical Sciences & Research\nSharda School of Nursing Science & Research\n• School of Medical Sciences & Research\n• Sharda School of Nursing Science & Research\nExamination Annual Report\nAcademic Bank of Credits (ABC)\nCurricula Feedback\nUniversity Brochure\n• Examination Annual Report\n• Academic Bank of Credits (ABC)\n• Curricula Feedback\n• University Brochure\n• Get to know sharda\n• Perspective Plan\n• Leadership\n• History\n• Statutory Bodies of the University\n• Sharda Tenders\n• Act, Statutes and Ordinances\n• COVID19\n• Family & Couple Counselling Services(FCCS)\n• Capacity Development & Skill Enhancement\n• Language and Communication Skill Initiatives: Sharda Skills\n• Soft Skill Initiatives : Career Counseling and Development Center\n• Awareness of Trends in Technology : IIC\n• Entrepreneurship\n• Innovation and Entrepreneurship\nFM Radio: Suno Sharda-90.8FM\n• FM Radio: Suno Sharda-90.8FM\nObservership Programmes\n• Observership Programmes\nParamarsh- Our Mentoring Portal\n• Paramarsh- Our Mentoring Portal\n• Recruiters\n• Covid 19 Updates\n• Sharda University Uzbekistan\n• Sharda University Agra\n• Courses on Human Values and Professional ethics\n• National Cyber Crime Reporting Portal\n• International Credit Transfer Programme"
    },
    "career_path": {
      "summary": "A Bachelor of Science (B.Sc.) in Chemistry offers a wide array of career opportunities, including further academic pursuits like Master's or Ph.D. programs, leading to research and teaching positions. Industrially, graduates can work as R&D chemists, quality control analysts, or process developers in sectors like pharmaceuticals and petrochemicals. Government roles in agencies such as CSIR and DRDO, as well as forensic science and civil services, are also accessible. Furthermore, interdisciplinary skills can lead to careers in data science, bioinformatics, or regulatory affairs, with entrepreneurial and science communication also being viable paths.",
      "raw_content": "Global Knowledge Seekers\nOur Recruiters\nBanking And Postal Services\nGuidelines for Visa and FRO/FRRO\nGuidelines for Medical Insurance\n• Global Knowledge Seekers\n• Our Recruiters\n• Banking And Postal Services\n• Guidelines for Visa and FRO/FRRO\n• Guidelines for Medical Insurance\nCareer path you can choose after the course\nCareer path: A B.Sc. in Chemistry opens up diverse and promising career paths in both academic and professional domains. Graduates can pursue higher education such as M.Sc. or integrated Ph.D. programs in specialized areas like organic, inorganic, physical, analytical, or biochemistry, often leading to research and teaching roles in universities or research institutions. Those completing the Honours with Research track gain a competitive edge for Ph.D. admissions and roles requiring advanced research skills. In industry, opportunities exist as quality control analysts, quality control analysts, process developers, and environmental scientists across sectors like pharmaceuticals, petrochemicals, food processing, and cosmetics. The degree also enables roles in government agencies such as CSIR, DRDO, BARC, and forensic labs, or through civil services examinations. With the addition of interdisciplinary skills or a relevant minor (e.g., in AI or biology), graduates can explore careers in data science, scientific software development, regulatory affairs, and bioinformatics. Entrepreneurial ventures, science communication, or EdTech are also viable paths for those inclined toward innovation and outreach.\nTake the next step towards a career in basic sciences.\n"
    }
  }
}