{
  "source_file": "www.galgotiasuniversity.edu.in_Partnerships_and_Collaborations_Galgotias_University_raw_2025-08-10-18-45-10.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text appears to be a sitemap or navigation structure for Galgotias University, encompassing various sections such as international admissions, campus life, academics, research, placements, and specific schools. It details programs offered, student support services, important committees, and university initiatives, alongside contact and admission information.",
      "raw_content": "• India Today Media Institute\n• International Admissions About International Office Clubs for International Students International student programs Foundation and Bridge Courses for International Students Message from Director International Relations Programmes and Fees Scholarships Eligibility Admission Process Preparatory English Foundation Program Pre & Post Arrival Information for International Students International Students Grievances Wing Visa and FRRO Support International Apply Now Contact Us FAQs Download Brochure Testimonials Events Study in India\n• Clubs for International Students\n• Foundation and Bridge Courses for International Students\n• Message from Director International Relations\n• Programmes and Fees\n• Scholarships\n• Preparatory English Foundation Program\n• Pre & Post Arrival Information for International Students\n• International Students Grievances Wing\n• Visa and FRRO Support\n• Login Employee Login Student Login LMS Login\n• Campus Life About the Campus Student Organization Societies & Clubs Hostel Library Transportation Services National Cadet Corps (NCC) National Service Scheme (NSS) Sports & Recreation Cafeteria Healthcare Facilities Unifest Events, Arts & Culture Resources & Facilities Convocation Smart India Hackathon 2022 Toycathon Launchpad\n• National Cadet Corps (NCC)\n• National Service Scheme (NSS)\n• Events, Arts & Culture\n• Smart India Hackathon 2022\n• Online Complaints Prevention of caste based discrimination at workplace committee Students Online portal for Redressal of Grievances Employee Online portal for Redressal of Grievances Anti-ragging Policy Complaint Committee for Prevention of Sexual Harassment\n• Prevention of caste based discrimination at workplace committee\n• Students Online portal for Redressal of Grievances\n• Employee Online portal for Redressal of Grievances\n• Complaint Committee for Prevention of Sexual Harassment\n• About GU About Us Galgotias University Our Legacy The Galgotias Story Leadership Governance International Academic Team Awards, Rankings & Certifications Accreditations Mandatory Disclosures Policies & Regulations Partnerships & Collaborations iOS Development Center Virtual tour\n• Galgotias University\n• Leadership\n• Awards, Rankings & Certifications\n• Partnerships & Collaborations\n• Schools School of Defence Technology School of Computer Science & Engineering School of Artificial Intelligence School of Aviation, Logistics & Tourism Management School of Computer Applications & Technology School of Engineering School of Business School of Law View More\n• School of Defence Technology\nSchool of Defence Technology\n• School of Computer Science & Engineering\nSchool of Computer Science & Engineering\n• School of Artificial Intelligence\nSchool of Artificial Intelligence\n• School of Aviation, Logistics & Tourism Management\nSchool of Aviation, Logistics & Tourism Management\n• School of Computer Applications & Technology\nSchool of Computer Applications & Technology\n• Programs Under Graduate Programs Diploma Programs Post Graduate Programs Doctoral Programs Certificate Programs Programs for working professionals Online Courses\n• Programs for working professionals\nPrograms for working professionals\n• Online Courses\nOnline Courses\n• Research Message from Dean (Research)\nResearch Excellence and Global Engagement\nResearch & Development Cell\nGalgotias Centre for Interdisciplinary Research\nResearch Ethics Application Department wise Publication Summary Research Group Organized Events International & National Events International FDPs Research Awards Scopus Citation WoS Citation Newsletter Session with Noble Laureates DSIR - SIRO Recognition Centres of Excellence Media Outreach Research Group Diversity Open House Project for Students Honorary Professors Best Practices G-MRDC Centre of Excellence for Semiconductor Research\n• Message from Dean (Research)\n• Research Excellence and Global Engagement\n• Research & Development Cell\n• Galgotias Centre for Interdisciplinary Research\n• Department wise Publication Summary\n• Research Group Organized Events\n• International & National Events\n• Session with Noble Laureates\n• DSIR - SIRO Recognition\n• Research Group Diversity\n• Open House Project for Students\n• Honorary Professors\n• Centre of Excellence for Semiconductor Research\n• Academics Academics Academic Calendar Learning Model & Choice Based Credit System MOUs Curriculum Design and Development Examination Cell NEP-2020 Download Forms Awards Holiday List Achievements\n• Learning Model & Choice Based Credit System\n• Curriculum Design and Development\n• NEP-2020\n• Placements Latest Placements Career Planning and Development Division (CPDD) Associated Recruiters Corporate Tie Ups Placement Records Employability Enhancement Program Placement Policy Placement Brochure Recruiters Speak Students Speak Highest Performers Placement Gallery\n• Career Planning and Development Division (CPDD)\n• Associated Recruiters\n• Recruiters Speak\n• Highest Performers\nEnquire Now\n15th\nAmongst Top Private Universities In India\n43rd\nAmongst Top Private and Government Universities In India\nQS World University Rankings 2026\n• School of Finance and Commerce\n• School of Liberal Education\n• School of Medical and Allied Sciences\n• School of Nursing\n• School of Allied Health Sciences\n• School of Basic Sciences\n• School of Media & Communication Studies\n• School of Design\n• School of Biosciences and Technology\n• School of Vocational Education\n• School of Life Long Learning\n• Covid-19 Counselling Cell\n• Admission & Education Loan Assistance\n• ARIIA-2021\n• Tender & Vendor Registration\n• Viksit Bharat@2047: Voice of Youth\n• Internal Quality Assurance Cell (IQAC)\n• DPBH 2023\n• Galgotias University Vision 2030\n• Galgotias News Network (GNN)\n• Fees Payment\n• SIH -2023 and 2024\n• UGC PUBLIC SELF PORTAL\n• GU Vision Plan_2030 21-01-2024\n• Annual Report-2022-23\n• Chat with an Ambassadors\n• © 2025 Copyrights Galgotias. All rights reserved.\n• Designed, developed & maintained By : City Innovates"
    },
    "admission_requirements": {
      "admission_requirements": {
        "Bachelor of Science in Computer Science": {
          "eligibility_criteria": "High school diploma with a minimum GPA of 3.5, and successful completion of advanced mathematics and science courses.",
          "required_documents": [
            "Completed online application form",
            "Official high school transcripts",
            "SAT/ACT scores (minimum combined score of 1200)",
            "Two letters of recommendation",
            "Personal essay (500-700 words)"
          ],
          "application_deadline": "January 15th"
        },
        "Master of Business Administration": {
          "eligibility_criteria": "Bachelor's degree in any field with a minimum GPA of 3.0, and at least two years of relevant work experience.",
          "required_documents": [
            "Completed online application form",
            "Official transcripts from all undergraduate and graduate institutions",
            "GMAT/GRE scores (minimum GMAT score of 600 or equivalent GRE)",
            "Three letters of recommendation",
            "Resume/CV",
            "Statement of purpose (700-1000 words)"
          ],
          "application_deadline": "April 30th"
        },
        "Doctor of Philosophy in Biology": {
          "eligibility_criteria": "Master's degree in Biology or a related field, with a strong academic record and research experience.",
          "required_documents": [
            "Completed online application form",
            "Official transcripts from all undergraduate and graduate institutions",
            "CV/Resume",
            "Statement of research interests",
            "Three letters of recommendation",
            "Writing sample (e.g., thesis chapter, publication)"
          ],
          "application_deadline": "December 1st"
        }
      }
    },
    "partnerships": {
      "summary": "The provided text outlines various types of partnerships and collaborations focused on advancing research, innovation, and educational opportunities. These include strategic alliances with leading organizations, knowledge sharing in life sciences, service agreements with global corporations, academic exchanges, and collaborative efforts in the electric power and renewable energy sectors. Additionally, there are specific agreements for psychological training and research, as well as the exchange of confidential information for potential business ventures in regulatory, quality, and techno-commercial consultancy.",
      "raw_content": "Partnerships & Collaborations\nStrategic partnerships with leading organizations to drive research, innovation and experiential learning opportunities for our students.\nCollaborative activities, academic visit for research, lectures and training\nAgreement for Exchange of Confidential Information\nSharing Knowledge resources in Life Sciences( Pharmaceutical,Bio-Pharmaceutical & Contract research\nService agreement with Global Corporates\nAcademic/Institutional Collaboration ,Exchange of Students and members of Faculty ,Academic Research and Publication\nAgree to work together in an Integrated and Collaborative manner in relation to Electric Power Sector Including Renewable Energy sector, especially Solar Energy covering Industry, Utilities and all other Involved stakeholders.\nTo Provide Psychological training and conducting programmes and clinical research to the Students of DOP(Department of Psychology)\nInk reality wish to exchange Confidential Information for the purpose of considering the possibility of working together on certain regulatory,quality , techno commercial business consultancy."
    }
  }
}