{
  "source_file": "www.sharda.ac.in_Why_Choose_Sharda_University_raw_2025-08-10-18-29-09.txt",
  "structured_data": {
    "general_info": {
      "summary": "This document provides a list of various universities and educational institutions worldwide, detailing their founding dates, locations, affiliations, and notable features. Examples include King's University College at Western University, Curtin University of Technology, Taipei Medical University, Telecom Ecole de Management, and several others across different countries, highlighting their academic offerings, student populations, and rankings where available.",
      "raw_content": "KING'S UNIVERSITY COLLEGE, UNIVERSITY OF WESTERN ONTARIO\nFounded in 1954, Kings University College at Western University is a Catholic, liberal arts university college affiliated with a large, world class university. Kings students enjoy “The Best of Both Worlds” - small classes led by outstanding faculty on a small, beautiful campus while enjoying the experiences of being part of a comprehensive university. Kings students have complete access to all the facilities and services at Western University and graduate with a Western degree. As a Catholic university, Kings emphasizes the value of each individual and the importance of social justice. Students from all faiths and backgrounds are most welcome. Respect for the human person is behind our commitment to diversity, accessibility, social justice and to building the common good. An inclusive, supportive community is one of King's greatest strengths.\nCurtin University Of Technology\nAdministrative staff - 3,689 Started in 1966 ties with 90 exchange universities in 20 countries 95 specialists centres/courses 5-star university as per the QS Stars university ratings Largest University in Western Australia.\nTaipei Medical University\nTaipei Medical University in Taiwan is located in Taipei's Xinyi District. Founded as Taipei Medical College in 1960, it was renamed as Taipei Medical University in 2000. It underwent the processes to building the foundation, flourishing, expansion and transformation via innovation.\nTamansiswa University\nUniversitas Sarjanawiyata Taman Siswa Yogyakarta is a university in Yogyakarta City in Indonesia.\nTelecom Ecole de Management\nInstitut Mines-Télécom Business School is a French state-funded Management School, a member of Institut Mines-Telecom, the number one group of engineering and management graduate schools in France.\nUniversity of Al Nahreen\nNahrain University (Arabic), (also known as Al-Nahrain University), is a coeducational public university established in 1987 and located in Baghdad, Iraq. The university offers undergraduate and postgraduate education as well as research opportunities. From 1987 to the 2003 Invasion of Iraq, the university was known as Saddam University which was then changed to its current name \"Nahrain\" meaning The Two Rivers (as in the two rivers of Iraq: Tigris and Euphrates).\nUniversity of Alexandria\nAlexandria University (Arabic:‎) is a public university in Alexandria, Egypt. It was established in 1938 as a satellite of Fouad University (the name of which was later changed to Cairo University), becoming an independent entity in 1942. It was known as Farouk University until the Egyptian Revolution of 1952 when its name was changed to the University of Alexandria. Taha Hussein was the founding rector of Alexandria University. It is now the second largest university in Egypt and has many affiliations to various universities for ongoing\nUniversity of Babylon\nThe University of Babylon is a university located in Babylon, Iraq. It consists of 20 colleges within three compounds, located seven kilometers south of the city of Hillah, in Babylon Province.\nUniversity of Baltimore\nThe University of Baltimore is a public university and member of the University System of Maryland located in midtown Baltimore, Maryland, in the Mt. Vernon neighborhood at 1420 N.\nUniversity of Illinois\nThe University of Illinois at Urbana–Champaign is a public research university in Illinois and the ... The campus library system possesses the second-largest university library in the United States by holdings after Harvard University.\nUniversity of Bremen\nThe University of Bremen (German Universität Bremen) is a public university in Bremen, Germany, with approximately 23,500 people from 115 countries. It is one of 11 institutions which were successful in the category \"Institutional Strategies\" of the Excellence Initiative launched by the Federal Government and the Federal States in 2012. The university was also successful in the categories \"Graduate Schools\" and \"Clusters of Excellence\" of the initiative.\nUniversity of Finance and Administration\nThe University of Finance and Administration is a private business school in the Czech Republic. It was founded by the Bank Academy and Czech Coal Group in 1999 and was one of the first private business schools in the country.\nRoyal Melbourne Institute Of Technology (Rmit)\nFounded in 1887 83,024+ students Grown to 87 buildings Academic staff - 4947 Spread across 7,800,000 sq ft.\nUniversity of Idaho\nThe University of Idaho is a public university in Moscow, Idaho. It is the state's land-grant and primary research university. The University of Idaho was the state's sole university for 71 years, until 1963, and its College of Law, established in 1909,\nUniversity of Malta\nThe University of Malta is the highest educational institution in Malta. It offers undergraduate bachelor's degrees\nUniversity of Missouri at Kansas City\nThe University of Missouri-Kansas City (UMKC) is a public research university in Kansas City, .... In the 2015 U.S. News and World Report Best Colleges rankings,\nUniversity of Muhammadiyah Sumatera Utara\nUniversitas Muhammadiyah Sumatera Utara (UMSU) adalah salah satu Perguruan Tinggi Swasta di Medan Sumatra Utara. UMSU merupakan salah satu kampus terbaik di Medan,\nUniversity of Mustansiriah\nMustansiriyah University (Arabic) is a university in Baghdad, Iraq. The original Mustansiriya Madrasah,\nUniversity of New York Tirana\nUniversity of New York Tirana is an accredited private higher education institution in Tirana\nUniversity of Raparin\nThe University of Raparin is a public university in Ranya, in the Sulaymaniyah Governorate of the Kurdistan Region of Iraq.\n"
    }
  }
}