{
  "source_file": "www.galgotiasuniversity.edu.in_International_Academic_Team_raw_2025-08-10-18-45-11.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text outlines various sections and offerings of Galgotias University, including its international student programs, campus life facilities, grievance redressal mechanisms, various schools and departments, and administrative information like fees, admissions, and publications. It also mentions specific initiatives such as the Smart India Hackathon and Viksit Bharat@2047, alongside copyright and development details.",
      "raw_content": "• India Today Media Institute\n• International Admissions About International Office Clubs for International Students International student programs Foundation and Bridge Courses for International Students Message from Director International Relations Programmes and Fees Scholarships Eligibility Admission Process Preparatory English Foundation Program Pre & Post Arrival Information for International Students International Students Grievances Wing Visa and FRRO Support International Apply Now Contact Us FAQs Download Brochure Testimonials Events Study in India\n• Clubs for International Students\n• Foundation and Bridge Courses for International Students\n• Message from Director International Relations\n• Programmes and Fees\n• Scholarships\n• Preparatory English Foundation Program\n• Pre & Post Arrival Information for International Students\n• International Students Grievances Wing\n• Visa and FRRO Support\n• Login Employee Login Student Login LMS Login\n• Campus Life About the Campus Student Organization Societies & Clubs Hostel Library Transportation Services National Cadet Corps (NCC) National Service Scheme (NSS) Sports & Recreation Cafeteria Healthcare Facilities Unifest Events, Arts & Culture Resources & Facilities Convocation Smart India Hackathon 2022 Toycathon Launchpad\n• National Cadet Corps (NCC)\n• National Service Scheme (NSS)\n• Events, Arts & Culture\n• Smart India Hackathon 2022\n• Online Complaints Prevention of caste based discrimination at workplace committee Students Online portal for Redressal of Grievances Employee Online portal for Redressal of Grievances Anti-ragging Policy Complaint Committee for Prevention of Sexual Harassment\n• Prevention of caste based discrimination at workplace committee\n• Students Online portal for Redressal of Grievances\n• Employee Online portal for Redressal of Grievances\n• Complaint Committee for Prevention of Sexual Harassment\n• About GU About Us Galgotias University Our Legacy The Galgotias Story Leadership Governance International Academic Team Awards, Rankings & Certifications Accreditations Mandatory Disclosures Policies & Regulations Partnerships & Collaborations iOS Development Center Virtual tour\n• Galgotias University\n• Leadership\n• Awards, Rankings & Certifications\n• Partnerships & Collaborations\n• Schools School of Defence Technology School of Computer Science & Engineering School of Artificial Intelligence School of Aviation, Logistics & Tourism Management School of Computer Applications & Technology School of Engineering School of Business School of Law View More\n• School of Finance and Commerce\n• School of Liberal Education\n• School of Medical and Allied Sciences\n• School of Nursing\n• School of Allied Health Sciences\n• School of Basic Sciences\n• School of Media & Communication Studies\n• School of Design\n• School of Biosciences and Technology\n• School of Vocational Education\n• School of Life Long Learning\n• Covid-19 Counselling Cell\n• Admission & Education Loan Assistance\n• ARIIA-2021\n• Tender & Vendor Registration\n• Viksit Bharat@2047: Voice of Youth\n• Internal Quality Assurance Cell (IQAC)\n• DPBH 2023\n• Galgotias University Vision 2030\n• Galgotias News Network (GNN)\n• Fees Payment\n• SIH -2023 and 2024\n• UGC PUBLIC SELF PORTAL\n• GU Vision Plan_2030 21-01-2024\n• Annual Report-2022-23\n• Chat with an Ambassadors\n• © 2025 Copyrights Galgotias. All rights reserved.\n• Designed, developed & maintained By : City Innovates"
    },
    "research": {
      "summary": "This document outlines various aspects of research at an institution, focusing on excellence, global engagement, and specific initiatives. It details the Research & Development Cell, the Galgotias Centre for Interdisciplinary Research, and lists numerous research-related activities and recognitions, including publication summaries, organized events, international programs, research awards, citation metrics, media outreach, diversity initiatives, student projects, honorary professors, and a dedicated Semiconductor Research Centre.",
      "raw_content": "• Research Message from Dean (Research)\nResearch Excellence and Global Engagement\nResearch & Development Cell\nGalgotias Centre for Interdisciplinary Research\nResearch Ethics Application Department wise Publication Summary Research Group Organized Events International & National Events International FDPs Research Awards Scopus Citation WoS Citation Newsletter Session with Noble Laureates DSIR - SIRO Recognition Centres of Excellence Media Outreach Research Group Diversity Open House Project for Students Honorary Professors Best Practices G-MRDC Centre of Excellence for Semiconductor Research\n• Message from Dean (Research)\n• Research Excellence and Global Engagement\n• Research & Development Cell\n• Galgotias Centre for Interdisciplinary Research\n• Department wise Publication Summary\n• Research Group Organized Events\n• International & National Events\n• Session with Noble Laureates\n• DSIR - SIRO Recognition\n• Research Group Diversity\n• Open House Project for Students\n• Honorary Professors\n• Centre of Excellence for Semiconductor Research\n"
    },
    "placements": {
      "summary": "The provided text outlines various aspects of a placement and career development division, including its latest placements, career planning initiatives, associated recruiters, placement records, employability enhancement programs, policies, and related content such as recruiter and student testimonials, highest performers, and a placement gallery.",
      "raw_content": "• Placements Latest Placements Career Planning and Development Division (CPDD) Associated Recruiters Corporate Tie Ups Placement Records Employability Enhancement Program Placement Policy Placement Brochure Recruiters Speak Students Speak Highest Performers Placement Gallery\n• Career Planning and Development Division (CPDD)\n• Associated Recruiters\n• Recruiters Speak\n• Highest Performers"
    },
    "international_academic_team": {
      "summary": "This text lists several individuals associated with Galgotias University, detailing their roles, affiliations with other institutions, years of experience, and countries. The individuals hold positions such as Dean, Mentor, Professor, Associate Director, and English Language Trainer, with their experience ranging from over 4 years to 30 years and representing countries like the Czech Republic, France, Australia, Singapore, USA, and Malaysia.",
      "raw_content": "Enquire Now\nDr. Hamidreza Namazi Dean for Research Excellence & Global Engagement, Galgotias University\nAdjunct Lecturer, Monash UniversityExperience -7.4 YearsCountry - Czech Republic\nDr. Bhumikka Gupta Mentor International Relations, International Accreditations and Research, Galgotias University\nInstitut Mines - Telecom Business SchoolExperience - 20+ years Country - France\nProfessor Richard James Professor, GSCALE Galgotias University\nDeputy Vice - Chancellor-Academic,Melbourne CSHEExperience – 30 YearsCountry - Australia\nMellissa Callendre Tawin Associate Director, GSCALE Galgotias University\nDeputy Director, Nanyang Technological UniversityExperience - 23+ yrsCountry - Singapore\nYeong Jin Yuan (JY) Associate Director, GSCALE Galgotias University\nAssistant Director, Nanyang Technological UniversityExperience - 13 YearsCountry - Singapore\nDr. Ylli Dautaj Professor of Practice, School of Law Galgotias University\nPenn State Law Experience – 4+ YearsCountry - USA\nDr. Bredan Bernicker Professor of Practice, School of Law Galgotias University\nBerniker Law PLLCExperience – 5+ YearsCountry - USA\nApheenjo S. Peradit English Language Trainer, Galgotias University\nEnglish Language Trainer, Creative Edu AcademyExperience – 7+ Years Country - Malaysia\nJoshua Aston Adjunct Faculty, School of law, Galgotias University\nSchool of Business and Law, Edith Cowan UniversityExperience – 25 Years Country - Australia"
    }
  }
}