{
  "source_file": "www.galgotiasuniversity.edu.in_Vision_and_Mission_Galgotias_University_raw_2025-08-10-18-45-11.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text provides a comprehensive overview of Galgotias University, highlighting its academic programs, campus life, research initiatives, and accreditations. It emphasizes the university's commitment to providing a world-class education, fostering innovation, and preparing students for global competitiveness. The text details various schools, programs, student support services, and awards received, showcasing its dedication to excellence and nation-building through skill development.",
      "raw_content": "India Today Media Institute\nInternational Admissions About International Office Clubs for International Students International student programs Foundation and Bridge Courses for International Students Message from Director International Relations Programmes and Fees Scholarships Eligibility Admission Process Preparatory English Foundation Program Pre & Post Arrival Information for International Students International Students Grievances Wing Visa and FRRO Support International Apply Now Contact Us FAQs Download Brochure Testimonials Events Study in India\nClubs for International Students\nFoundation and Bridge Courses for International Students\nMessage from Director International Relations\nProgrammes and Fees\nScholarships\nPreparatory English Foundation Program\nPre & Post Arrival Information for International Students\nInternational Students Grievances Wing\nVisa and FRRO Support\nLogin Employee Login Student Login LMS Login\nCampus Life About the Campus Student Organization Societies & Clubs Hostel Library Transportation Services National Cadet Corps (NCC) National Service Scheme (NSS) Sports & Recreation Cafeteria Healthcare Facilities Unifest Events, Arts & Culture Resources & Facilities Convocation Smart India Hackathon 2022 Toycathon Launchpad\nNational Cadet Corps (NCC)\nNational Service Scheme (NSS)\nEvents, Arts & Culture\nSmart India Hackathon 2022\nOnline Complaints Prevention of caste based discrimination at workplace committee Students Online portal for Redressal of Grievances Employee Online portal for Redressal of Grievances Anti-ragging Policy Complaint Committee for Prevention of Sexual Harassment\nPrevention of caste based discrimination at workplace committee\nStudents Online portal for Redressal of Grievances\nEmployee Online portal for Redressal of Grievances\nComplaint Committee for Prevention of Sexual Harassment\nAbout GU About Us Galgotias University Our Legacy The Galgotias Story Leadership Governance International Academic Team Awards, Rankings & Certifications Accreditations Mandatory Disclosures Policies & Regulations Partnerships & Collaborations iOS Development Center Virtual tour\nGalgotias University\nLeadership\nAwards, Rankings & Certifications\nPartnerships & Collaborations\nSchools School of Defence Technology School of Computer Science & Engineering School of Artificial Intelligence School of Aviation, Logistics & Tourism Management School of Computer Applications & Technology School of Engineering School of Business School of Law View More\nSchool of Defence Technology\nSchool of Defence Technology\nSchool of Computer Science & Engineering\nSchool of Computer Science & Engineering\nSchool of Artificial Intelligence\nSchool of Artificial Intelligence\nSchool of Aviation, Logistics & Tourism Management\nSchool of Aviation, Logistics & Tourism Management\nSchool of Computer Applications & Technology\nSchool of Computer Applications & Technology\nPrograms Under Graduate Programs Diploma Programs Post Graduate Programs Doctoral Programs Certificate Programs Programs for working professionals Online Courses\nPrograms for working professionals\nPrograms for working professionals\nOnline Courses\nOnline Courses\nFee Structure & Eligibility Scholarships Hostel Lateral Entry/Migration Admission Financial Aid & Loan Facilities\nAdmission Documents & Undertaking Approvals & Accreditations Transportation Services Ph.D Admission Refund Policy Download Brochure Admission Helpline\nResearch Message from Dean (Research)\nResearch Excellence and Global Engagement\nResearch & Development Cell\nGalgotias Centre for Interdisciplinary Research\nResearch Ethics Application Department wise Publication Summary Research Group Organized Events International & National Events International FDPs Research Awards Scopus Citation WoS Citation Newsletter Session with Noble Laureates DSIR - SIRO Recognition Centres of Excellence Media Outreach Research Group Diversity Open House Project for Students Honorary Professors Best Practices G-MRDC Centre of Excellence for Semiconductor Research\nMessage from Dean (Research)\nResearch Excellence and Global Engagement\nResearch & Development Cell\nGalgotias Centre for Interdisciplinary Research\nDepartment wise Publication Summary\nResearch Group Organized Events\nInternational & National Events\nSession with Noble Laureates\nDSIR - SIRO Recognition\nResearch Group Diversity\nOpen House Project for Students\nHonorary Professors\nCentre of Excellence for Semiconductor Research\nAcademics Academics Academic Calendar Learning Model & Choice Based Credit System MOUs Curriculum Design and Development Examination Cell NEP-2020 Download Forms Awards Holiday List Achievements\nLearning Model & Choice Based Credit System\nCurriculum Design and Development\nNEP-2020\nPlacements Latest Placements Career Planning and Development Division (CPDD) Associated Recruiters Corporate Tie Ups Placement Records Employability Enhancement Program Placement Policy Placement Brochure Recruiters Speak Students Speak Highest Performers Placement Gallery\nCareer Planning and Development Division (CPDD)\nAssociated Recruiters\nRecruiters Speak\nHighest Performers\nEnquire Now\n15th\nAmongst Top Private Universities In India\n43rd\nAmongst Top Private and Government Universities In India\nQS World University Rankings 2026\nGalgotias University, located in Uttar Pradesh and sponsored by Smt. Shakuntala Educational and Welfare Society, has been recognized as a leading academic institution by achieving the highest benchmark in academic excellence with NAAC A+ accreditation in the first cycle. This remarkable achievement places Galgotias as one of the best private university with a NAAC score of 3.37 out of 4, awarded by the National Assessment and Accreditation Council (NAAC), and the highest graded autonomous institute of the UGC, Ministry of Education, Govt. of India.\nThe university began operations in the 2011-2012 academic session and welcomed its first batch of students in July 2011. Since then, it has grown to have more than 30K+ students. Today, with 20 schools offering over 200 programs, including Diploma, Undergraduate, Postgraduate, and PhD Programs, we rank among India’s top universities. We aim to become an internationally recognized institution that excels in multidisciplinary and interdisciplinary education, research, and innovation, producing graduates who are globally competitive and poised to become leaders in their fields. Graduates will possess deep knowledge in their chosen fields, strong problem-solving skills, an understanding of the societal context of their profession, effective teamwork abilities, excellent communication skills, and a commitment to lifelong learning.\nOur unwavering commitment to prioritize students is a core reason for consistent top rankings among universities around the globe. By maintaining a low student-to-faculty ratio, the university ensures that every student receives ample individual attention and personalized mentoring opportunities.\nQS has rated us for excellence with 5 stars in Teaching, Academic development, facilities, innovations and employability. We have earned numerous accolades for outstanding academic programs, including recognition as 'Excellent' in the ARIIA Ranking, UGC-12B status and DSIR SIRO. We are ranked amongst the top 101-150 ranking band in the Engineering category, 52nd ranking for Pharmacy, and 91st ranking for Management along with the ranking in top 50 in Innovations in the esteemed NIRF INDIA RANKINGS 2023, declared by the Ministry of Education.\nAt our university, students receive a world-class education that prepares them for success in their chosen careers. With state-of-the-art facilities, cutting-edge technology, and a wide range of programs and courses, we are dedicated for fostering graduates who are both academically strong and well-rounded individuals capable of making meaningful contributions to the society.\nTo be known globally for value based education, research, innovation, outreach and sustainable practices\nEnabling teaching learning ecosystem to support research and governance to achieve academic success\nEstablish state-of-the-art facilities for impactful education and research\nCollaborate with stakeholders to align with new age curriculum and skill development\nInvolvement in societal outreach programs to identify concerns and provide sustainable ethical solutions\nEncourage life-long learning and team-based problem-solving through an enabling environment\nGalgotias University has been known for its highest standards of education and its continuous efforts of nation-building by skill development in the young generation of the nation.\nThe Galgotias University believes and maintains the following Core Values in all its academic and management processes\nThe Galgotias University logo is more than a visual identity — it's a powerful representation of transformation, excellence, and rooted ambition. Every curve, color, and symbol within the logo reflects our journey as one of India’s fastest-growing private universities, dedicated to redefining higher education for the masses.\nSchool of Finance and Commerce\nSchool of Liberal Education\nSchool of Medical and Allied Sciences\nSchool of Nursing\nSchool of Allied Health Sciences\nSchool of Basic Sciences\nSchool of Media & Communication Studies\nSchool of Design\nSchool of Biosciences and Technology\nSchool of Vocational Education\nSchool of Life Long Learning\nCovid-19 Counselling Cell\nAdmission & Education Loan Assistance\nARIIA-2021\nTender & Vendor Registration\nViksit Bharat@2047: Voice of Youth\nInternal Quality Assurance Cell (IQAC)\nDPBH 2023\nGalgotias University Vision 2030\nGalgotias News Network (GNN)\nFees Payment\nSIH -2023 and 2024\nUGC PUBLIC SELF PORTAL\nGU Vision Plan_2030 21-01-2024\nAnnual Report-2022-23\nChat with an Ambassadors\n© 2025 Copyrights Galgotias. All rights reserved.\nDesigned, developed & maintained By : City Innovates\nSource: https://www.galgotiasuniversity.edu.in/p/about/vision-and-mission"
    },
    "placements": {
      "summary": "This text outlines various resources and aspects related to career planning and development, including placement services, recruiter information, student testimonials, and records. It specifically highlights the Career Planning and Development Division (CPDD), associated recruiters, and key elements like placement policies, brochures, and galleries.",
      "raw_content": "Placements Latest Placements Career Planning and Development Division (CPDD) Associated Recruiters Corporate Tie Ups Placement Records Employability Enhancement Program Placement Policy Placement Brochure Recruiters Speak Students Speak Highest Performers Placement Gallery\nCareer Planning and Development Division (CPDD)\nAssociated Recruiters\nRecruiters Speak\nHighest Performers"
    },
    "research": {
      "summary": "This document outlines various aspects of research at an institution, likely Galgotias University, emphasizing research excellence and global engagement. It details the functions of the Research & Development Cell and the Galgotias Centre for Interdisciplinary Research, alongside a list of key initiatives and achievements such as departmental publication summaries, organized events, international faculty development programs, research awards, citations, media outreach, and special recognitions like DSIR - SIRO.",
      "raw_content": "Research Message from Dean (Research)\nResearch Excellence and Global Engagement\nResearch & Development Cell\nGalgotias Centre for Interdisciplinary Research\nResearch Ethics Application Department wise Publication Summary Research Group Organized Events International & National Events International FDPs Research Awards Scopus Citation WoS Citation Newsletter Session with Noble Laureates DSIR - SIRO Recognition Centres of Excellence Media Outreach Research Group Diversity Open House Project for Students Honorary Professors Best Practices G-MRDC Centre of Excellence for Semiconductor Research\nMessage from Dean (Research)\nResearch Excellence and Global Engagement\nResearch & Development Cell\nGalgotias Centre for Interdisciplinary Research\nDepartment wise Publication Summary\nResearch Group Organized Events\nInternational & National Events\nSession with Noble Laureates\nDSIR - SIRO Recognition\nResearch Group Diversity\nOpen House Project for Students\nHonorary Professors\nCentre of Excellence for Semiconductor Research\n"
    },
    "campus_life": {
      "summary": "This document lists various aspects of campus life, including student organizations, clubs, hostel facilities, library, transportation, NCC, NSS, sports, cafeteria, healthcare, events, arts and culture, and specific initiatives like Smart India Hackathon 2022 and Toycathon Launchpad. The sections for National Cadet Corps (NCC), National Service Scheme (NSS), and Events, Arts & Culture are explicitly highlighted.",
      "raw_content": "Campus Life About the Campus Student Organization Societies & Clubs Hostel Library Transportation Services National Cadet Corps (NCC) National Service Scheme (NSS) Sports & Recreation Cafeteria Healthcare Facilities Unifest Events, Arts & Culture Resources & Facilities Convocation Smart India Hackathon 2022 Toycathon Launchpad\nNational Cadet Corps (NCC)\nNational Service Scheme (NSS)\nEvents, Arts & Culture"
    },
    "governance_and_compliance": {
      "summary": "The provided text lists various committees and online portals related to student and employee grievances, prevention of discrimination, and quality assurance. Key entities mentioned include committees for preventing caste-based discrimination and sexual harassment, online grievance redressal portals for students and employees, and the Internal Quality Assurance Cell (IQAC).",
      "raw_content": "Online Complaints Prevention of caste based discrimination at workplace committee Students Online portal for Redressal of Grievances Employee Online portal for Redressal of Grievances Anti-ragging Policy Complaint Committee for Prevention of Sexual Harassment\nPrevention of caste based discrimination at workplace committee\nStudents Online portal for Redressal of Grievances\nEmployee Online portal for Redressal of Grievances\nComplaint Committee for Prevention of Sexual Harassment\nInternal Quality Assurance Cell (IQAC)"
    },
    "university_ranking_and_recognition": {
      "summary": "The provided text highlights the university's strong performance in national and international rankings. It is recognized among the top private universities in India (15th) and top overall universities (43rd) by QS World University Rankings 2026, which also awarded it 5 stars for various aspects. Additionally, the university has received accolades such as ARIIA Ranking 'Excellent' status, UGC-12B and DSIR SIRO recognition. Specific NIRF INDIA RANKINGS 2023 placements include 101-150 in Engineering, 52nd in Pharmacy, 91st in Management, and a top 50 ranking for Innovations.",
      "raw_content": "15th\nAmongst Top Private Universities In India\n43rd\nAmongst Top Private and Government Universities In India\nQS World University Rankings 2026\nQS has rated us for excellence with 5 stars in Teaching, Academic development, facilities, innovations and employability. We have earned numerous accolades for outstanding academic programs, including recognition as 'Excellent' in the ARIIA Ranking, UGC-12B status and DSIR SIRO. We are ranked amongst the top 101-150 ranking band in the Engineering category, 52nd ranking for Pharmacy, and 91st ranking for Management along with the ranking in top 50 in Innovations in the esteemed NIRF INDIA RANKINGS 2023, declared by the Ministry of Education.\nARIIA-2021"
    },
    "financial_aid": {
      "summary": "The provided text highlights services related to financial aid and loan facilities, specifically mentioning assistance for admission and education loans.",
      "raw_content": "Financial Aid & Loan Facilities\nAdmission & Education Loan Assistance"
    },
    "events_and_initiatives": {
      "summary": "The provided text lists various initiatives and events, including the Smart India Hackathon (SIH) for 2022, 2023, and 2024, the Toycathon Launchpad, Unifest events focused on arts and culture, the Viksit Bharat@2047: Voice of Youth initiative, and DPBH 2023.",
      "raw_content": "Smart India Hackathon 2022\nToycathon Launchpad\nUnifest Events, Arts & Culture\nViksit Bharat@2047: Voice of Youth\nDPBH 2023\nSIH -2023 and 2024"
    },
    "university_values_and_mission": {
      "summary": "Galgotias University aims to be a globally recognized institution for value-based education, research, innovation, outreach, and sustainable practices. The university is committed to fostering a teaching and learning ecosystem that supports research and governance for academic success, establishing state-of-the-art facilities, and collaborating with stakeholders to align with modern curricula and skill development. It actively engages in societal outreach to address concerns with ethical and sustainable solutions, and encourages lifelong learning and teamwork. Galgotias University is dedicated to nation-building through skill development and upholds core values in all its processes, with its logo symbolizing transformation and excellence as one of India's fastest-growing private universities. This vision is further detailed in the Galgotias University Vision 2030 plan.",
      "raw_content": "To be known globally for value based education, research, innovation, outreach and sustainable practices\nEnabling teaching learning ecosystem to support research and governance to achieve academic success\nEstablish state-of-the-art facilities for impactful education and research\nCollaborate with stakeholders to align with new age curriculum and skill development\nInvolvement in societal outreach programs to identify concerns and provide sustainable ethical solutions\nEncourage life-long learning and team-based problem-solving through an enabling environment\nGalgotias University has been known for its highest standards of education and its continuous efforts of nation-building by skill development in the young generation of the nation.\nThe Galgotias University believes and maintains the following Core Values in all its academic and management processes\nThe Galgotias University logo is more than a visual identity — it's a powerful representation of transformation, excellence, and rooted ambition. Every curve, color, and symbol within the logo reflects our journey as one of India’s fastest-growing private universities, dedicated to redefining higher education for the masses.\nGalgotias University Vision 2030\nGU Vision Plan_2030 21-01-2024"
    },
    "documentation": {
      "summary": "This text provides a list of downloadable documents related to admissions and institutional information, including brochures, forms, admission documents, an undertaking, a refund policy, and the annual report for 2022-23.",
      "raw_content": "Download Brochure\nDownload Forms\nAdmission Documents & Undertaking\nRefund Policy\nDownload Brochure\nAnnual Report-2022-23"
    }
  }
}