{
  "source_file": "www.sharda.ac.in_Best_Dental_Science_College_in_Delhi_NCR_Admissions_2025_raw_2025-08-10-18-29-11.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text provides a directory of various programs, schools, and initiatives at Sharda University, including the School of Dental Sciences, School of Medical Sciences & Research, and Sharda School of Nursing Science & Research. It also lists academic resources like examination reports, the Academic Bank of Credits, and curriculum feedback, alongside university information, student support services, and recent news and events such as white coat ceremonies, orientation programs, and conferences.",
      "raw_content": "• Programme 2025-26\n• School of Dental Sciences\nSchool of Medical Sciences & Research\nSharda School of Nursing Science & Research\n• School of Medical Sciences & Research\n• Sharda School of Nursing Science & Research\nExamination Annual Report\nAcademic Bank of Credits (ABC)\nCurricula Feedback\nUniversity Brochure\n• Examination Annual Report\n• Academic Bank of Credits (ABC)\n• Curricula Feedback\n• University Brochure\n• Get to know sharda\n• Perspective Plan\n• Leadership\n• History\n• Statutory Bodies of the University\n• Sharda Tenders\n• Act, Statutes and Ordinances\n• COVID19\n• Family & Couple Counselling Services(FCCS)\n• Capacity Development & Skill Enhancement\n• Language and Communication Skill Initiatives: Sharda Skills\n• Soft Skill Initiatives : Career Counseling and Development Center\n• Awareness of Trends in Technology : IIC\n• Entrepreneurship\n• Innovation and Entrepreneurship\nFM Radio: Suno Sharda-90.8FM\n• FM Radio: Suno Sharda-90.8FM\nGuidelines for Visa and FRO/FRRO\nGuidelines for Medical Insurance\nObservership Programmes\n• Guidelines for Visa and FRO/FRRO\n• Guidelines for Medical Insurance\n• Observership Programmes\nParamarsh- Our Mentoring Portal\n• Paramarsh- Our Mentoring Portal\nSchool of Dental Sciences\nCREATING ACHIEVERS IN DENTAL SCIENCE\n• Recruiters\nSchool of Dental Sciences is a world-class platform where students and faculty cooperate in interdisciplinary education and research that serves its students and patient community, resulting in a well-rounded curriculum that produces dentists tremendously skilled in the art and science of dentistry.\nUnder the direction of exceptionally experienced faculty, students pursue a rigorous course of study at a nationally ranked college through their various degree and certificate programs. Clinics within the college accept patients of all ages.\nSDS is recognised for its oral health research which emphasises on infectious diseases in dentistry, bone biology, pain and neurosciences, and other research to improve clinical and dental care.\n• 95+\n• 135+\n• 30000+\n• 1100+\nWhat’s Happening in School\n01 Sep 2023\nWhite coat ceremony held at Sharda University\nOn Friday, September 1, 2023, a white coat ceremony was held for MBBS and BDS...\n22 Aug 2023\nSharda University Orientation Programme 2023-24\nIt was an exhilarating start to Sharda Universit...\n04 Apr 2023\n7th World Dental Sciences and Oral Health Conference\" Organized by CynoDent & Indian Society of Dentistry in Collaboration with SDS\n\"7th World Dental Sciences and Oral Health Conference\" Organized by CynoDent ...\n03 Dec 2022\nNavotsav 22- A Freshers Night organized by Sharda University\nOn December 3, 2022, the Student Council, the Cu...\n23 Nov 2022\nSharda University won the Award for “Excellence in Globalization of Education in India” at the FICCI Higher Education Excellence Summit 2022\nIt is a great pleasure to announce that Sharda U...\n05 Nov 2022\nMega Job cum Internship Fair of Law on 5th Nov 2022\n11 Oct 2022\nSharda University Greater Noida Campus organizes 6th Convocation Ceremony\nThe 6th Convocation Ceremony was organized at Sh...\n03 Oct 2022\nSharda University organized Mata ki Chowki and Dandiya Night\nStudents of Sharda University organized Mata ki ...\n30 Sep 2022\nSharda University student makes his debut Tamil super hit “AkasaVeedhilo”\nSharda University always encourages its students...\n12 Sep 2022\nSharda University organized Orientation Programme for Fresh Batch 2022-23\nSharda University conducted an orientation progr...\n• Covid 19 Updates\n• Sharda University Uzbekistan\n• Sharda University Agra\n• Courses on Human Values and Professional ethics\n• National Cyber Crime Reporting Portal\n• International Credit Transfer Programme"
    },
    "event_info": {
      "summary": "This text provides a chronological list of announcements and events at Sharda University from August 2022 to April 2023. Key events include the 6th Convocation, various examination schedules, a cyber security training program, a celebrity night, and notifications regarding tuition fees, holidays, and committee appointments.",
      "raw_content": "• 12 Apr 2023\nNotification for Payment of Tuition Fee by the continuing students for the Acade...\n• 27 Mar 2023\nSchool of Dental sciences and Cynodent organizing 7th World Dental Sciences and ...\n• 28 Feb 2023\nExamination Schedule announced for Mid-Semester Theory Examination; 2nd Year onw...\n• 16 Dec 2022\nTwo Week Certifcate Training Program on \"CYBER SECURITY AND DIGITAL FORENSIC: CS...\n• 01 Dec 2022\nSharda University is organizing Celebrity Night Navotsav 22 Freshers Party on 3r...\n• 30 Nov 2022\nNotification for List of Holidays for the Year 2023 (Except SMSR and Sharda Hosp...\n• 12 Nov 2022\nNotification for Proctorial Committee of Sharda University 12-11-22\n• 17 Oct 2022\nExamination on Demand for students admitted in Academic Year 2021-22\n• 04 Oct 2022\nNotification of Suspension of classes on account of 6th Convocation ceremony\n• 30 Sep 2022\n6th Convocation - Vice Chancellor's Gold Medal and Certificate of Merit List\n• 28 Sep 2022\nNotification for 6th Convocation of Sharda University\n• 17 Aug 2022\nNotification for Re-constitution of Anti-Ragging Committee for the Academic Year...\nOffice Order- Prof. (Dr.) Rashmi Priyadarshini appointment as Associate Dean, Ac...\n• 05 Aug 2022\nOffice Order- Prof. (Dr.) Madhukar M. Deshmukh appointed as the Director of Indu..."
    },
    "testimonials": {
      "summary": "Multiple students from Sharda University, specifically from the School of Dental Sciences, express overwhelmingly positive experiences during their undergraduate and postgraduate studies. They highlight the university's diverse culture, vibrant campus life, supportive faculty who are experts in their fields, and the opportunities provided for personal and professional growth. Many credit Sharda University with boosting their confidence, broadening their horizons, and significantly contributing to their career prospects, with some specifically mentioning successful placements.",
      "raw_content": "I was always told in my childhood that college days are the best days. When I joined School of Dental Sciences, Sharda University for my undergraduate programme, I realised how true the saying was. Living in a campus with such diverse culture and so many different extra curriculum activities, you learn so much about life and that helps you grow and become wise as a person. Joining Sharda University has been the best decision for my career prospects and has indeed been the best experience of my life.\nSharda University is a great home -away-from- home anyone could ever have. What a great atmosphere- what a great bunch of students- what an institute what an incredible staff! I am glad, I am part of this truly global university\nBDS, 4th Year\nSharda University is a wonderful institution. There are people from different cultures here, and that interests me. I like the campus life a lot!\nBDS, 3rd Year\nI am a proud Shardan who had an enriching learning experience during both my undergraduate and post graduate time. The faculties here are experts in their field and were able to extract the best out of me. I have been able to reinvent myself into a more confident individual and able to broaden my horizons. I can proudly say that Sharda University has made me a better person individually as well as professionally. I am blessed to be a part of Sharda family.\nMDS, 3rd Year\n“From the journey of nothing to everything!\nSharda University has been a turning point to my career. The growth and opportunities that I received from the University are great, I never had a confidence to crack highest placements packages but the University had that confidence in me. The faculty, the placement team works really hard on students to build up their career. I'm grateful and will always be grateful to the University for being such an important support system.”\nSpecial thanks to Dean, Faculty Members School of Dental Sciences and Placement Cell of Sharda University\nBDS, 2021\nPlaced In : Pharmalex India Private Limited...\nI just completed my Dentistry from Sharda University It has been a turning point to my career. Education is the most powerful tool anyone can use to achieve their goals. The growth and opportunities that I received from the University are great, I never had a confidence to crack highest placements packages but the University had that confidence in me. The faculty, the placement team works really hard on students to build up their career. I'm grateful and will always be grateful to the University for being such an important support system. Thank you for helping me to get closer to achieving my goals in life.”\nPlaced In : eExpedise Health care Pvt. Ltd"
    }
  }
}