{
  "source_file": "www.galgotiasuniversity.edu.in_Our_Legacy_Galgotias_University_raw_2025-08-10-18-45-11.txt",
  "structured_data": {
    "general_info": {
      "summary": "The provided text offers a comprehensive overview of Galgotias University, detailing its academic offerings, campus life, administrative sections, research initiatives, and achievements. It highlights the university's commitment to quality education, student-centric approach, and strong placement records, as well as its legacy and future vision. The text also includes information for international students and various contact and operational portals.",
      "raw_content": "• India Today Media Institute\n• International Admissions About International Office Clubs for International Students International student programs Foundation and Bridge Courses for International Students Message from Director International Relations Programmes and Fees Scholarships Eligibility Admission Process Preparatory English Foundation Program Pre & Post Arrival Information for International Students International Students Grievances Wing Visa and FRRO Support International Apply Now Contact Us FAQs Download Brochure Testimonials Events Study in India\n• Clubs for International Students\n• Foundation and Bridge Courses for International Students\n• Message from Director International Relations\n• Programmes and Fees\n• Scholarships\n• Preparatory English Foundation Program\n• Pre & Post Arrival Information for International Students\n• International Students Grievances Wing\n• Visa and FRRO Support\n• Login Employee Login Student Login LMS Login\n• Campus Life About the Campus Student Organization Societies & Clubs Hostel Library Transportation Services National Cadet Corps (NCC) National Service Scheme (NSS) Sports & Recreation Cafeteria Healthcare Facilities Unifest Events, Arts & Culture Resources & Facilities Convocation Smart India Hackathon 2022 Toycathon Launchpad\n• National Cadet Corps (NCC)\n• National Service Scheme (NSS)\n• Events, Arts & Culture\n• Smart India Hackathon 2022\n• Online Complaints Prevention of caste based discrimination at workplace committee Students Online portal for Redressal of Grievances Employee Online portal for Redressal of Grievances Anti-ragging Policy Complaint Committee for Prevention of Sexual Harassment\n• Prevention of caste based discrimination at workplace committee\n• Students Online portal for Redressal of Grievances\n• Employee Online portal for Redressal of Grievances\n• Complaint Committee for Prevention of Sexual Harassment\n• About GU About Us Galgotias University Our Legacy The Galgotias Story Leadership Governance International Academic Team Awards, Rankings & Certifications Accreditations Mandatory Disclosures Policies & Regulations Partnerships & Collaborations iOS Development Center Virtual tour\n• Galgotias University\n• Leadership\n• Awards, Rankings & Certifications\n• Partnerships & Collaborations\n• Schools School of Defence Technology School of Computer Science & Engineering School of Artificial Intelligence School of Aviation, Logistics & Tourism Management School of Computer Applications & Technology School of Engineering School of Business School of Law View More\n• School of Defence Technology\nSchool of Defence Technology\n• School of Computer Science & Engineering\nSchool of Computer Science & Engineering\n• School of Artificial Intelligence\nSchool of Artificial Intelligence\n• School of Aviation, Logistics & Tourism Management\nSchool of Aviation, Logistics & Tourism Management\n• School of Computer Applications & Technology\nSchool of Computer Applications & Technology\n• Programs Under Graduate Programs Diploma Programs Post Graduate Programs Doctoral Programs Certificate Programs Programs for working professionals Online Courses\n• Programs for working professionals\nPrograms for working professionals\n• Online Courses\nOnline Courses\nFee Structure & Eligibility Scholarships Hostel Lateral Entry/Migration Admission Financial Aid & Loan Facilities\nAdmission Documents & Undertaking Approvals & Accreditations Transportation Services Ph.D Admission Refund Policy Download Brochure Admission Helpline\n• Fee Structure & Eligibility\n• Financial Aid & Loan Facilities\n• Admission Documents & Undertaking\n• Research Message from Dean (Research)\nResearch Excellence and Global Engagement\nResearch & Development Cell\nGalgotias Centre for Interdisciplinary Research\nResearch Ethics Application Department wise Publication Summary Research Group Organized Events International & National Events International FDPs Research Awards Scopus Citation WoS Citation Newsletter Session with Noble Laureates DSIR - SIRO Recognition Centres of Excellence Media Outreach Research Group Diversity Open House Project for Students Honorary Professors Best Practices G-MRDC Centre of Excellence for Semiconductor Research\n• Message from Dean (Research)\n• Research Excellence and Global Engagement\n• Research & Development Cell\n• Galgotias Centre for Interdisciplinary Research\n• Department wise Publication Summary\n• Research Group Organized Events\n• International & National Events\n• Session with Noble Laureates\n• DSIR - SIRO Recognition\n• Research Group Diversity\n• Open House Project for Students\n• Honorary Professors\n• Centre of Excellence for Semiconductor Research\n• Academics Academics Academic Calendar Learning Model & Choice Based Credit System MOUs Curriculum Design and Development Examination Cell NEP-2020 Download Forms Awards Holiday List Achievements\n• Learning Model & Choice Based Credit System\n• Curriculum Design and Development\n• NEP-2020\n• Placements Latest Placements Career Planning and Development Division (CPDD) Associated Recruiters Corporate Tie Ups Placement Records Employability Enhancement Program Placement Policy Placement Brochure Recruiters Speak Students Speak Highest Performers Placement Gallery\n• Career Planning and Development Division (CPDD)\n• Associated Recruiters\n• Recruiters Speak\n• Highest Performers\nEnquire Now\n15th\nAmongst Top Private Universities In India\n43rd\nAmongst Top Private and Government Universities In India\nQS World University Rankings 2026\nGalgotias University, part of the Galgotias Education Group which was established in 1933, has a rich legacy of providing quality education in India. Since its inception, the university has been dedicated to delivering academic excellence to its students. Recognized by the University Grants Commission (UGC), Galgotias University is spread across a 52-acre state-of-the-art campus that boasts facilities comparable to the best universities in the world.\nGalgotias University is committed to offering world-class education and research opportunities that are on par with international standards. With its highly qualified faculty members, cutting-edge facilities, and top-notch academic programs, Galgotias University is on track to becoming a globally recognized institution of higher learning that nurtures human resources to contribute to the community and develop science.\nThe university takes pride in its 'students-first' philosophy, which has helped it achieve consistently high rankings among India's top universities. With a low student-to-faculty ratio, the focus is on providing personalized attention and mentoring to each student. Galgotias University aims to produce graduates who not only have in-depth knowledge of their fields but also possess excellent problem-solving skills, a keen awareness of the societal context of their chosen profession, the ability to work effectively in teams, strong communication skills, and a commitment to lifelong learning.\nSince the first batch of students was admitted in July 2011, Galgotias University has grown to accommodate more than 25,000 students in a diverse range of programs, including polytechnic, undergraduate, postgraduate, and PhD courses. The university has approvals from various councils, including the Pharmacy Council of India (PCI), Bar Council of India (BCI), Indian Nursing Council (INC), National Council for Teacher Education (NCTE), and Norms of National Council for Hotel Management (NCHM), among others.\nGalgotias University prides itself on its record-breaking placements, which are a testament to its focus on maintaining the highest academic standards. The university is committed to providing its students with the best possible education and opportunities for personal and professional growth. With its multidisciplinary and interdisciplinary approach to education and research, Galgotias University is poised to become a world-class institution that produces globally competitive graduates capable of becoming leaders in their fields.\nBook published by Galgotia publication on environment being released by President Shri Zail Singh along with the author.\nShri Narendra Modi, Prime Minister of India conferring The DQ ICT Award to Shri Suneel Galgotia, Chancellor, Galgotias University for Ranking University in Academics & Global Linkages and Ranked among Top Institutions in India for Placements.\nVisit of Mr. Rajat sharma from India TV at Galgotia’s College of Engineering and Technology.\nChairman Shri Suneel Galgotia, with the first NBA team visiting Galgotias College of Engineering and Technology.\nShri Suneel Galgotia, the founder and Chancellor of Galgotias University, along with CEO Shri Dhruv Galgotia, held a meeting with the Chief Minister of Uttar Pradesh, Shri Yogi Adityanath, to discuss the state's multifaceted development. During the meeting, CM Shri Yogi Adityanath acknowledged Galgotias University's contributions to education and innovation, recognizing its potential to shape the future of Uttar Pradesh.\nShri Dhruv Galgotia, CEO, Galgotias University with Her Excellency Hon’ble Smt. Anandiben Patel, Governor of Uttar Pradesh at Raj Bhawan, Lucknow\n• School of Finance and Commerce\n• School of Liberal Education\n• School of Medical and Allied Sciences\n• School of Nursing\n• School of Allied Health Sciences\n• School of Basic Sciences\n• School of Media & Communication Studies\n• School of Design\n• School of Biosciences and Technology\n• School of Vocational Education\n• School of Life Long Learning\n• Covid-19 Counselling Cell\n• Admission & Education Loan Assistance\n• ARIIA-2021\n• Tender & Vendor Registration\n• Viksit Bharat@2047: Voice of Youth\n• Internal Quality Assurance Cell (IQAC)\n• DPBH 2023\n• Galgotias University Vision 2030\n• Galgotias News Network (GNN)\n• Fees Payment\n• SIH -2023 and 2024\n• GU Vision Plan_2030 21-01-2024\n• Annual Report-2022-23\n• Chat with an Ambassadors\n• © 2025 Copyrights Galgotias. All rights reserved.\n• Designed, developed & maintained By : City Innovates\nSource: https://www.galgotiasuniversity.edu.in/p/about/our-legacy"
    },
    "research": {
      "summary": "The provided text outlines various aspects of research and global engagement within an academic institution, likely Galgotias University. It lists key departments and initiatives such as the Research & Development Cell, Galgotias Centre for Interdisciplinary Research, and specific programs like \"Session with Noble Laureates\" and \"DSIR - SIRO Recognition.\" The content also touches upon research ethics, publication summaries, organized events (both international and national), research group diversity, honorary professors, and centers of excellence, particularly one focused on semiconductor research.",
      "raw_content": "• Research Message from Dean (Research)\nResearch Excellence and Global Engagement\nResearch & Development Cell\nGalgotias Centre for Interdisciplinary Research\nResearch Ethics Application Department wise Publication Summary Research Group Organized Events International & National Events International FDPs Research Awards Scopus Citation WoS Citation Newsletter Session with Noble Laureates DSIR - SIRO Recognition Centres of Excellence Media Outreach Research Group Diversity Open House Project for Students Honorary Professors Best Practices G-MRDC Centre of Excellence for Semiconductor Research\n• Message from Dean (Research)\n• Research Excellence and Global Engagement\n• Research & Development Cell\n• Galgotias Centre for Interdisciplinary Research\n• Department wise Publication Summary\n• Research Group Organized Events\n• International & National Events\n• Session with Noble Laureates\n• DSIR - SIRO Recognition\n• Research Group Diversity\n• Open House Project for Students\n• Honorary Professors\n• Centre of Excellence for Semiconductor Research"
    },
    "placements": {
      "summary": "This text outlines resources and sections related to student placements and career development, including information on the Career Planning and Development Division (CPDD), associated recruiters, placement records, employability enhancement programs, placement policies, and testimonials from recruiters and students.",
      "raw_content": "• Placements Latest Placements Career Planning and Development Division (CPDD) Associated Recruiters Corporate Tie Ups Placement Records Employability Enhancement Program Placement Policy Placement Brochure Recruiters Speak Students Speak Highest Performers Placement Gallery\n• Career Planning and Development Division (CPDD)\n• Associated Recruiters\n• Recruiters Speak\n• Highest Performers"
    },
    "university_ranking": {
      "summary": "The provided text highlights that the institution ranks 15th among the top private universities in India and 43rd among all private and government universities in India, according to the QS World University Rankings 2026.",
      "raw_content": "15th\nAmongst Top Private Universities In India\n43rd\nAmongst Top Private and Government Universities In India\nQS World University Rankings 2026"
    },
    "academic_approvals": {
      "summary": "The provided text lists three key items: the UGC Public Self Portal, Approvals & Accreditations, and ARIIA-2021, likely referring to components or initiatives related to educational institutions in India.",
      "raw_content": "• UGC PUBLIC SELF PORTAL\n• Approvals & Accreditations\n• ARIIA-2021"
    },
    "governance_and_policies": {
      "summary": "The provided text lists various committees and online portals established to address grievances and prevent discrimination and harassment in an organization or educational institution. These include a committee for preventing caste-based discrimination, online grievance redressal portals for both students and employees, a committee for preventing sexual harassment, and mentions of policies, regulations, and the Internal Quality Assurance Cell (IQAC).",
      "raw_content": "• Prevention of caste based discrimination at workplace committee\n• Students Online portal for Redressal of Grievances\n• Employee Online portal for Redressal of Grievances\n• Complaint Committee for Prevention of Sexual Harassment\n• Policies & Regulations\n• Internal Quality Assurance Cell (IQAC)"
    },
    "campus_life_and_activities": {
      "summary": "The provided text outlines various aspects of campus life, including student organizations, clubs, hostels, libraries, transportation, and recreational facilities like NCC, NSS, and sports. It also highlights specific events and initiatives such as Unifest, Arts & Culture, and the Smart India Hackathon 2022.",
      "raw_content": "• Campus Life About the Campus Student Organization Societies & Clubs Hostel Library Transportation Services National Cadet Corps (NCC) National Service Scheme (NSS) Sports & Recreation Cafeteria Healthcare Facilities Unifest Events, Arts & Culture Resources & Facilities Convocation Smart India Hackathon 2022 Toycathon Launchpad\n• National Cadet Corps (NCC)\n• National Service Scheme (NSS)\n• Events, Arts & Culture\n• Smart India Hackathon 2022\n• Unifest"
    },
    "schools": {
      "summary": "The provided text lists various schools within an institution, covering a broad range of disciplines including defense technology, computer science and engineering, artificial intelligence, aviation, logistics, tourism management, computer applications, engineering, business, law, finance, commerce, liberal education, medical sciences, nursing, allied health sciences, basic sciences, media and communication studies, design, biosciences, technology, vocational education, and lifelong learning.",
      "raw_content": "• Schools School of Defence Technology School of Computer Science & Engineering School of Artificial Intelligence School of Aviation, Logistics & Tourism Management School of Computer Applications & Technology School of Engineering School of Business School of Law View More\n• School of Defence Technology\nSchool of Defence Technology\n• School of Computer Science & Engineering\nSchool of Computer Science & Engineering\n• School of Artificial Intelligence\nSchool of Artificial Intelligence\n• School of Aviation, Logistics & Tourism Management\nSchool of Aviation, Logistics & Tourism Management\n• School of Computer Applications & Technology\nSchool of Computer Applications & Technology\n• School of Finance and Commerce\n• School of Liberal Education\n• School of Medical and Allied Sciences\n• School of Nursing\n• School of Allied Health Sciences\n• School of Basic Sciences\n• School of Media & Communication Studies\n• School of Design\n• School of Biosciences and Technology\n• School of Vocational Education\n• School of Life Long Learning"
    },
    "downloads": {
      "summary": "This text lists various downloadable documents, including a brochure, admission documents, undertaking, forms, a placement brochure, and the GU Vision Plan for 2030 dated January 21, 2024.",
      "raw_content": "• Download Brochure\n• Admission Documents & Undertaking\n• Download Forms\n• Placement Brochure\n• GU Vision Plan_2030 21-01-2024"
    },
    "events_and_recognition": {
      "summary": "The provided text details several notable events and achievements related to Galgotias University and its associated institutions. These include a book launch on the environment, the university receiving an ICT Award from Prime Minister Narendra Modi, visits from media personalities and sports teams, and important meetings held by Chancellor Suneel Galgotia and CEO Dhruv Galgotia with the Chief Minister and Governor of Uttar Pradesh to discuss the state's development and the university's contributions. The text also mentions participation in DPBH 2023 and SIH -2023 and 2024.",
      "raw_content": "• Book published by Galgotia publication on environment being released by President Shri Zail Singh along with the author.\n• Shri Narendra Modi, Prime Minister of India conferring The DQ ICT Award to Shri Suneel Galgotia, Chancellor, Galgotias University for Ranking University in Academics & Global Linkages and Ranked among Top Institutions in India for Placements.\n• Visit of Mr. Rajat sharma from India TV at Galgotia’s College of Engineering and Technology.\n• Chairman Shri Suneel Galgotia, with the first NBA team visiting Galgotias College of Engineering and Technology.\n• Shri Suneel Galgotia, the founder and Chancellor of Galgotias University, along with CEO Shri Dhruv Galgotia, held a meeting with the Chief Minister of Uttar Pradesh, Shri Yogi Adityanath, to discuss the state's multifaceted development. During the meeting, CM Shri Yogi Adityanath acknowledged Galgotias University's contributions to education and innovation, recognizing its potential to shape the future of Uttar Pradesh.\n• Shri Dhruv Galgotia, CEO, Galgotias University with Her Excellency Hon’ble Smt. Anandiben Patel, Governor of Uttar Pradesh at Raj Bhawan, Lucknow\n• DPBH 2023\n• SIH -2023 and 2024"
    },
    "legal_and_compliance": {
      "summary": "This document lists three key committees and policies designed to prevent discrimination and harassment in the workplace: a committee for preventing caste-based discrimination, an anti-ragging policy, and a complaint committee for the prevention of sexual harassment.",
      "raw_content": "• Prevention of caste based discrimination at workplace committee\n• Anti-ragging Policy\n• Complaint Committee for Prevention of Sexual Harassment"
    },
    "digital_initiatives": {
      "summary": "This text appears to be a header or a title block, possibly from a publication or event. It mentions \"Viksit Bharat@2047: Voice of Youth\" and \"Galgotias News Network (GNN)\".",
      "raw_content": "• Viksit Bharat@2047: Voice of Youth\n• Galgotias News Network (GNN)"
    },
    "other_services": {
      "summary": "This text lists three key services or functions: a Covid-19 Counselling Cell, assistance with admission and education loans, and tender and vendor registration processes.",
      "raw_content": "• Covid-19 Counselling Cell\n• Admission & Education Loan Assistance\n• Tender & Vendor Registration"
    }
  }
}