{
  "source_file": "www.sharda.ac.in_MDS_Oral_Pathology_Microbiology_Fees_Eligibility_Syllabus_raw_2025-08-10-18-29-16.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text appears to be a list of various links or topics, possibly from a website or internal communication. It includes an invitation to pursue a career in dentistry, information for recruiters, COVID-19 updates, details about Sharda University campuses in Uzbekistan and Agra, courses on human values and professional ethics, a national cyber crime reporting portal, and an international credit transfer program.",
      "raw_content": "Take the next step towards a career in dental.\n• Recruiters\n• Covid 19 Updates\n• Sharda University Uzbekistan\n• Sharda University Agra\n• Courses on Human Values and Professional ethics\n• National Cyber Crime Reporting Portal\n• International Credit Transfer Programme"
    },
    "career_path": {
      "summary": "This text outlines various career paths available after completing a course, including roles as an Oral Pathologist in hospital labs, opening a specialized Maxillofacial Pathology laboratory, teaching in dental institutes, research positions in organizations like ICMR, pursuing PhDs, working in public sector undertakings or the Indian Army Dental Corps, employment in corporate hospitals and dental clinics, establishing a private clinic, opening a tobacco cessation center, and specializing as a forensic odontologist.",
      "raw_content": "Career path you can choose after the course\n• Consultant Oral Pathologist in the Pathology labs attached to Hospitals and Medical Centres.\n• Opportunity to open up a specialized Maxillofacial Pathology laboratory.\n• Teaching Jobs in dental Institutes across India in the Department of Oral & Maxillofacial Pathology.\n• Provision to join as a researcher in various reputed Government organizations like ICMR.\n• Can opt for PhD programmes.\n• Jobs in public sector undertaking (PSU) and Jobs in Indian Army Dental Corps.\n• Jobs in corporate hospitals and Dental Chain of Clinics.\n• Can become an entrepreneur to establish a clinic.\n• Can open Tobacco cessation centre.\n• Scope as forensic odontologist."
    }
  }
}