{
  "source_file": "www.sharda.ac.in_Best_School_of_Education_in_Greater_Noida_-_Admissions_2025_raw_2025-08-10-18-29-11.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text emphasizes the importance of making education systems adaptable and effective for teacher training, suggesting a focus on creating endless opportunities within this field.",
      "raw_content": "Making Education work for endless possibilities in Teacher Training"
    },
    "events": {
      "summary": "This text provides a chronological list of events and achievements at Sharda University between September 2022 and August 2023. Highlights include the Orientation Programme for the 2023-24 and 2022-23 batches, a Freshers Night named Navotsav '22, winning an award for \"Excellence in Globalization of Education in India,\" a Mega Job cum Internship Fair for Law students, the 6th Convocation Ceremony, cultural events like Mata ki Chowki and Dandiya Night, and a student's debut in a Tamil film.",
      "raw_content": "What’s Happening in School\n22 Aug 2023\nSharda University Orientation Programme 2023-24\nIt was an exhilarating start to Sharda Universit...\n03 Dec 2022\nNavotsav 22- A Freshers Night organized by Sharda University\nOn December 3, 2022, the Student Council, the Cu...\n23 Nov 2022\nSharda University won the Award for “Excellence in Globalization of Education in India” at the FICCI Higher Education Excellence Summit 2022\nIt is a great pleasure to announce that Sharda U...\n05 Nov 2022\nMega Job cum Internship Fair of Law on 5th Nov 2022\n11 Oct 2022\nSharda University Greater Noida Campus organizes 6th Convocation Ceremony\nThe 6th Convocation Ceremony was organized at Sh...\n03 Oct 2022\nSharda University organized Mata ki Chowki and Dandiya Night\nStudents of Sharda University organized Mata ki ...\n30 Sep 2022\nSharda University student makes his debut Tamil super hit “AkasaVeedhilo”\nSharda University always encourages its students...\n12 Sep 2022\nSharda University organized Orientation Programme for Fresh Batch 2022-23\nSharda University conducted an orientation progr..."
    },
    "academic_calendar": {
      "summary": "This document contains a chronological list of announcements and notifications from Sharda University, primarily concerning examination schedules for various terms and semesters, PhD admissions, tuition fee payments, and appointments. It also includes information about a certificate training program, a freshers' party, a list of holidays, and details related to the university's convocation ceremony.",
      "raw_content": "• 04 Oct 2024\nAppointment of Dr. Sarita Verma as Professor In-charge, School of Education\n• 14 Aug 2023\nExamination Schedule of ESE of Special Examination of 1st Year; Term-2212\n• 15 Jul 2023\nSchedule of End-Semester Theory Examination Term-2211; 2022-23\n• 07 Jul 2023\nExamination Schedule for Mid-Semester Theory Examination 2022-23 (Term-2211)\n• 09 Jun 2023\nExamination Schedule announced for the End-Semester Theory Examination of Even S...\n• 16 May 2023\nAdvertisement For Ph.D. Admissions July 2023 Batch\n• 09 May 2023\n• 23 Apr 2023\nSchedule of Mid Semester Theory Examination Term-2202; 2nd Semester (2022-23)\n• 12 Apr 2023\nNotification for Payment of Tuition Fee by the continuing students for the Acade...\n• 28 Feb 2023\nExamination Schedule announced for Mid-Semester Theory Examination; 2nd Year onw...\n• 22 Feb 2023\nList of Selected Candidates in Ph.D. Entrance Examination_Jan 2023 Batch\n• 31 Jan 2023\nExamination Schedule announced for End-Semester Theory Examination; 2022-23 (Te...\n• 21 Jan 2023\nAdvertisement for Ph.D. Admissions Jan 2023 Batch\n• 02 Jan 2023\nNotification for Tuition fee payment dates for continuing students of First Year...\n• 16 Dec 2022\nTwo Week Certifcate Training Program on \"CYBER SECURITY AND DIGITAL FORENSIC: CS...\n• 01 Dec 2022\nSharda University is organizing Celebrity Night Navotsav 22 Freshers Party on 3r...\n• 30 Nov 2022\nNotification for List of Holidays for the Year 2023 (Except SMSR and Sharda Hosp...\n• 12 Nov 2022\nNotification for Proctorial Committee of Sharda University 12-11-22\n• 17 Oct 2022\nExamination on Demand for students admitted in Academic Year 2021-22\n• 04 Oct 2022\nNotification of Suspension of classes on account of 6th Convocation ceremony\n• 30 Sep 2022\n6th Convocation - Vice Chancellor's Gold Medal and Certificate of Merit List\n• 28 Sep 2022\nNotification for 6th Convocation of Sharda University"
    },
    "affiliation_partnerships": {
      "summary": "The provided text consists of a heading and a subheading, both stating \"Observership Programmes\". This indicates that the topic being discussed pertains to observership programs.",
      "raw_content": "Observership Programmes\n• Observership Programmes\n"
    },
    "resources": {
      "summary": "The provided text consists of a title, \"Paramarsh- Our Mentoring Portal,\" which is repeated.",
      "raw_content": "Paramarsh- Our Mentoring Portal\n• Paramarsh- Our Mentoring Portal"
    },
    "guidelines": {
      "summary": "This document provides guidelines related to visas, the Foreigners Regional Registration Office (FRRO), and medical insurance, as indicated by a list of applicable guidelines.",
      "raw_content": "Guidelines for Visa and FRO/FRRO\nGuidelines for Medical Insurance\n• Guidelines for Visa and FRO/FRRO\n• Guidelines for Medical Insurance\n"
    }
  }
}