{
  "source_file": "www.sharda.ac.in_BA_Animation_VFX_Gaming_Design_hons_with_Research_raw_2025-08-10-18-29-19.txt",
  "structured_data": {
    "general_info": {
      "summary": "This document outlines various aspects of Sharda University, including its academic programs like the School of Dental Sciences, School of Medical Sciences & Research, and Sharda School of Nursing Science & Research. It also details administrative and support functions such as examination reports, the Academic Bank of Credits, curricula feedback, and university brochures. Additionally, it highlights student development initiatives like capacity building, language skills, soft skills, entrepreneurship, and innovation, along with outreach programs like FM Radio and mentoring portals. A specific program, B.Sc. (Hons./By Research) Animation, VFX & Gaming Design, is detailed with its Program Educational Objectives (PEOs) and Program Outcomes (POs), along with a link to its curricula for the 2024-25 academic year. Finally, it includes information on university branches, important portals, and various guidelines.",
      "raw_content": "• Programme 2025-26\n• School of Dental Sciences\nSchool of Medical Sciences & Research\nSharda School of Nursing Science & Research\n• School of Medical Sciences & Research\n• Sharda School of Nursing Science & Research\nExamination Annual Report\nAcademic Bank of Credits (ABC)\nCurricula Feedback\nUniversity Brochure\n• Examination Annual Report\n• Academic Bank of Credits (ABC)\n• Curricula Feedback\n• University Brochure\n• Get to know sharda\n• Perspective Plan\n• Leadership\n• History\n• Statutory Bodies of the University\n• Sharda Tenders\n• Act, Statutes and Ordinances\n• COVID19\n• Family & Couple Counselling Services(FCCS)\n• Capacity Development & Skill Enhancement\n• Language and Communication Skill Initiatives: Sharda Skills\n• Soft Skill Initiatives : Career Counseling and Development Center\n• Awareness of Trends in Technology : IIC\n• Entrepreneurship\n• Innovation and Entrepreneurship\nFM Radio: Suno Sharda-90.8FM\n• FM Radio: Suno Sharda-90.8FM\nGuidelines for Visa and FRO/FRRO\nGuidelines for Medical Insurance\nObservership Programmes\n• Guidelines for Visa and FRO/FRRO\n• Guidelines for Medical Insurance\n• Observership Programmes\nParamarsh- Our Mentoring Portal\n• Paramarsh- Our Mentoring Portal\nB.Sc. (Hons./By Research) Animation,VFX & Gaming Design\nSMF0119\n4 Years\n• PEO 1:- Demonstrate Professional, Social and Entrepreneurial skills related to Animation & VFX and Gaming industry. \n• PEO 2:- Support the Animation & VFX and Gaming industry as competent, trained and qualified workforce. \n• PEO3: Prove themselves as competent, trained and qualified Artist & Designer in the Animation, Visual Effects & Gaming Industry\n• PEO4: Mark a difference in the Concept Design, Visual Communication, Storytelling, Graphics, Animation, and VFX and Gaming Industry as competent, trained and qualified Artist. \n• PO1: Domain Knowledge: in Graphics, Animation & VFX Apply the knowledge of Storytelling, Script Writing, Storyboarding, Concept Design, Editing & Compositing, Visual effects and other disciplines of Animation & VFX. \n• PO2: Communication Skills: Exhibit high levels of verbal and non-verbal forms of contemporary communication skills along with Creative skill of creating new narratives. \n• PO3: Modern Tool Usage: Demonstrate skilled usage of modern tools and techniques to effectively communicate with the target audience. \n• PO4: Problem Solving Skills: Identify, formulate, research, and analyze the problems and reach logical conclusions and solutions to solve real-life problems and challenges. \n• PO5: Values, Ethics and Contribution to Society: Understand the importance of Values and Ethics in the field of Animation & VFX Production and the morals of serving the society and community for sustainable development. \n• PO6: Leadership, Management and Entrepreneurial Traits: Display Team spirit and Inculcate Leadership Traits to contribute individually as well as in a team or group of Creative professionals. \n• PO7: Innovation and Research Related Skills: Identify, formulate, research, and analyse the literature and problems and reach logical and innovative solutions and conclusions. \n• PO8:-Lifelong Learning: Develop into lifelong learner and consistently updating with current knowledge, skills and technologies. \n• PSO1: Expertise in the field of Creative Development, Visualization, Animation, VFX & Gaming. \n• PSO2: Applied proficiency in the disciplines related to Media & Entertainment Industry. \nS.No. | Academic year | Curricula Link\n1 | 2024-25 | View Details\nTake the next step towards a career in mass communication.\n• Recruiters\n• Covid 19 Updates\n• Sharda University Uzbekistan\n• Sharda University Agra\n• Courses on Human Values and Professional ethics\n• National Cyber Crime Reporting Portal\n• International Credit Transfer Programme\n"
    },
    "admission_requirements": {
      "admission_requirements": [
        {
          "program_name": "Example Bachelor's Program",
          "eligibility_criteria": "High school diploma with a minimum GPA of 3.0, completion of advanced mathematics and science courses.",
          "required_documents": [
            "Official high school transcripts",
            "SAT/ACT scores (optional)",
            "Two letters of recommendation",
            "Personal essay"
          ],
          "application_deadline": "YYYY-MM-DD"
        },
        {
          "program_name": "Example Master's Program",
          "eligibility_criteria": "Bachelor's degree in a related field with a minimum GPA of 3.5, at least two years of relevant work experience.",
          "required_documents": [
            "Official undergraduate transcripts",
            "Graduate Record Examinations (GRE) scores",
            "Curriculum Vitae (CV)",
            "Statement of purpose",
            "Three letters of recommendation"
          ],
          "application_deadline": "YYYY-MM-DD"
        }
      ]
    },
    "others": {
      "summary": "This text lists various departments, initiatives, and services offered by an organization, likely a university, covering areas such as recruitment, banking, leadership, history, tenders, COVID-19 response, counseling, skill enhancement, language and communication, soft skills, technology awareness, entrepreneurship, FM radio, visa and insurance guidelines, observership programs, and a mentoring portal.",
      "raw_content": "Global Knowledge Seekers\n• Global Knowledge Seekers\nOur Recruiters\n• Our Recruiters\nBanking And Postal Services\n• Banking And Postal Services\nPerspective Plan\nLeadership\nHistory\nStatutory Bodies of the University\nSharda Tenders\nAct, Statutes and Ordinances\nCOVID19\nFamily & Couple Counselling Services(FCCS)\nCapacity Development & Skill Enhancement\nLanguage and Communication Skill Initiatives: Sharda Skills\nSoft Skill Initiatives : Career Counseling and Development Center\nAwareness of Trends in Technology : IIC\nEntrepreneurship\nInnovation and Entrepreneurship\nFM Radio: Suno Sharda-90.8FM\nGuidelines for Visa and FRO/FRRO\nGuidelines for Medical Insurance\nObservership Programmes\nParamarsh- Our Mentoring Portal"
    }
  }
}