{
  "source_file": "www.sharda.ac.in_School_of_Business_Management_Courses_-_Admissions_2025_raw_2025-08-10-18-29-11.txt",
  "structured_data": {
    "general_info": {
      "summary": "This document provides a comprehensive overview of Sharda University's School of Business Studies (SSBS), highlighting its commitment to experiential learning, industry connections, and student success. It details the school's vision and mission, emphasizes its best-in-class faculty and robust infrastructure, and lists numerous achievements including accreditations, rankings, and collaborations. The document also includes recent events and essential administrative information like fee structures and student support services, all aiming to foster academic excellence and prepare students for leadership roles.",
      "raw_content": "• Programme 2025-26\n• School of Dental Sciences\nSchool of Medical Sciences & Research\nSharda School of Nursing Science & Research\n• School of Medical Sciences & Research\n• Sharda School of Nursing Science & Research\nExamination Annual Report\nAcademic Bank of Credits (ABC)\nCurricula Feedback\nUniversity Brochure\n• Examination Annual Report\n• Academic Bank of Credits (ABC)\n• Curricula Feedback\n• University Brochure\n• Get to know sharda\n• Perspective Plan\n• Leadership\n• History\n• Statutory Bodies of the University\n• Sharda Tenders\n• Act, Statutes and Ordinances\n• COVID19\n• Family & Couple Counselling Services(FCCS)\n• Capacity Development & Skill Enhancement\n• Language and Communication Skill Initiatives: Sharda Skills\n• Soft Skill Initiatives : Career Counseling and Development Center\n• Awareness of Trends in Technology : IIC\n• Entrepreneurship\n• Innovation and Entrepreneurship\nFM Radio: Suno Sharda-90.8FM\n• FM Radio: Suno Sharda-90.8FM\n• Accommodation Fee\n• Guidelines for Visa and FRO/FRRO\n• Guidelines for Medical Insurance\n• Observership Programmes\n• Paramarsh- Our Mentoring Portal\nCREATING ACHIEVERS IN MANAGEMENT\n• Recruiters\nThe school pays extreme emphasis on experiential learning opportunities throughout the curriculum including a required internship, course assignments, and other industry-driven projects. Smart Classrooms, Sports Amenities, Research Facilities, Secured Hostels, Cafeterias, Library, Recreational Facilities, etc., are all an integral part of standard infrastructure landscape at SSBS. SSBS offers students placement opportunities with top companies like Cognizant, DS Group, and similar organizations.\nThe faculty is best-in-class and work vigorously towards making the programmes comprehensive, wholesome while delivering authentic value to student\nVision of the School\n• To become a world class institution imparting education based on values, fostering culture of research, innovation and entrepreneurial spirit, and exhibiting professional excellence for better and sustainable society.\nMission of the School\n• M1. Building conducive learning ecosystem.\n• M2.Creating socially responsible future business leaders and entrepreneurs.\n• M3. Imparting cutting - edge application based curriculum.\n• M4. Boosting industry – academia connects.\n• Audited statement 2019-20\n• Audited statement 2020-21\n• Audited statement 2021-22\n• Audited statement 2022-23\n• Audited statement 2023-24\n• Grasp critical, analytical and innovative ideas and thoughts which would come in handy while tackling intrinsic corporate situations.\n• Become competent managers for any sector of Industry.\n• Have an understanding of organizational behavior and structure, possess critical thinking and analytical skills, communication skills, and research abilities.\n• Ability to research, interpret and implement financial and business data.\n• Become socially responsible, culturally aware and ethically better citizens of today and tomorrow.\n• NIRF ranking: Rank Band 101-125\n• AACSB – Business Education Alliance member\n• 10 Must Watch Business schools of India, by Higher Education Digest Magazine 2022\n• Indias Top 50 Non-IIMs B-School, 2022, by Academic Insights Magazine 2022\n• HR Conclave + Two HR Excellence Awards in 2024 & 2025\n• Sports Management Conference sponsored by Ministry of Youth Affairs and Sports and SAI, 2024\n• Ranked 14th among the top 100 B-Schools in Times Ranking 2025\n• Ranked 4th among the top Universities in India and Top 20 B-Schools in North India, 2025\n• Strategic collaboration with Association of Chartered Certified Accountant, UK and offer an ACCA certified BBA (Finance & Accounting) and B.Com (Hons.) programmes to students.\nAt SSBS, we are committed to providing quality education and training to our students, equipping them with the quint essential knowledge, skills, and values to succeed in their chosen careers. Our faculty members are dedicated experts with a rich blend of Industry &amp; academic experience who mentor students and provide wholesome knowledge.\nWe strive to create a dynamic and inclusive learning environment that fosters creativity, innovation, and critical thinking. Our programs are designed to meet the needs of the industry, and we have strong connections with the corporate world to provide our students with opportunities for internships, projects, and placements.\nI invite you to explore our website to learn more about our programs, faculty, and research initiatives.\nWhat’s Happening in School\n22 Aug 2023\nSharda University Orientation Programme 2023-24\nIt was an exhilarating start to Sharda Universit...\n25 Apr 2023\nLecture Series “G20 University Connect-Engaging Young Minds” on 25th April 2023\nThe G20 University Connect program is jointly organized by the Ministry of Ex...\n03 Dec 2022\nNavotsav 22- A Freshers Night organized by Sharda University\nOn December 3, 2022, the Student Council, the Cu...\n23 Nov 2022\nSharda University won the Award for “Excellence in Globalization of Education in India” at the FICCI Higher Education Excellence Summit 2022\nIt is a great pleasure to announce that Sharda U...\n05 Nov 2022\nMega Job cum Internship Fair of Law on 5th Nov 2022\n• Course Fee\n• Covid 19 Updates\n• Sharda University Uzbekistan\n• Sharda University Agra\n• Courses on Human Values and Professional ethics\n• National Cyber Crime Reporting Portal\n• International Credit Transfer Programme\nSource: https://www.sharda.ac.in/schools/business-studies"
    },
    "event_info": {
      "summary": "This document outlines various announcements and schedules from Sharda University between December 2022 and December 2024. Key events include appointments of Deans and Associate Deans in the School of Business Studies (SSBS) and Student Welfare, the release of several examination schedules for end-semester, mid-semester, and on-demand theory examinations for various terms and academic years, and advertisements for PhD admissions. Additionally, it mentions industrial visits, a certification training program on cyber security, a freshers' party, a list of holidays, and notifications regarding tuition fee payments and a proctorial committee.",
      "raw_content": "• 20 Dec 2024\nAppointment of Associate Dean, SSBS - Dr. Santhi Narayanan\n• 03 Sep 2024\nAppointment of Associate Dean of Students' Welfare - Dr. Rachna Bansal, SSBS\n• 22 Dec 2023\nAppointment of Dean, SSBS - Prof. (Dr.) Kapil Pandla\n• 14 Aug 2023\nExamination Schedule of ESE of Special Examination of 1st Year; Term-2212\n• 15 Jul 2023\nSchedule of End-Semester Theory Examination Term-2211; 2022-23\n• 07 Jul 2023\nExamination Schedule for Mid-Semester Theory Examination 2022-23 (Term-2211)\n• 09 Jun 2023\nExamination Schedule announced for the End-Semester Theory Examination of Even S...\n• 16 May 2023\nAdvertisement For Ph.D. Admissions July 2023 Batch\n• 09 May 2023\n• 23 Apr 2023\nSchedule of Mid Semester Theory Examination Term-2202; 2nd Semester (2022-23)\n• 12 Apr 2023\nNotification for Payment of Tuition Fee by the continuing students for the Acade...\n• 20 Mar 2023\nIndustrial Visit to Haier Appliances India Pvt. Ltd. on 21st March 2023\n• 28 Feb 2023\nExamination Schedule announced for Mid-Semester Theory Examination; 2nd Year onw...\n• 22 Feb 2023\nList of Selected Candidates in Ph.D. Entrance Examination_Jan 2023 Batch\n• 01 Feb 2023\nData Analytics using R Programming on 3rd and 4th Feb 2023\n• 31 Jan 2023\nExamination Schedule announced for End-Semester Theory Examination; 2022-23 (Te...\n• 21 Jan 2023\nAdvertisement for Ph.D. Admissions Jan 2023 Batch\n• 02 Jan 2023\nNotification for Tuition fee payment dates for continuing students of First Year...\n• 16 Dec 2022\nTwo Week Certifcate Training Program on \"CYBER SECURITY AND DIGITAL FORENSIC: CS...\n• 01 Dec 2022\nSharda University is organizing Celebrity Night Navotsav 22 Freshers Party on 3r...\n• 30 Nov 2022\nNotification for List of Holidays for the Year 2023 (Except SMSR and Sharda Hosp...\n• 28 Nov 2022\nIndustrial Visit to an E Commerce Co (1k.Com), Sonipat | SSBS on 29th November 2...\n• 12 Nov 2022\nNotification for Proctorial Committee of Sharda University 12-11-22\n• 03 Nov 2022\nSchedule announced for On-Demand Theory Examination Term-2114; (2021-22)\n• 17 Oct 2022\nExamination on Demand for students admitted in Academic Year 2021-22"
    },
    "placement_testimonials": {
      "summary": "This collection of testimonials highlights the positive experiences of students at Sharda University. Graduates consistently praise the supportive and knowledgeable faculty, the university's role in enhancing their skills and personal development, and the effectiveness of the placement cell in securing employment opportunities with reputable companies. Many express deep gratitude for the transformative impact Sharda University has had on their careers and personal growth, often describing it as a life-changing experience.",
      "raw_content": "I'm proud to say that I belong to this wonderful temple of knowledge Sharda University.Here I was accompanied by highly intellectual experienced and supportive faculties. I have witnessed my skills and knowledge rising to the great heights.It is very difficult to put my personal experience in Sharda University in few lines, but l must say that choosing Sharda is my best decision.\nMBA – Banking & Finance..., 2023-24\nPlaced In : Deloitte Tax Services India Pvt...\nMy journey at Sharda has been amazing, it has totally changed my personality and what I am today is because of Sharda. The journey from starting has given me something which I didn't have before, be it exposure to such a participative education system, be it the amazing people I met, be it the extraordinary, knowledgeable and friendly faculties who have always tried to inculcate true teaching to have a strong attitude changing motivation and to have realised the true meaning of what education means. Because of such efforts, I have been able to get placed in one of the big four accounting firms “Ey”. I think what Sharda gave me Id be able to apply in the corporate world and have growth, learn and make Sharda proud , every new day Sharda has something new to provide, feel lucky to be a part of such culture.\nMBA – Business Analytics and ..., 2023-24\nPlaced In : EY Global Delivery Services\nMy experience with Sharda University was incredible. The placement team gave us adequate training to develop our soft skills, communication skills and our holistic development.\nThe teaching staff always provides a helping hand and guides you properly which gives confidence. I shall forever be grateful to Sharda University for providing me with the best learning platform\nMBA – Integrated, 2023-24\nPlaced In : Cvent India\nMy 4 years at Sharda University have been really amazing. The amount of knowledge I have clutched at this place has been immense and rewarding. I had the opportunity to study subjects in-depth, manage time and learn to value of creativity. Socializing and meeting new people, amazing faculty who come from different cultures with different value has been a cherry on the top. Meeting my friends has been an exciting experience in my life and looking at each other grow with lots of ups and down has been a rollercoaster of emotional. With the placement going on it has been a whole experience of corporate level. All thanks to the placement cell for supporting us in every difficulty and getting us out there ready for the world outside. The environment at the university is always very exciting, filled with lots of fun and knowledge to be taken from every corner. Overall, the college experience has been a unique and rewarding time in my life. The open mindedness, willingness to learn, and a sense of adventure has been thrilling\nMBA – Integrated (Marketing a..., 2023-24\nPlaced In : The Smart Cube\nMy name is Shoaib Wani & Im from Kashmir. Im studying MBA at Sharda University. Sharda is one of the best private institutions in India. I must say that Sharda University has world class infrastructure for experience and learning. My teachers are well qualified, inspirational and are there as mentors to guide me. Sharda University is a secure and happening campus, apart from the academic lifestyle there is recreation activities inside the campus that has helped me evolve. I have met my fellow students from different countries and have got to learn about Diversified culture. Im thankful to Training & Placement cell for providing a platform to enhance my skills and an opportunity to showcase them\nThe world is here at Sharda University.\nMBA – Banking & Finance ..., 2023-24\nPlaced In : YES BANK Ltd.\nMy 2 years at Sharda University were great and a memory & experience to cherish for lifetime. It gave me an opportunity to meet different kind of people , make great friends and learned everything. Huge respect and love for entire faculty members and department.\nPallia Trans Logistics Pvt. Ltd, 2022-23\nPlaced In : Pallia Trans Logistics Pvt. Ltd\nWhile my time in Sharda University, I have made lifelong connections as amazing friends and some supportive teachers. Everyone helped me with the advice beneficial for the job and students got better exposure with placements. My journey has been fun and I learnt a lot\nMBA- Business Analytics, 2023-24\nI feel fortunate to be a part of Sharda University, where I could grow immensely. The faculty would leave no stone unturned to shape one's future. My two years at Sharda University have been a wonderful experience of learning with prolific exposure, The placement team gave us adequate training to develop our soft skills, communication skills and our holistic development. I feel immense respect and gratitude for all the faculty members and the department. Their efforts transformed me into a better professional.\nMBA – Marketing, 2022-23\nPlaced In : Trent Ltd (A TATA Group Co.)\nSharda University is having well experienced and qualified professors and teaching staff which are friendly to students. The University is having a separate placement department which works towards placement and a lot of renowned companies come to campus for placements. Most of the students get placement with a good package (CTC) and at good positions where they can perform well which helps in growth of the firm as well as the career. I got placed at Somany Impressa at the package of 6.5 LPA and I'm thankful to the placement department and the professors for making me capable of this.\nMBA, 2022-23\nPlaced In : Somany Impresa (Hindware)\nI am delighted to share that I am all set to join Deloitte USI as Tax Consultant 1. I would like to thank whole placement team for giving me this opportunity.\nCredit of my success goes to my parents and all other family members.\nI owe a debt of gratitude to all factuality members of Sharda Universit, it would not have been possible without their continuous support. I am thankful to all teaching as well non-teaching staff for adding value in my life. Apart from studies, environment of Sharda University helped me to become a responsible man from an irresponsible boy.\nLast but not the least I would like to thank my friends and all other person who supported me and believed in me when I was down.\nMBA Integrated - Finance, 2022-23\nSharda is an emotion that binds people of all the cultures together. It consist of super supportive and energetic faculties that never fails the expectation. Thereby help us to build all the creative knowledge that makes us stand out of the crowd. Placements are what that you will always find on the door steps so that one gets the best to choose, explore and shine with a bright future.\nLoved being here because Sharda not only gives education but holds the hand till one reaches their destination.\nBBA, 2018-21\nPlaced In : UOLO Edtech Pvt Ltd\nSharda University in Greater Noida is dedicated to providing students from all walks of life with a high-quality academic experience in a welcoming environment. It's the curriculum, the flexibility to acquire subjects and skills you're passionate about, the chance to interact with the wisest folks, and so on. The three most significant lessons I learned at Sharda University were \"right attitude,\" \"humility,\" and \"desire to learn\nMBA, 2019- 2021\nPlaced In : Flipkart.com\n“It is said that behind every mans success there are a group of people or a person. Here I am to thank a team behind my success story. I thank my faculties, School of Business studies, Sharda University and most importantly the training and placement cell for grooming me and making me for what I am today. The whole team has been an alchemist who have shaped a raw person to a desired successful person they always wanted to be. There are many opportunities for students in Sharda University and I tried my best to grab all the opportunities which have benefited me in many aspects.\nI am very lucky to be a part of this family which has shaped me to the best man I could be.”\nBBA (Marketing)\n“Describing 3 years of my college in a few lines would really be difficult but i would definitely say that Sharda University has played a major role in shaping my career and has also helped me become what i am today and for which i will always remain grateful. The beautiful experience at sharda is priceless and will always remain in my memories. I am extremely thankful to all the SBS faculties and i would also like to appreciate the placement cell at Sharda University for the efforts they make for the students.”\nB. Com (Honours)\n“Sharda University is a place where you can find an amalgamation of learning.\nI have completed my BBA from this university with pride. The relationship between faculty and the students is very friendly and supportive which gave me the motivation to explore and the training placement department is very helpful they conducted so many webinar and sessions which help me to get placed.”\nBBA (Banking & Finance)\n“My journey at Sharda University has had a huge impact on making me realize how I want to lay my path for the future. Its not just a college; it is a separate world in itself filled with professionalism for which anyone would admire. It's amazing how this college has developed; I have been through that journey, experienced it all. I have been provided with great exposure and supporting faculty which I adore a lot.”\nMBA, 2019-2021\nPlaced In : ICICI Bank Ltd., Satin Credit C...\n“Being a student at Sharda University is a genuinely rewarding experience. The academics, professors, courses, and programs are superb, and the college experience in the city of Greater Noida is unmatched. An excellent university with plenty of growth opportunities, such as for internships, leadership, placement and research. I was extremely delighted to be a part of this Universitys Training and Placement cell has been continuously providing assistance regarding the placements. Because of their effort only I have been selected in Vdx.tv with a handsome package.\nP"
    },
    "student_life": {
      "summary": "This data provides a snapshot of various quantifiable aspects, likely related to a campus or organization. It highlights an 11% figure, over 95 nationalities represented, more than 135 entities, a total exceeding 30,000, and over 1100 additional units, indicating a diverse and substantial population or scope.",
      "raw_content": "• 11%\n• 95+ \nNationalities on Campus Over a Period\n• 135+\n• 30000+\n• 1100+"
    }
  }
}