{
  "source_file": "www.galgotiasuniversity.edu.in_About_Us_Galgotias_University_raw_2025-08-10-18-45-11.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text appears to be a navigational or informational breakdown from the India Today Media Institute, specifically focusing on resources and information relevant to international students. It outlines various sections such as admissions, programs, fees, scholarships, support services like visa assistance and grievance redressal, and contact information.",
      "raw_content": "India Today Media Institute\nInternational Admissions About International Office Clubs for International Students International student programs Foundation and Bridge Courses for International Students Message from Director International Relations Programmes and Fees Scholarships Eligibility Admission Process Preparatory English Foundation Program Pre & Post Arrival Information for International Students International Students Grievances Wing Visa and FRRO Support International Apply Now Contact Us FAQs Download Brochure Testimonials Events Study in India\nClubs for International Students\nFoundation and Bridge Courses for International Students\nMessage from Director International Relations\nProgrammes and Fees\nScholarships\nPreparatory English Foundation Program\nPre & Post Arrival Information for International Students\nInternational Students Grievances Wing\nVisa and FRRO Support\nLogin Employee Login Student Login LMS Login\n"
    },
    "campus_life": {
      "summary": "This document outlines various aspects of campus life, including student organizations, hostel facilities, library services, transportation, extracurricular activities like NCC and NSS, sports, healthcare, and cultural events such as Unifest and the Smart India Hackathon. It also lists key resources and facilities available to students.",
      "raw_content": "Campus Life About the Campus Student Organization Societies & Clubs Hostel Library Transportation Services National Cadet Corps (NCC) National Service Scheme (NSS) Sports & Recreation Cafeteria Healthcare Facilities Unifest Events, Arts & Culture Resources & Facilities Convocation Smart India Hackathon 2022 Toycathon Launchpad\nNational Cadet Corps (NCC)\nNational Service Scheme (NSS)\nEvents, Arts & Culture\nSmart India Hackathon 2022"
    },
    "online_complaints": {
      "summary": "This text lists various committees and online portals established to address grievances and prevent discrimination and harassment within an organization. It highlights specific committees for preventing caste-based discrimination and sexual harassment, alongside online portals for both students and employees to submit grievances.",
      "raw_content": "Online Complaints Prevention of caste based discrimination at workplace committee Students Online portal for Redressal of Grievances Employee Online portal for Redressal of Grievances Anti-ragging Policy Complaint Committee for Prevention of Sexual Harassment\nPrevention of caste based discrimination at workplace committee\nStudents Online portal for Redressal of Grievances\nEmployee Online portal for Redressal of Grievances\nComplaint Committee for Prevention of Sexual Harassment"
    },
    "about_gu": {
      "summary": "This text appears to be a navigation menu or a sitemap for Galgotias University. It lists various sections related to the university's identity, leadership, achievements, and affiliations, including \"About Us,\" \"Leadership,\" \"Awards, Rankings & Certifications,\" and \"Partnerships & Collaborations.\"",
      "raw_content": "About GU About Us Galgotias University Our Legacy The Galgotias Story Leadership Governance International Academic Team Awards, Rankings & Certifications Accreditations Mandatory Disclosures Policies & Regulations Partnerships & Collaborations iOS Development Center Virtual tour\nGalgotias University\nLeadership\nAwards, Rankings & Certifications\nPartnerships & Collaborations"
    },
    "schools": {
      "summary": "The provided text lists various schools within an educational institution, highlighting the School of Defence Technology, School of Computer Science & Engineering, School of Artificial Intelligence, School of Aviation, Logistics & Tourism Management, School of Computer Applications & Technology, School of Engineering, School of Business, and School of Law. The list is presented with some duplication.",
      "raw_content": "Schools School of Defence Technology School of Computer Science & Engineering School of Artificial Intelligence School of Aviation, Logistics & Tourism Management School of Computer Applications & Technology School of Engineering School of Business School of Law View More\nSchool of Defence Technology\nSchool of Defence Technology\nSchool of Computer Science & Engineering\nSchool of Computer Science & Engineering\nSchool of Artificial Intelligence\nSchool of Artificial Intelligence\nSchool of Aviation, Logistics & Tourism Management\nSchool of Aviation, Logistics & Tourism Management\nSchool of Computer Applications & Technology\nSchool of Computer Applications & Technology"
    },
    "programs": {
      "summary": "The provided text lists various types of academic programs, including undergraduate, diploma, postgraduate, doctoral, and certificate programs. It also highlights specific categories such as programs for working professionals and online courses, with some of these categories being repeated.",
      "raw_content": "Programs Under Graduate Programs Diploma Programs Post Graduate Programs Doctoral Programs Certificate Programs Programs for working professionals Online Courses\nPrograms for working professionals\nPrograms for working professionals\nOnline Courses\nOnline Courses"
    },
    "admission_info": {
      "summary": "This text outlines various aspects of the admission process, including fee structure, eligibility criteria, scholarships, hostel facilities, lateral entry and migration options, financial aid, loan facilities, required admission documents, approvals and accreditations, transportation services, PhD admissions, and refund policies. It also provides information on how to download a brochure and contact an admission helpline.",
      "raw_content": "Fee Structure & Eligibility Scholarships Hostel Lateral Entry/Migration Admission Financial Aid & Loan Facilities\nAdmission Documents & Undertaking Approvals & Accreditations Transportation Services Ph.D Admission Refund Policy Download Brochure Admission Helpline\nFee Structure & Eligibility\nFinancial Aid & Loan Facilities\nAdmission Documents & Undertaking"
    },
    "research": {
      "summary": "This document outlines various research initiatives and achievements, including departmental publications, organized events, international engagement, recognitions like DSIR-SIRO, and collaborations with Nobel laureates. It highlights efforts towards research excellence, global engagement, interdisciplinary research, and specific centers of excellence, such as one for semiconductor research.",
      "raw_content": "Research Message from Dean (Research)\nResearch Excellence and Global Engagement\nResearch & Development Cell\nGalgotias Centre for Interdisciplinary Research\nResearch Ethics Application Department wise Publication Summary Research Group Organized Events International & National Events International FDPs Research Awards Scopus Citation WoS Citation Newsletter Session with Noble Laureates DSIR - SIRO Recognition Centres of Excellence Media Outreach Research Group Diversity Open House Project for Students Honorary Professors Best Practices G-MRDC Centre of Excellence for Semiconductor Research\nMessage from Dean (Research)\nResearch Excellence and Global Engagement\nResearch & Development Cell\nGalgotias Centre for Interdisciplinary Research\nDepartment wise Publication Summary\nResearch Group Organized Events\nInternational & National Events\nSession with Noble Laureates\nDSIR - SIRO Recognition\nResearch Group Diversity\nOpen House Project for Students\nHonorary Professors\nCentre of Excellence for Semiconductor Research"
    },
    "academics": {
      "summary": "This text outlines various academic sections and initiatives, including the academic calendar, learning models, the Choice Based Credit System, MOUs, curriculum design and development, the examination cell, NEP-2020, downloadable forms, holiday lists, awards, and achievements.",
      "raw_content": "Academics Academics Academic Calendar Learning Model & Choice Based Credit System MOUs Curriculum Design and Development Examination Cell NEP-2020 Download Forms Awards Holiday List Achievements\nLearning Model & Choice Based Credit System\nCurriculum Design and Development\nNEP-2020\n"
    },
    "placements": {
      "summary": "This text lists various resources and sections related to career planning and development, including placement information, associated recruiters, student and recruiter testimonials, and details on the highest performers. It highlights the role of the Career Planning and Development Division (CPDD) in facilitating these aspects of student careers.",
      "raw_content": "Placements Latest Placements Career Planning and Development Division (CPDD) Associated Recruiters Corporate Tie Ups Placement Records Employability Enhancement Program Placement Policy Placement Brochure Recruiters Speak Students Speak Highest Performers Placement Gallery\nCareer Planning and Development Division (CPDD)\nAssociated Recruiters\nRecruiters Speak\nHighest Performers"
    },
    "general_university_ranking": {
      "summary": "This text highlights a university's prestigious rankings, placing it 15th among top private universities and 43rd among all top private and government universities in India, according to the QS World University Rankings 2026. It also includes a call to action to \"Enquire Now.\"",
      "raw_content": "Enquire Now\n15th\nAmongst Top Private Universities In India\n43rd\nAmongst Top Private and Government Universities In India\nQS World University Rankings 2026"
    },
    "society_info": {
      "summary": "Smt. Shakuntala Educational and Welfare Society, established in 1998 and registered in New Delhi, operates educational institutions under the \"Galgotias\" name in Greater Noida, UP. With over three decades of experience, the society manages four institutions: Galgotias Institute of Management & Technology (GIMT), Galgotias College of Engineering & Technology (GCET), Galgotia College of Pharmacy (GCP), and Galgotias University (GU). The society emphasizes experienced faculty, modern infrastructure, and a commitment to quality, resulting in well-prepared graduates sought after by multinational companies and earning respect from the corporate world.",
      "raw_content": "Smt. Shakuntala Educational and Welfare Society\nSmt. Shakuntala Educational and Welfare Society was established in the year 1998 and registered under the Societies Registration Act XXI of 1860 with its registered address at Daryaganj, New Delhi. The Society runs institutions with the name of “Galgotias'' in Greater Noida, UP. The members of the society are Mr. Suneel Galgotia, Mrs. Padmini Galgotia and Mr. Dhruv Galgotia.\nSmt. Shakuntala Educational and Welfare Society has an experience of over three decades in the education sector. The society, at present, runs three colleges viz. Galgotias Institute of Management & Technology (GIMT) and Galgotias College of Engineering & Technology (GCET) and Galgotia College of Pharmacy (GCP), and one university in the name of Galgotias University (GU) at Greater Noida, Uttar Pradesh. Thus, the society has an established track record of over two decades in running educational institutions.\nThe society has the privilege of having a number of experienced faculty members, which is essential in building a strong brand name and attracting quality students. Further, all the institutes under the society have modern infrastructure, and latest tools & technologies.\nThe result of decades of excellence in higher education has propelled the Smt. Shakuntala Educational and Welfare Society’s institutions to emerge as the preferred home for high achieving students seeking world class higher education. Graduates are technically well prepared, are critical thinkers and can communicate effectively. The quality of our graduates is acknowledged by renowned multinational companies that recruit our students as competition among them to attract our top graduates is intense.\nThe unwavering commitment of Smt. Shakuntala Educational and Welfare Society for quality in all aspects of education including infrastructure, academics and administration has won respect from the corporate world as well. With a focus on research that drives innovation, it is emerging as the leading center for knowledge generation and dissemination. Smt. Shakuntala Educational and Welfare Society endeavor to continuously explore new opportunities by innovating to create new epicenters of growth."
    },
    "other_schools": {
      "summary": "The provided text lists various schools within an educational institution, encompassing disciplines such as finance, commerce, liberal arts, medicine, nursing, allied health, basic sciences, media, communication, design, biosciences, technology, vocational education, and lifelong learning.",
      "raw_content": "School of Finance and Commerce\nSchool of Liberal Education\nSchool of Medical and Allied Sciences\nSchool of Nursing\nSchool of Allied Health Sciences\nSchool of Basic Sciences\nSchool of Media & Communication Studies\nSchool of Design\nSchool of Biosciences and Technology\nSchool of Vocational Education\nSchool of Life Long Learning"
    },
    "other_services": {
      "summary": "This text lists various initiatives, cells, and programs associated with Galgotias University, including a Covid-19 Counselling Cell, Admission & Education Loan Assistance, ARIIA-2021 participation, Tender & Vendor Registration, Viksit Bharat@2047 engagement, the Internal Quality Assurance Cell (IQAC), DPBH 2023, the University's Vision 2030, and the Galgotias News Network (GNN).",
      "raw_content": "Covid-19 Counselling Cell\nAdmission & Education Loan Assistance\nARIIA-2021\nTender & Vendor Registration\nViksit Bharat@2047: Voice of Youth\nInternal Quality Assurance Cell (IQAC)\nDPBH 2023\nGalgotias University Vision 2030\nGalgotias News Network (GNN)"
    },
    "fees_payment": {
      "summary": "This document appears to be a simple header or title indicating a section related to the payment of fees.",
      "raw_content": "Fees Payment"
    },
    "legal_and_reporting": {
      "summary": "This document appears to be a collection of information related to UGC (likely University Grants Commission) public self-service portals, a GU Vision Plan projected for 2030, and an annual report covering the fiscal year 2022-23.",
      "raw_content": "UGC PUBLIC SELF PORTAL\nGU Vision Plan_2030 21-01-2024\nAnnual Report-2022-23"
    },
    "student_engagement": {
      "summary": "This text is a simple phrase inviting users to engage in a chat with \"Ambassadors.\"",
      "raw_content": "Chat with an Ambassadors"
    },
    "copyright_and_design": {
      "summary": "This text indicates that the copyright for content belongs to Galgotias in 2025 and that the design, development, and maintenance services were provided by City Innovates. All rights are reserved.",
      "raw_content": "© 2025 Copyrights Galgotias. All rights reserved.\nDesigned, developed & maintained By : City Innovates"
    },
    "source_url": {
      "summary": "This text appears to be a URL pointing to the 'About Us' page of Galgotias University.  Without accessing the content of the URL, no further summary can be provided.",
      "raw_content": "Source: https://www.galgotiasuniversity.edu.in/p/about-us"
    }
  }
}