{
  "source_file": "www.sharda.ac.in_MDS_Master_of_Dental_Surgery_Pedodontics_Preventive_Dentistry_raw_2025-08-10-18-29-16.txt",
  "structured_data": {
    "general_info": {
      "summary": "This document outlines various programs, schools, reports, and initiatives at Sharda University, spanning academic offerings like the School of Dental Sciences and nursing programs, administrative elements such as examination reports and the Academic Bank of Credits, student support services like counselling and skill enhancement, and administrative or informational sections including university history, leadership, tenders, and COVID-19 updates. It also highlights unique aspects like an FM radio station and international collaborations.",
      "raw_content": "• Programme 2025-26\n• School of Dental Sciences\nSchool of Medical Sciences & Research\nSharda School of Nursing Science & Research\n• School of Medical Sciences & Research\n• Sharda School of Nursing Science & Research\nExamination Annual Report\nAcademic Bank of Credits (ABC)\nCurricula Feedback\nUniversity Brochure\n• Examination Annual Report\n• Academic Bank of Credits (ABC)\n• Curricula Feedback\n• University Brochure\n• Get to know sharda\n• Perspective Plan\n• Leadership\n• History\n• Statutory Bodies of the University\n• Sharda Tenders\n• Act, Statutes and Ordinances\n• COVID19\n• Family & Couple Counselling Services(FCCS)\n• Capacity Development & Skill Enhancement\n• Language and Communication Skill Initiatives: Sharda Skills\n• Soft Skill Initiatives : Career Counseling and Development Center\n• Awareness of Trends in Technology : IIC\n• Entrepreneurship\n• Innovation and Entrepreneurship\nFM Radio: Suno Sharda-90.8FM\n• FM Radio: Suno Sharda-90.8FM\nGuidelines for Visa and FRO/FRRO\nGuidelines for Medical Insurance\nObservership Programmes\n• Guidelines for Visa and FRO/FRRO\n• Guidelines for Medical Insurance\n• Observership Programmes\nParamarsh- Our Mentoring Portal\n• Paramarsh- Our Mentoring Portal\n• Covid 19 Updates\n• Sharda University Uzbekistan\n• Sharda University Agra\n• Courses on Human Values and Professional ethics\n• National Cyber Crime Reporting Portal\n• International Credit Transfer Programme"
    },
    "career_path": {
      "summary": "Graduates of a pediatric dentistry course have a wide array of career options, including teaching in academic settings, establishing private practices given the significant demand and limited supply of pediatric dentists in India, working in corporate hospitals with a growing need for specialized dental care, joining the Indian armed forces where they are employed and trained, securing government positions at both central and state levels, exploring international career opportunities, contributing to the dental trade industry, functioning as independent consultants, and pursuing careers in research and clinical trials.",
      "raw_content": "Career path you can choose after the course\n• Teaching: A fulfilling academic career contributing to nation building in the finest traditions of Indian culture can be a reality for a postgraduate of pediatric dentistry.\n• Private practice: Huge opportunity awaits in the form of creating a successful private practice based on pediatric dentistry as almost 40% of Indian population is children with hardly any pediatric dentists around.\n• Corporate hospitals: A bright future awaits the postgraduate in the corporate hospitals as there is a growing demand for pediatric dental care.\n• Indian armed forces: The three wings of the Indian armed forces employ pediatric dentists and also trains them as soldiers. A dream come true for many\n• Government jobs: Both central and state governments employ pediatric dentists in their work force.\n• Wider horizons in the form of relocating to other countries.\n• The dental trade industry needs pediatric dentists to help in their growth.\n• To work as an independent consultant in the private practice environment.\n• Research and clinical trials can also be a full-time career."
    },
    "other_services": {
      "summary": "This document appears to be a list of various departments, initiatives, and important information categories related to an organization, possibly a university named Sharda. It covers areas like recruitment, specific services offered (banking, postal, counseling), strategic planning, historical information, governance (statutory bodies, acts), current events (COVID-19), skill development programs, and entrepreneurship initiatives.",
      "raw_content": "Global Knowledge Seekers\n• Global Knowledge Seekers\nOur Recruiters\n• Our Recruiters\nBanking And Postal Services\n• Banking And Postal Services\nPerspective Plan\nLeadership\nHistory\nStatutory Bodies of the University\nSharda Tenders\nAct, Statutes and Ordinances\nCOVID19\nFamily & Couple Counselling Services(FCCS)\nCapacity Development & Skill Enhancement\nLanguage and Communication Skill Initiatives: Sharda Skills\nSoft Skill Initiatives : Career Counseling and Development Center\nAwareness of Trends in Technology : IIC\nEntrepreneurship\nInnovation and Entrepreneurship\n• Get to know sharda\n• Perspective Plan\n• Leadership\n• History\n• Statutory Bodies of the University\n• Sharda Tenders\n• Act, Statutes and Ordinances\n• COVID19\n• Family & Couple Counselling Services(FCCS)\n• Capacity Development & Skill Enhancement\n• Language and Communication Skill Initiatives: Sharda Skills\n• Soft Skill Initiatives : Career Counseling and Development Center\n• Awareness of Trends in Technology : IIC\n• Entrepreneurship\n• Innovation and Entrepreneurship\n"
    }
  }
}