{
  "source_file": "www.sharda.ac.in_B_Sc_in_Emergency_and_Trauma_Care_Technology_-_Sharda_University_raw_2025-08-10-18-29-24.txt",
  "structured_data": {
    "general_info": {
      "summary": "This document lists various programs and departments within Sharda University, including the Schools of Dental, Medical, and Nursing Sciences. It also details important reports and initiatives such as Examination Annual Reports, Academic Bank of Credits, Curricula Feedback, University Brochures, leadership information, tenders, and guidelines for visa and medical insurance. Furthermore, it highlights skill development programs, entrepreneurship initiatives, FM radio, mentoring portals, and international programs, along with specific campus locations like Uzbekistan and Agra.",
      "raw_content": "• Programme 2025-26\n• School of Dental Sciences\nSchool of Medical Sciences & Research\nSharda School of Nursing Science & Research\n• School of Medical Sciences & Research\n• Sharda School of Nursing Science & Research\nExamination Annual Report\nAcademic Bank of Credits (ABC)\nCurricula Feedback\nUniversity Brochure\n• Examination Annual Report\n• Academic Bank of Credits (ABC)\n• Curricula Feedback\n• University Brochure\n• Get to know sharda\n• Perspective Plan\n• Leadership\n• History\n• Statutory Bodies of the University\n• Sharda Tenders\n• Act, Statutes and Ordinances\n• COVID19\n• Family & Couple Counselling Services(FCCS)\n• Capacity Development & Skill Enhancement\n• Language and Communication Skill Initiatives: Sharda Skills\n• Soft Skill Initiatives : Career Counseling and Development Center\n• Awareness of Trends in Technology : IIC\n• Entrepreneurship\n• Innovation and Entrepreneurship\nFM Radio: Suno Sharda-90.8FM\n• FM Radio: Suno Sharda-90.8FM\nGuidelines for Visa and FRO/FRRO\nGuidelines for Medical Insurance\nObservership Programmes\n• Guidelines for Visa and FRO/FRRO\n• Guidelines for Medical Insurance\n• Observership Programmes\nParamarsh- Our Mentoring Portal\n• Paramarsh- Our Mentoring Portal\n• Recruiters\n• Covid 19 Updates\n• Sharda University Uzbekistan\n• Sharda University Agra\n• Courses on Human Values and Professional ethics\n• National Cyber Crime Reporting Portal\n• International Credit Transfer Programme"
    },
    "career_path": {
      "summary": "This document outlines career paths for an Emergency Care Professional (ECP) after completing a course. The ECP can work in Emergency Ambulance Services as a crew leader, managing a team, responding to calls, and providing initial patient care and transport. Alternatively, they can function as a core member of an Emergency Department resuscitation and critical care team, performing triage, initial assessments, assisting with procedures, and advising patients. Additionally, ECPS can serve as members of Allied Health Teams in Satellite Community Health Care Centres, conducting assessments, administering treatments, managing observation units, coordinating care, and leading educational programs.",
      "raw_content": "Career path you can choose after the course\nEmergency Ambulance Services:Here, the ECP will function as the leader of the ambulance crew for each ambulance. As an ambulance crew leader he will need to do the following:\n• Be in charge of a team of at least three ambulance crew members. The ambulance crew would consist of a trained paramedic who will be the team leader, an emergency care technician who would be the assistant to the paramedic and a vehicle driver (also known as pilot)\n• Able to group the team rapidly in response to calls for an ambulance run\n• While on the way to the patient, able to brief the members of the team on the requirements of the ambulance run, in terms of roles of team members, equipment to be carried and expectations of care to be provided.\n• Able to communicate with the caller, if necessary to provide initial instructions that would help provide care to the casualty(ies) while the ambulance is on its way\n• Able to decide if this should be a lights and sirens run and instruct the driver appropriately.\n• Able to document the critical items of information on the ambulance case record while the ambulance is on its way.\n• Able to do scene survey on arrival at the patient location and evaluate the need for further assistance, if necessary.\n• Able to initiate crowd control procedures, if required, at the scene.\n• Able to conduct an initial organised evaluation of the patient (primary survey) and evaluate the need for performance of critical interventions on the patient. If required, to organize these initial interventions and ensure these are carried out before proceeding to performance of secondary survey, if required at the scene or later in the ambulance\n• Able to decide patient disposition, whether to hospital, not to evacuate, or on death pronouncement, if so indicated.\n• Able to organize movement of the patient to the ambulance in a safe manner.\n• Able to continue monitoring and treatment of the patient en-route to the destination hospital.\n• For patients who are critically ill, able to communicate with the receiving hospital about the intended arrival.\n• Able to conduct a handover of the patient to the receiving team at the Emergency Department.\n• Able to complete the ambulance case record documentation and hand over a copy of this to the receiving Emergency Department.\n• Able to complete cleaning of ambulance equipment and leave the Emergency Department to be ready for the next ambulance run.\n• On return to the ambulance station, to be able to complete appropriate procedures to ensure that the crew and ambulance are ready for the next ambulance run.\n• In the event of a mass casualty situation, to be able to set up and organize an on-site first aid post and conduct triage and care of the patient prior to a decision to evacuate the patient.\n• In the event of a mass casualty situation, to be able to organize evacuation of casualties from the incident site to the appropriate hospital\n• Able to conduct debrief of an ambulance team or on-site first-aid teams in critical situations and have these appropriately documented for further review\n• Participating as an instructor in community-based first-aid, CPR and AED use training programmes.\n• Participating in research activities carried out in the ambulance services\nEmergency Departments (ED):The ECP will function as a core member of the Emergency Department’s resuscitation and critical care team and should be able to carry out the following duties:\n• Able to conduct triage of patients arriving at the Emergency Department and organize their movement to the appropriate care area in the ED\n• Able to receive calls from arriving ambulances and subsequently activate the further initial response so that the appropriate care may be initiated for the patient.\n• Able to provide initial assessment of patients through a brief history taking, measurement of a variety of vital signs and examination of patients by system-based evaluation.\n• Able to assist and work under the direction of the doctors in the Emergency Department in performance of emergency care procedures such as CPR, defibrillation, vascular access, airway management, drug administration, acquiring of ECGs and management of wounds.\n• Able to assist in making arrangements for further care of the patient either in the intensive care units, operating theatres and general wards or outpatient clinics\n• Able to advise patients and their next-of-kin or care givers on further care and disposition of the patient from the ED\n• Being a member of the training team for educational programs in emergency care conducted by the ED for residents of the surrounding districts. Such programs include community first aid, CPR and use of an AED.\n• Participating in research carried out at the Emergency Departments.\nSatellite Community Health Care Centres: The ECP will function as a member of the Allied Health Team at these centres and should be able to carry out the following duties:\n• Conduct initial assessment of patient arriving at the CHCs and assigning them to the appropriate care area in the centres.\n• Administering treatments to patients presenting to CHCs based on doctors’ orders, e.g. administration of regular intravenous antibiotics, intravenous infusions, oral and other medications for patients under observation at the CHCs\n• Managing an observation care facility and acting as care coordinator at the CHC with inputs from doctors and assisted by nursing staff\n• Ability to decide on patient disposition based on protocols of care at the CHCs\n• Coordinating and conducting educational programs in emergency care at the CHCs for residents of the districts in the vicinity of the CDC. Such programs include standard first aid, CPR and use of AEDs.\n• Being a coordinator and also member of local first response teams for mass casualty incidents in local or neighboring districts\n• Coordinating the collection of data of care of various groups of patients managed at the CHCs and of persons for whom various educational programs are conducted for onward transmission to the higher echelon hospital.\n• Participating in research activities on various aspects of clinic care, education and healthcare administration at the CDCs"
    },
    "sample_papers": {
      "summary": "The provided text snippet appears to be a heading or title indicating that \"SUAT 2025\" will offer \"Sample Papers,\" with \"Sample Papers\" being listed again, possibly as a sub-category or a reinforcement of the main offering.",
      "raw_content": "SUAT 2025\nSample Papers\n• Sample Papers\n"
    },
    "global_presence": {
      "summary": "The provided text consists of a title, \"Global Knowledge Seekers,\" repeated twice, suggesting it might be a heading or a section identifier.",
      "raw_content": "Global Knowledge Seekers\n• Global Knowledge Seekers\n"
    },
    "recruiters": {
      "summary": "This text appears to be a simple heading or label, possibly from a document or website, indicating a section related to \"Our Recruiters.\"",
      "raw_content": "Our Recruiters\n• Our Recruiters"
    },
    "university_services": {
      "summary": "The provided text is a simple heading indicating that the topic is \"Banking And Postal Services\".",
      "raw_content": "Banking And Postal Services\n• Banking And Postal Services"
    }
  }
}