{
  "source_file": "www.sharda.ac.in_B_Com_in_Accounting_and_Finnace_with_ICA-_Subjects_Fees_Admission_raw_2025-08-10-18-29-19.txt",
  "structured_data": {
    "general_info": {
      "summary": "This document lists various programs, schools, reports, and initiatives offered or managed by Sharda University, including academic offerings like the School of Dental Sciences and the School of Medical Sciences & Research, administrative and reporting functions such as Examination Annual Reports and Academic Bank of Credits, student-focused services like counseling and skill enhancement, and university-specific features like FM Radio and various guidelines. It also includes information about university governance, history, and international campuses.",
      "raw_content": "• Programme 2025-26\n• School of Dental Sciences\nSchool of Medical Sciences & Research\nSharda School of Nursing Science & Research\n• School of Medical Sciences & Research\n• Sharda School of Nursing Science & Research\nExamination Annual Report\nAcademic Bank of Credits (ABC)\nCurricula Feedback\nUniversity Brochure\n• Examination Annual Report\n• Academic Bank of Credits (ABC)\n• Curricula Feedback\n• University Brochure\n• Get to know sharda\n• Perspective Plan\n• Leadership\n• History\n• Statutory Bodies of the University\n• Sharda Tenders\n• Act, Statutes and Ordinances\n• COVID19\n• Family & Couple Counselling Services(FCCS)\n• Capacity Development & Skill Enhancement\n• Language and Communication Skill Initiatives: Sharda Skills\n• Soft Skill Initiatives : Career Counseling and Development Center\n• Awareness of Trends in Technology : IIC\n• Entrepreneurship\n• Innovation and Entrepreneurship\nFM Radio: Suno Sharda-90.8FM\n• FM Radio: Suno Sharda-90.8FM\nGuidelines for Visa and FRO/FRRO\nGuidelines for Medical Insurance\nObservership Programmes\n• Guidelines for Visa and FRO/FRRO\n• Guidelines for Medical Insurance\n• Observership Programmes\nParamarsh- Our Mentoring Portal\n• Paramarsh- Our Mentoring Portal\n• Covid 19 Updates\n• Sharda University Uzbekistan\n• Sharda University Agra\n• Courses on Human Values and Professional ethics\n• National Cyber Crime Reporting Portal\n• International Credit Transfer Programme\nSource: https://www.sharda.ac.in/programmes/bcom-finance-and-accounts"
    },
    "career_info": {
      "summary": "This course is designed for individuals with a talent for accounting, strong mathematical abilities, and keen attention to detail. It requires deep insight and sharp analytical skills to tackle case-based problems. The program is ideal for students seeking a career in accounting and finance, with guidance from industry professionals aiming to prepare students for global opportunities. Graduates can pursue roles such as Sr. Manager – Accounts or become Finance and Business Entrepreneurs, with typical starting salaries ranging from 2.80 to 3.00 LPA.",
      "raw_content": "This course is for individuals who... have a knack for accounting along with attention to detail and strong mathematical skills. This programme requires deep insight skills and sharp analytical observations to understand the case based problems.\nStudents who are looking for... a career in accounting and finance according to requisite standards are an ideal fit. The programme is designed and guided by competent professionals with an objective to groom students to make a career on a global platform.\nCareer path you can choose after the course\n• Sr. Manager – Accounts\n• Finance and Business Entrepreneurship\nStudents of this programme are placed in companies with an average annual package of 2.80 LPA to 3.00 LPA\nTake the next step towards a career in management."
    },
    "recruiter_info": {
      "summary": "The provided text lists \"Our Recruiters\" twice and then repeats \"Recruiters\" once, suggesting a focus on the role or presence of recruiters.",
      "raw_content": "Our Recruiters\n• Our Recruiters\n• Recruiters"
    },
    "application_portal": {
      "summary": "This document references \"SUAT 2025\" and lists \"Sample Papers\" as a category or item within that context.",
      "raw_content": "SUAT 2025\nSample Papers\n• Sample Papers\n"
    },
    "global_presence": {
      "summary": "The provided text consists of a title, \"Global Knowledge Seekers\", repeated twice.",
      "raw_content": "Global Knowledge Seekers\n• Global Knowledge Seekers"
    },
    "university_services": {
      "summary": "This document briefly mentions \"Banking And Postal Services\" twice, suggesting it's a topic or category title.",
      "raw_content": "Banking And Postal Services\n• Banking And Postal Services"
    }
  }
}