{
  "source_file": "www.galgotiasuniversity.edu.in_International_Admission_Process_Galgotias_University_raw_2025-08-10-18-45-10.txt",
  "structured_data": {
    "general_info": {
      "summary": "This document appears to be a sitemap or navigation structure for Galgotias University, detailing various aspects of the institution. It covers international admissions and student life, campus facilities and organizations, academic schools and programs, research initiatives, admissions processes, and important university information such as policies, rankings, and contact details. Specific sections highlight programs for international students, clubs, research, academic calendars, placements, and various administrative and student support services.",
      "raw_content": "India Today Media Institute\nInternational Admissions About International Office Clubs for International Students International student programs Foundation and Bridge Courses for International Students Message from Director International Relations Programmes and Fees Scholarships Eligibility Admission Process Preparatory English Foundation Program Pre & Post Arrival Information for International Students International Students Grievances Wing Visa and FRRO Support International Apply Now Contact Us FAQs Download Brochure Testimonials Events Study in India\nClubs for International Students\nFoundation and Bridge Courses for International Students\nMessage from Director International Relations\nProgrammes and Fees\nScholarships\nPreparatory English Foundation Program\nPre & Post Arrival Information for International Students\nInternational Students Grievances Wing\nVisa and FRRO Support\nLogin Employee Login Student Login LMS Login\nCampus Life About the Campus Student Organization Societies & Clubs Hostel Library Transportation Services National Cadet Corps (NCC) National Service Scheme (NSS) Sports & Recreation Cafeteria Healthcare Facilities Unifest Events, Arts & Culture Resources & Facilities Convocation Smart India Hackathon 2022 Toycathon Launchpad\nNational Cadet Corps (NCC)\nNational Service Scheme (NSS)\nEvents, Arts & Culture\nSmart India Hackathon 2022\nOnline Complaints Prevention of caste based discrimination at workplace committee Students Online portal for Redressal of Grievances Employee Online portal for Redressal of Grievances Anti-ragging Policy Complaint Committee for Prevention of Sexual Harassment\nPrevention of caste based discrimination at workplace committee\nStudents Online portal for Redressal of Grievances\nEmployee Online portal for Redressal of Grievances\nComplaint Committee for Prevention of Sexual Harassment\nAbout GU About Us Galgotias University Our Legacy The Galgotias Story Leadership Governance International Academic Team Awards, Rankings & Certifications Accreditations Mandatory Disclosures Policies & Regulations Partnerships & Collaborations iOS Development Center Virtual tour\nGalgotias University\nLeadership\nAwards, Rankings & Certifications\nPartnerships & Collaborations\nSchools School of Defence Technology School of Computer Science & Engineering School of Artificial Intelligence School of Aviation, Logistics & Tourism Management School of Computer Applications & Technology School of Engineering School of Business School of Law View More\nSchool of Defence Technology\nSchool of Defence Technology\nSchool of Computer Science & Engineering\nSchool of Computer Science & Engineering\nSchool of Artificial Intelligence\nSchool of Artificial Intelligence\nSchool of Aviation, Logistics & Tourism Management\nSchool of Aviation, Logistics & Tourism Management\nSchool of Computer Applications & Technology\nSchool of Computer Applications & Technology\nPrograms Under Graduate Programs Diploma Programs Post Graduate Programs Doctoral Programs Certificate Programs Programs for working professionals Online Courses\nPrograms for working professionals\nPrograms for working professionals\nOnline Courses\nOnline Courses\nResearch Message from Dean (Research)\nResearch Excellence and Global Engagement\nResearch & Development Cell\nGalgotias Centre for Interdisciplinary Research\nResearch Ethics Application Department wise Publication Summary Research Group Organized Events International & National Events International FDPs Research Awards Scopus Citation WoS Citation Newsletter Session with Noble Laureates DSIR - SIRO Recognition Centres of Excellence Media Outreach Research Group Diversity Open House Project for Students Honorary Professors Best Practices G-MRDC Centre of Excellence for Semiconductor Research\nMessage from Dean (Research)\nResearch Excellence and Global Engagement\nResearch & Development Cell\nGalgotias Centre for Interdisciplinary Research\nDepartment wise Publication Summary\nResearch Group Organized Events\nInternational & National Events\nSession with Noble Laureates\nDSIR - SIRO Recognition\nResearch Group Diversity\nOpen House Project for Students\nHonorary Professors\nCentre of Excellence for Semiconductor Research\nAcademics Academics Academic Calendar Learning Model & Choice Based Credit System MOUs Curriculum Design and Development Examination Cell NEP-2020 Download Forms Awards Holiday List Achievements\nLearning Model & Choice Based Credit System\nCurriculum Design and Development\nNEP-2020\nPlacements Latest Placements Career Planning and Development Division (CPDD) Associated Recruiters Corporate Tie Ups Placement Records Employability Enhancement Program Placement Policy Placement Brochure Recruiters Speak Students Speak Highest Performers Placement Gallery\nCareer Planning and Development Division (CPDD)\nAssociated Recruiters\nRecruiters Speak\nHighest Performers\nEnquire Now\nApplication to Galgotias University\nSchool of Finance and Commerce\nSchool of Liberal Education\nSchool of Medical and Allied Sciences\nSchool of Nursing\nSchool of Allied Health Sciences\nSchool of Basic Sciences\nSchool of Media & Communication Studies\nSchool of Design\nSchool of Biosciences and Technology\nSchool of Vocational Education\nSchool of Life Long Learning\nCovid-19 Counselling Cell\nAdmission & Education Loan Assistance\nARIIA-2021\nTender & Vendor Registration\nViksit Bharat@2047: Voice of Youth\nInternal Quality Assurance Cell (IQAC)\nDPBH 2023\nGalgotias University Vision 2030\nGalgotias News Network (GNN)\nFees Payment\nSIH -2023 and 2024\nUGC PUBLIC SELF PORTAL\nGU Vision Plan_2030 21-01-2024\nAnnual Report-2022-23\nChat with an Ambassadors\n© 2025 Copyrights Galgotias. All rights reserved.\nDesigned, developed & maintained By : City Innovates"
    },
    "campus_life": {
      "summary": "The provided text outlines various aspects of campus life, including student organizations like NCC and NSS, campus facilities such as libraries and transportation, and extracurricular activities like Unifest and Arts & Culture. It also details arrival procedures for new students, specifying that they need to email flight details and that the cost of airport transportation will be covered by the student.",
      "raw_content": "Campus Life About the Campus Student Organization Societies & Clubs Hostel Library Transportation Services National Cadet Corps (NCC) National Service Scheme (NSS) Sports & Recreation Cafeteria Healthcare Facilities Unifest Events, Arts & Culture Resources & Facilities Convocation Smart India Hackathon 2022 Toycathon Launchpad\nNational Cadet Corps (NCC)\nNational Service Scheme (NSS)\nEvents, Arts & Culture\nSmart India Hackathon 2022\nOnce your travel plans are made email us your flight details and arrival date and time. Contact us by email or phone to confirm we have received your arrival information.\nUpon arrival you will be picked up from the airport and taken to your accommodation. The cost of transportation for the same will be borne by the student."
    },
    "research": {
      "summary": "This document outlines various initiatives and achievements related to research excellence and global engagement, managed by the Dean of Research. It details the structure of research support through the Research & Development Cell and the Galgotias Centre for Interdisciplinary Research, highlighting activities like organized events, international collaborations, publication summaries, research ethics, and specific recognitions such as DSIR - SIRO. The document also mentions engagement with Nobel Laureates, media outreach, and centers of excellence, including one for semiconductor research, as well as best practices and projects for students.",
      "raw_content": "Research Message from Dean (Research)\nResearch Excellence and Global Engagement\nResearch & Development Cell\nGalgotias Centre for Interdisciplinary Research\nResearch Ethics Application Department wise Publication Summary Research Group Organized Events International & National Events International FDPs Research Awards Scopus Citation WoS Citation Newsletter Session with Noble Laureates DSIR - SIRO Recognition Centres of Excellence Media Outreach Research Group Diversity Open House Project for Students Honorary Professors Best Practices G-MRDC Centre of Excellence for Semiconductor Research\nMessage from Dean (Research)\nResearch Excellence and Global Engagement\nResearch & Development Cell\nGalgotias Centre for Interdisciplinary Research\nDepartment wise Publication Summary\nResearch Group Organized Events\nInternational & National Events\nSession with Noble Laureates\nDSIR - SIRO Recognition\nResearch Group Diversity\nOpen House Project for Students\nHonorary Professors\nCentre of Excellence for Semiconductor Research\n"
    },
    "academics": {
      "summary": "This text lists various academic-related sections and initiatives, including the academic calendar, learning models, credit systems, curriculum development, examination processes, the National Education Policy (NEP-2020), downloadable forms, awards, holiday lists, and achievements.",
      "raw_content": "Academics Academics Academic Calendar Learning Model & Choice Based Credit System MOUs Curriculum Design and Development Examination Cell NEP-2020 Download Forms Awards Holiday List Achievements\nLearning Model & Choice Based Credit System\nCurriculum Design and Development\nNEP-2020"
    },
    "placements": {
      "summary": "This document appears to be an index or navigation menu for a Career Planning and Development Division (CPDD) website, listing various sections related to placements, recruiters, career development, and student performance.",
      "raw_content": "Placements Latest Placements Career Planning and Development Division (CPDD) Associated Recruiters Corporate Tie Ups Placement Records Employability Enhancement Program Placement Policy Placement Brochure Recruiters Speak Students Speak Highest Performers Placement Gallery\nCareer Planning and Development Division (CPDD)\nAssociated Recruiters\nRecruiters Speak\nHighest Performers"
    },
    "post_arrival_info": {
      "summary": "International students arriving for their program must complete admission and tuition fee payments upon arrival, before the session begins. They are required to submit original documents, an AIU equivalence certificate, and a medical certificate to the International Office for verification. Additionally, students must report one week prior to the program's start date to finalize admission procedures and attend orientation.",
      "raw_content": "Pre & Post Arrival Information for International Students\nThe final admission and payment of Tuition Fees can be done on arrival by the student, before the commencement of the session.\nThe original documents have to be submitted for verification at the International Office along with the AIU equivalence certificate and medical certificate.\nThe student is required to report a week before the commencement of the program to complete all admission formalities and for the orientation."
    }
  }
}