{
  "source_file": "www.galgotiasuniversity.edu.in_Mandatory_Disclosures_Galgotias_University_raw_2025-08-10-18-45-11.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text appears to be a sitemap or navigation structure for Galgotias University, covering various aspects of the institution. It details international student services, campus life, student support, academic schools, administrative functions, and important university initiatives and publications. The content highlights admissions, courses, student activities, grievance redressal, and the university's vision and achievements.",
      "raw_content": "• India Today Media Institute\n• International Admissions About International Office Clubs for International Students International student programs Foundation and Bridge Courses for International Students Message from Director International Relations Programmes and Fees Scholarships Eligibility Admission Process Preparatory English Foundation Program Pre & Post Arrival Information for International Students International Students Grievances Wing Visa and FRRO Support International Apply Now Contact Us FAQs Download Brochure Testimonials Events Study in India\n• Clubs for International Students\n• Foundation and Bridge Courses for International Students\n• Message from Director International Relations\n• Scholarships\n• Preparatory English Foundation Program\n• Pre & Post Arrival Information for International Students\n• International Students Grievances Wing\n• Visa and FRRO Support\n• Login Employee Login Student Login LMS Login\n• Campus Life About the Campus Student Organization Societies & Clubs Hostel Library Transportation Services National Cadet Corps (NCC) National Service Scheme (NSS) Sports & Recreation Cafeteria Healthcare Facilities Unifest Events, Arts & Culture Resources & Facilities Convocation Smart India Hackathon 2022 Toycathon Launchpad\n• National Cadet Corps (NCC)\n• National Service Scheme (NSS)\n• Events, Arts & Culture\n• Smart India Hackathon 2022\n• Online Complaints Prevention of caste based discrimination at workplace committee Students Online portal for Redressal of Grievances Employee Online portal for Redressal of Grievances Anti-ragging Policy Complaint Committee for Prevention of Sexual Harassment\n• Prevention of caste based discrimination at workplace committee\n• Students Online portal for Redressal of Grievances\n• Employee Online portal for Redressal of Grievances\n• Complaint Committee for Prevention of Sexual Harassment\n• About GU About Us Galgotias University Our Legacy The Galgotias Story Leadership Governance International Academic Team Awards, Rankings & Certifications Accreditations Mandatory Disclosures Policies & Regulations Partnerships & Collaborations iOS Development Center Virtual tour\n• Galgotias University\n• Leadership\n• Awards, Rankings & Certifications\n• Partnerships & Collaborations\n• School of Finance and Commerce\n• School of Liberal Education\n• School of Medical and Allied Sciences\n• School of Nursing\n• School of Allied Health Sciences\n• School of Basic Sciences\n• School of Media & Communication Studies\n• School of Design\n• School of Biosciences and Technology\n• School of Vocational Education\n• School of Life Long Learning\n• Covid-19 Counselling Cell\n• Admission & Education Loan Assistance\n• ARIIA-2021\n• Tender & Vendor Registration\n• Viksit Bharat@2047: Voice of Youth\n• Internal Quality Assurance Cell (IQAC)\n• DPBH 2023\n• Galgotias University Vision 2030\n• Galgotias News Network (GNN)\n• Fees Payment\n• SIH -2023 and 2024\n• UGC PUBLIC SELF PORTAL\n• GU Vision Plan_2030 21-01-2024\n• Annual Report-2022-23\n• Chat with an Ambassadors\n• © 2025 Copyrights Galgotias. All rights reserved.\n• Designed, developed & maintained By : City Innovates"
    },
    "placements": {
      "summary": "The provided text outlines key aspects of a Career Planning and Development Division (CPDD), including information on placements, associated recruiters, career planning, recruiter feedback, and high-performing students, with links to placement records, policies, and brochures.",
      "raw_content": "• Placements Latest Placements Career Planning and Development Division (CPDD) Associated Recruiters Corporate Tie Ups Placement Records Employability Enhancement Program Placement Policy Placement Brochure Recruiters Speak Students Speak Highest Performers Placement Gallery\n• Career Planning and Development Division (CPDD)\n• Associated Recruiters\n• Recruiters Speak\n• Highest Performers"
    },
    "university_rankings": {
      "summary": "The text highlights that the institution is ranked among the top private universities in India (15th) and amongst all universities, both private and government, in India (43rd), according to the QS World University Rankings 2026. It also includes a call to action to \"Enquire Now.\"",
      "raw_content": "Enquire Now\n15th\nAmongst Top Private Universities In India\n43rd\nAmongst Top Private and Government Universities In India\nQS World University Rankings 2026"
    },
    "campus_life": {
      "summary": "This text lists various facilities and services typically available at an educational institution or similar establishment, including accommodation (Hostel), academic support (Library), student life (Sports & Recreation, Cafeteria, Unifest Events, Arts & Culture), essential services (Transportation Services, Healthcare Facilities).",
      "raw_content": "• Hostel\n• Library\n• Transportation Services\n• Sports & Recreation\n• Cafeteria\n• Healthcare Facilities\n• Unifest Events, Arts & Culture"
    },
    "financial_aid": {
      "summary": "This snippet indicates the availability of financial aid and loan facilities.",
      "raw_content": "• Financial Aid & Loan Facilities"
    },
    "academic_policies": {
      "summary": "The provided text contains a single bullet point indicating a section or topic related to 'Policies & Regulations'.",
      "raw_content": "• Policies & Regulations"
    },
    "student_support": {
      "summary": "This text provides a list of various services and information related to admissions, including required documents, transportation, PhD admissions, refund policy, brochure downloads, a helpline, and a chat option with ambassadors.",
      "raw_content": "• Admission Documents & Undertaking\n• Transportation Services\n• Ph.D Admission\n• Refund Policy\n• Download Brochure\n• Admission Helpline\n• Chat with an Ambassadors"
    }
  }
}