{
  "source_file": "www.galgotiasuniversity.edu.in_Policies_and_Regulations_Galgotias_University_raw_2025-08-10-18-45-11.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text appears to be a navigational structure or sitemap for Galgotias University, detailing various sections like International Admissions, Campus Life, Online Complaints, Academics (including various schools and programs), University Information, and important links such as fees, reports, and contact details. It also includes information about student support, grievance redressal, and administrative committees.",
      "raw_content": "• India Today Media Institute\n• International Admissions About International Office Clubs for International Students International student programs Foundation and Bridge Courses for International Students Message from Director International Relations Programmes and Fees Scholarships Eligibility Admission Process Preparatory English Foundation Program Pre & Post Arrival Information for International Students International Students Grievances Wing Visa and FRRO Support International Apply Now Contact Us FAQs Download Brochure Testimonials Events Study in India\n• Clubs for International Students\n• Foundation and Bridge Courses for International Students\n• Message from Director International Relations\n• Programmes and Fees\n• Scholarships\n• Preparatory English Foundation Program\n• Pre & Post Arrival Information for International Students\n• International Students Grievances Wing\n• Visa and FRRO Support\n• Login Employee Login Student Login LMS Login\n• Campus Life About the Campus Student Organization Societies & Clubs Hostel Library Transportation Services National Cadet Corps (NCC) National Service Scheme (NSS) Sports & Recreation Cafeteria Healthcare Facilities Unifest Events, Arts & Culture Resources & Facilities Convocation Smart India Hackathon 2022 Toycathon Launchpad\n• National Cadet Corps (NCC)\n• National Service Scheme (NSS)\n• Events, Arts & Culture\n• Smart India Hackathon 2022\n• Online Complaints Prevention of caste based discrimination at workplace committee Students Online portal for Redressal of Grievances Employee Online portal for Redressal of Grievances Anti-ragging Policy Complaint Committee for Prevention of Sexual Harassment\n• Prevention of caste based discrimination at workplace committee\n• Students Online portal for Redressal of Grievances\n• Employee Online portal for Redressal of Grievances\n• Complaint Committee for Prevention of Sexual Harassment\n• About GU About Us Galgotias University Our Legacy The Galgotias Story Leadership Governance International Academic Team Awards, Rankings & Certifications Accreditations Mandatory Disclosures Policies & Regulations Partnerships & Collaborations iOS Development Center Virtual tour\n• Galgotias University\n• Leadership\n• Awards, Rankings & Certifications\n• Partnerships & Collaborations\n• School of Finance and Commerce\n• School of Liberal Education\n• School of Medical and Allied Sciences\n• School of Nursing\n• School of Allied Health Sciences\n• School of Basic Sciences\n• School of Media & Communication Studies\n• School of Design\n• School of Biosciences and Technology\n• School of Vocational Education\n• School of Life Long Learning\n• Covid-19 Counselling Cell\n• Admission & Education Loan Assistance\n• ARIIA-2021\n• Tender & Vendor Registration\n• Viksit Bharat@2047: Voice of Youth\n• Internal Quality Assurance Cell (IQAC)\n• DPBH 2023\n• Galgotias University Vision 2030\n• Galgotias News Network (GNN)\n• Fees Payment\n• SIH -2023 and 2024\n• GU Vision Plan_2030 21-01-2024\n• Annual Report-2022-23\n• Chat with an Ambassadors\n• © 2025 Copyrights Galgotias. All rights reserved.\n• Designed, developed & maintained By : City Innovates\nSource: https://www.galgotiasuniversity.edu.in/p/about/policies-and-regulations"
    },
    "research": {
      "summary": "This text outlines various initiatives and departments related to research excellence and global engagement at an institution. It details the Research & Development Cell, the Galgotias Centre for Interdisciplinary Research, and highlights specific areas such as research ethics, publication summaries, organized events, international collaborations, recognition for research efforts (like DSIR - SIRO), sessions with Nobel laureates, and centers of excellence, including one for semiconductor research. The document also touches upon aspects like research group diversity, student projects, honorary professors, and best practices.",
      "raw_content": "• Research Message from Dean (Research)\nResearch Excellence and Global Engagement\nResearch & Development Cell\nGalgotias Centre for Interdisciplinary Research\nResearch Ethics Application Department wise Publication Summary Research Group Organized Events International & National Events International FDPs Research Awards Scopus Citation WoS Citation Newsletter Session with Noble Laureates DSIR - SIRO Recognition Centres of Excellence Media Outreach Research Group Diversity Open House Project for Students Honorary Professors Best Practices G-MRDC Centre of Excellence for Semiconductor Research\n• Message from Dean (Research)\n• Research Excellence and Global Engagement\n• Research & Development Cell\n• Galgotias Centre for Interdisciplinary Research\n• Department wise Publication Summary\n• Research Group Organized Events\n• International & National Events\n• Session with Noble Laureates\n• DSIR - SIRO Recognition\n• Research Group Diversity\n• Open House Project for Students\n• Honorary Professors\n• Centre of Excellence for Semiconductor Research"
    },
    "placements": {
      "summary": "This document outlines resources and information related to career planning and placements, including details on the Career Planning and Development Division (CPDD), associated recruiters, placement policies, records, and student and recruiter testimonials. It also mentions an Employability Enhancement Program and a placement gallery.",
      "raw_content": "• Placements Latest Placements Career Planning and Development Division (CPDD) Associated Recruiters Corporate Tie Ups Placement Records Employability Enhancement Program Placement Policy Placement Brochure Recruiters Speak Students Speak Highest Performers Placement Gallery\n• Career Planning and Development Division (CPDD)\n• Associated Recruiters\n• Recruiters Speak\n• Highest Performers"
    },
    "university_rankings": {
      "summary": "This text highlights a private university's rankings in India according to the QS World University Rankings 2026, placing it 15th among top private universities and 43rd among all private and government universities. It also includes a call to action, \"Enquire Now.\"",
      "raw_content": "Enquire Now\n15th\nAmongst Top Private Universities In India\n43rd\nAmongst Top Private and Government Universities In India\nQS World University Rankings 2026"
    },
    "financial_aid": {
      "summary": "This content indicates the availability of financial aid and loan facilities, suggesting resources for funding educational or other expenses.",
      "raw_content": "• Financial Aid & Loan Facilities"
    },
    "admission_process": {
      "summary": "This document outlines key information related to Ph.D. admissions, including admission documents and undertakings, a refund policy, the option to download a brochure, and contact details for the admission helpline.",
      "raw_content": "• Admission Documents & Undertaking\n• Ph.D Admission\n• Refund Policy\n• Download Brochure\n• Admission Helpline"
    }
  }
}