{
  "source_file": "www.galgotiasuniversity.edu.in_Governance_Galgotias_University_raw_2025-08-10-18-45-11.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text provides a structured overview of Galgotias University, including sections on its legacy, leadership, governance, international academic team, awards and rankings, accreditations, policies, partnerships, and future vision (Vision 2030). It also mentions the Galgotias News Network (GNN) and credits City Innovates for design and development, with copyright belonging to Galgotias.",
      "raw_content": "• India Today Media Institute\n• Galgotias University\n• About GU About Us Galgotias University Our Legacy The Galgotias Story Leadership Governance International Academic Team Awards, Rankings & Certifications Accreditations Mandatory Disclosures Policies & Regulations Partnerships & Collaborations iOS Development Center Virtual tour\n• Leadership\n• Awards, Rankings & Certifications\n• Partnerships & Collaborations\n• Galgotias University Vision 2030\n• Galgotias News Network (GNN)\n• © 2025 Copyrights Galgotias. All rights reserved.\n• Designed, developed & maintained By : City Innovates\nSource: https://www.galgotiasuniversity.edu.in/p/about/governance"
    },
    "admission_requirements": {
      "admission_requirements": [
        {
          "program_name": "Example Bachelor's Degree in Science",
          "eligibility_criteria": {
            "academic_qualifications": "High school diploma with a minimum GPA of 3.5.",
            "specific_subjects": "Successful completion of advanced mathematics and physics courses.",
            "language_proficiency": "TOEFL score of 100 or IELTS score of 7.0."
          },
          "required_documents": [
            "Completed online application form",
            "Official high school transcripts",
            "Letters of recommendation (2)",
            "Personal essay",
            "Standardized test scores (SAT/ACT)",
            "Proof of English proficiency"
          ],
          "application_deadline": "March 15th, 2025"
        },
        {
          "program_name": "Example Master's Degree in Engineering",
          "eligibility_criteria": {
            "academic_qualifications": "Bachelor's degree in a related engineering field with a minimum GPA of 3.7.",
            "work_experience": "Minimum of 2 years of relevant professional experience (optional but recommended).",
            "research_experience": "Prior research experience is a plus."
          },
          "required_documents": [
            "Completed online application form",
            "Official undergraduate transcripts",
            "Resume/CV",
            "Statement of purpose",
            "Letters of recommendation (3)",
            "GRE scores"
          ],
          "application_deadline": "January 15th, 2025"
        }
      ]
    },
    "international_admissions": {
      "summary": "This text outlines various resources and programs available for international students. It covers aspects like admissions, student clubs, foundation courses, preparatory English programs, arrival information, grievance support, visa assistance, and general information about studying in India, including application procedures, fees, scholarships, and eligibility criteria.",
      "raw_content": "• International Admissions About International Office Clubs for International Students International student programs Foundation and Bridge Courses for International Students Message from Director International Relations Programmes and Fees Scholarships Eligibility Admission Process Preparatory English Foundation Program Pre & Post Arrival Information for International Students International Students Grievances Wing Visa and FRRO Support International Apply Now Contact Us FAQs Download Brochure Testimonials Events Study in India\n• Clubs for International Students\n• Foundation and Bridge Courses for International Students\n• Message from Director International Relations\n• Preparatory English Foundation Program\n• Pre & Post Arrival Information for International Students\n• International Students Grievances Wing\n• Visa and FRRO Support\n• International"
    },
    "campus_life": {
      "summary": "The provided text outlines various aspects of campus life, including student organizations, extracurricular activities, essential services like hostels, library, and transportation, as well as notable events and initiatives such as Unifest, Smart India Hackathon 2022, and Toycathon Launchpad. It highlights opportunities for student engagement in sports, arts, culture, and national service programs like NCC and NSS.",
      "raw_content": "• Campus Life About the Campus Student Organization Societies & Clubs Hostel Library Transportation Services National Cadet Corps (NCC) National Service Scheme (NSS) Sports & Recreation Cafeteria Healthcare Facilities Unifest Events, Arts & Culture Resources & Facilities Convocation Smart India Hackathon 2022 Toycathon Launchpad\n• National Cadet Corps (NCC)\n• National Service Scheme (NSS)\n• Events, Arts & Culture\n• Smart India Hackathon 2022\n• Hostels\n• Library\n• Transportation Services\n• Sports & Recreation\n• Cafeteria\n• Healthcare Facilities\n• Unifest\n• Resources & Facilities\n• Convocation\n• Toycathon Launchpad"
    },
    "grievances": {
      "summary": "The provided text lists various committees, policies, and online portals designed to address grievances and prevent discrimination within an educational or organizational setting. These include mechanisms for handling caste-based discrimination, student and employee grievances, sexual harassment, and ragging, along with a COVID-19 counselling cell and an Internal Quality Assurance Cell.",
      "raw_content": "• Online Complaints Prevention of caste based discrimination at workplace committee Students Online portal for Redressal of Grievances Employee Online portal for Redressal of Grievances Anti-ragging Policy Complaint Committee for Prevention of Sexual Harassment\n• Prevention of caste based discrimination at workplace committee\n• Students Online portal for Redressal of Grievances\n• Employee Online portal for Redressal of Grievances\n• Complaint Committee for Prevention of Sexual Harassment\n• Anti-ragging Policy\n• Covid-19 Counselling Cell\n• Internal Quality Assurance Cell (IQAC)"
    },
    "research": {
      "summary": "This document outlines the various initiatives and achievements within the research domain of an institution, as communicated by the Dean of Research. It highlights areas such as research excellence, global engagement, R&D cells, interdisciplinary research, ethics, publications, organized events, international collaborations, faculty development, awards, citations, outreach, and specialized research centers.",
      "raw_content": "• Research Message from Dean (Research)\nResearch Excellence and Global Engagement\nResearch & Development Cell\nGalgotias Centre for Interdisciplinary Research\nResearch Ethics Application Department wise Publication Summary Research Group Organized Events International & National Events International FDPs Research Awards Scopus Citation WoS Citation Newsletter Session with Noble Laureates DSIR - SIRO Recognition Centres of Excellence Media Outreach Research Group Diversity Open House Project for Students Honorary Professors Best Practices G-MRDC Centre of Excellence for Semiconductor Research\n• Message from Dean (Research)\n• Research Excellence and Global Engagement\n• Research & Development Cell\n• Galgotias Centre for Interdisciplinary Research\n• Research Ethics Application\n• Department wise Publication Summary\n• Research Group Organized Events\n• International & National Events\n• International FDPs\n• Research Awards\n• Scopus Citation\n• WoS Citation\n• Newsletter\n• Session with Noble Laureates\n• DSIR - SIRO Recognition\n• Centres of Excellence\n• Media Outreach\n• Research Group Diversity\n• Open House Project for Students\n• Honorary Professors\n• Best Practices\n• G-MRDC Centre of Excellence for Semiconductor Research\n"
    },
    "placements": {
      "summary": "This text outlines various aspects related to placements, career planning, and development, including information on associated recruiters, corporate tie-ups, placement records, an employability enhancement program, placement policies and brochures, feedback from recruiters and students, identification of highest performers, a placement gallery, and a mention of ARIIA-2021.",
      "raw_content": "• Placements Latest Placements Career Planning and Development Division (CPDD) Associated Recruiters Corporate Tie Ups Placement Records Employability Enhancement Program Placement Policy Placement Brochure Recruiters Speak Students Speak Highest Performers Placement Gallery\n• Latest Placements\n• Career Planning and Development Division (CPDD)\n• Associated Recruiters\n• Corporate Tie Ups\n• Placement Records\n• Employability Enhancement Program\n• Placement Policy\n• Placement Brochure\n• Recruiters Speak\n• Students Speak\n• Highest Performers\n• Placement Gallery\n• ARIIA-2021"
    },
    "rankings": {
      "summary": "This text highlights the university's achievements in the QS World University Rankings 2026, placing it amongst the top private universities in India (15th) and among the top private and government universities in India overall (43rd). It also includes a call to action, \"Enquire Now.\"",
      "raw_content": "Enquire Now\n15th\nAmongst Top Private Universities In India\n43rd\nAmongst Top Private and Government Universities In India\nQS World University Rankings 2026"
    },
    "faculty": {
      "summary": "The provided text lists four individuals, each identified with a professional title such as Professor (Dr.) or Dr., indicating a list of academics or professionals.",
      "raw_content": "• Prof. (Dr) Avadhesh Kumar\n• Prof. (Dr.) Renu Luthra\n• Dr. Shashi Bala Singh\n• Prof. (Dr.) Meenakshi Sharma"
    },
    "legal_compliance": {
      "summary": "This text indicates a section or process related to tender management and vendor registration.",
      "raw_content": "• Tender & Vendor Registration"
    },
    "documentation": {
      "summary": "This text appears to be a list of downloadable documents or links. The items include a brochure download, a document titled \"GU Vision Plan_2030\" dated January 21, 2024, and the \"Annual Report-2022-23.\"",
      "raw_content": "• Download Brochure\n• GU Vision Plan_2030 21-01-2024\n• Annual Report-2022-23"
    },
    "student_engagement": {
      "summary": "This text appears to be a brief list of items or topics, possibly from a presentation or agenda, mentioning a chat with Ambassadors and \"DPBH 2023.\"",
      "raw_content": "• Chat with an Ambassadors\n• DPBH 2023"
    },
    "technical_info": {
      "summary": "The provided text indicates a reference to events or periods labeled as SIH for the years 2023 and 2024.",
      "raw_content": "• SIH -2023 and 2024"
    }
  }
}