{
  "source_file": "www.sharda.ac.in_BSc_in_Biotechnology_Admission_Fees_Syllabus_Subjects_Duration_raw_2025-08-10-18-29-21.txt",
  "structured_data": {
    "general_info": {
      "summary": "The provided text lists guidelines related to visas, FRO/FRRO, and medical insurance, indicating these are separate categories of information.",
      "raw_content": "Guidelines for Visa and FRO/FRRO\n• Guidelines for Visa and FRO/FRRO\nGuidelines for Medical Insurance\n• Guidelines for Medical Insurance"
    },
    "career_path": {
      "summary": "This text outlines career paths for biotechnology graduates, highlighting opportunities in biotech, pharmaceutical, research, and academic sectors. It specifies that graduates can work as research agents, in clinical research and diagnostics, or as educators. The typical annual salary package for these positions ranges from 4.50 LPA to 6.00 LPA, and the text encourages individuals to pursue a career in basic sciences.",
      "raw_content": "How to apply for the course?\nCareer path you can choose after the course\n• Biotech Food and and Pharmaceutical companies: These are the biggest employers for Biotechnologist in the private sector. They are employed as research agents to develop new and innovative techniques to aid in healthcare and agricultural sector.\n• Research Laboratories and Hospitals: Reputed medical and biological research facilities across the country offer entry level positions to genetic engineers graduates in clinical reasearh and diagnostics\n• Universities/Institutes: Biotechnology as a field of study is growing at a rapid pace. The increased interest of students in this subject has also escalated the demand for qualified and trained teachers and professors. Many undergraduate and postgraduate degree holders in genetics are hired at teaching position in different universities and institutes across India and abroad\nStudents of this programme are placed in companies with an average annual package of 4.50 LPA to 6.00 LPA\nTake the next step towards a career in basic sciences."
    }
  }
}