{
  "source_file": "www.sharda.ac.in_PhD_in_Pharmacy-_Duration_Admission_2025-26_-_Sharda_University_raw_2025-08-10-18-29-12.txt",
  "structured_data": {
    "general_info": {
      "summary": "This document provides a comprehensive overview of Sharda University, covering its various schools, academic programs, fees, admissions process, and student testimonials. It details doctoral pharmacy programs, highlighting their research focus and career prospects, along with specific admission steps and fee structures. The text also includes information on scholarships, campus services like banking and accommodation, university initiatives in capacity building and entrepreneurship, and contact details. Student feedback emphasizes the supportive faculty, effective placement support, and the overall enriching academic and personal growth experience at Sharda University.",
      "raw_content": "• Programme 2025-26\n• School of Dental Sciences\nSchool of Medical Sciences & Research\nSharda School of Nursing Science & Research\n• School of Medical Sciences & Research\n• Sharda School of Nursing Science & Research\nExamination Annual Report\nAcademic Bank of Credits (ABC)\nCurricula Feedback\nUniversity Brochure\n• Examination Annual Report\n• Academic Bank of Credits (ABC)\n• Curricula Feedback\n• University Brochure\nProgramme Fee\nHostel Fee\nTransportation Fee\nScholarship\nInnovative Idea Scholarship\n• Programme Fee\n• Hostel Fee\n• Transportation Fee\n• Scholarship\n• Innovative Idea Scholarship\n• Fee Structure for Previous Year Students\n• SUAT 2025\nSample Papers\n• Sample Papers\nGlobal Knowledge Seekers\n• Global Knowledge Seekers\nOur Recruiters\n• Our Recruiters\nBanking And Postal Services\n• Banking And Postal Services\nPerspective Plan\nLeadership\nHistory\nStatutory Bodies of the University\nSharda Tenders\nAct, Statutes and Ordinances\nCOVID19\nFamily & Couple Counselling Services(FCCS)\nCapacity Development & Skill Enhancement\nLanguage and Communication Skill Initiatives: Sharda Skills\nSoft Skill Initiatives : Career Counseling and Development Center\nAwareness of Trends in Technology : IIC\nEntrepreneurship\nInnovation and Entrepreneurship\n• Get to know sharda\n• Perspective Plan\n• Leadership\n• History\n• Statutory Bodies of the University\n• Sharda Tenders\n• Act, Statutes and Ordinances\n• COVID19\n• Family & Couple Counselling Services(FCCS)\n• Capacity Development & Skill Enhancement\n• Language and Communication Skill Initiatives: Sharda Skills\n• Soft Skill Initiatives : Career Counseling and Development Center\n• Awareness of Trends in Technology : IIC\n• Entrepreneurship\n• Innovation and Entrepreneurship\nFM Radio: Suno Sharda-90.8FM\n• FM Radio: Suno Sharda-90.8FM\nAccommodation Fee\nGuidelines for Visa and FRO/FRRO\nGuidelines for Medical Insurance\nObservership Programmes\n• Accommodation Fee\n• Guidelines for Visa and FRO/FRRO\n• Guidelines for Medical Insurance\n• Observership Programmes\nParamarsh- Our Mentoring Portal\n• Paramarsh- Our Mentoring Portal\nSharda University's doctoral pharmacy programmes are designed to meet the requirement of the latest pharmaceutical developments and envisage becoming a state-of-the-art centre providing high-quality education and cutting-edge interdisciplinary research in the pharmaceutical industry. The programmes offer a balanced theoretical and practical exposure with the benefit of a well-equipped laboratory for medications related experiments. Upon completion, scholars are deemed to be prepared for careers in pharma companies, government hospitals, medical labs, defence services, among others.\nThroughout the programme, students have the opportunity to work with a group of innovative research scientists, along with the tools to progress beyond their research degree into prominent positions within academia, industry, and consultancy. The University has academic tie-ups with various reputed national/international organisations and research laboratories. The available research facilities in these organisations and labs can be utilised by the enrolled PhD scholars to enhance the quality of work and further research.\nList of Programm Offered (Full Time/Part-Time)\nApplication & Admission Process\n• Step-1: Fill the Online Application Form\n• Step 2: Confirm Programme/Specialisation, generate your System ID\n• Step 3: Complete Additional details/Educational Details & Upload photo signature & Documents\n• Step 4: Proceed with the payment of the application fee i.e. INR 1500 /\n• Step-5: Online Enterance Exam (In the case, Ph.D application approved)\nCandidates with valid selection from NET / GATE / SET / UET / any other equivalent test conducted by GOI accredited agency (to be decided by the selection committee) are exempted from entrance test and get preference in selection.\nProgramme Fee Structure\nTuition Fees ( Full Time and Part-Time ): Rs. 75000/-\nAdmission and Exam Fees ( Full Time and Part-Time ): Rs. 36000/- (Non-Refundable)\n• A candidate must have cleared post-graduate (PG) degree or equivalent of minimum duration of 2 years from a UGC recognized Indian / foreign university in respective discipline with score of minimum 55% or equivalent CGPA. A 5% relaxation in score for SC/ST/OBC i.e minimum of 50% in PG degree or equivalent CGPA is allowed.\nProgramme Duration- Min. 3 Years\nS.No. | Academic year | Curricula Link\n1 | 2021 | View Details\nIn my experience all the teachers are very supportive and friendly and the placement process has been very smooth throughout. I would always be very grateful for the lifelong connections I made\nMBA – Business Analytics, 2022-23\nPlaced In : EY Global Delivery Services\n\"My experience at Sharda University is great and memorable. The mentors at Sharda University helped us enhance my academic and interpersonal skills. I am thankful to Training & Placement cell for providing a platform to enhance my skills and an opportunity to showcase them. In the last I am saying that The World is here at Sharda University.\"\nB.Tech (CSE) , 2017-2021\n“It was a great experience studying at Sharda University, a memory to cherish for lifetime. My experience at Sharda was full of learning and grooming. Being a global university It gave me an opportunity to meet different kind of people from around the world and learnt many things from them. I am thankful to all the faculties, mentors and entire SET department for providing us with quality education. I am also grateful to TNP Cell for organising placements in this pandemic and helping me to get placed in 3 companies on Campus including Tcs Digital. Overall it was a great experience and lifetime memory at Sharda University. If you want to make a career in CSE I would highly recommend you to join Sharda University.”\nB.Tech. (CSE) , 2017-2021\nPlaced In : TCS Digital\nIt was my immense luck and fortune to be the part of Sharda University where I can grow. The entire faculty and department leaves no stone unturned to shape one's future. My four years at Sharda have been a wonderful experience of learning with prolific exposure to outside. Huge respect, love and devotion for entire faculty members and department. It's their efforts that make me to count myself into better professionals.\nB.Tech - Mechanical Engineering, 2019-2020\nPlaced In : Dorset Industries Pvt. Ltd\nSharda University has been a great contributor to the development of my personality. I have established my leadership, time management and team skills and have also been able to advance these skills to the whole new augment level. The infrastructure of Sharda University is one of the finest in the NCR region is what stands out the most. The best thing about this University is the cross-culture interaction between students from various parts of the world. The professors here make the university what it is today. With an attitude of being ever ready to help, and not only delivering classroom teachings, but they are also the pillars of the learning gained from this esteemed university and this is a treasure for life.\nMy four years at Sharda were great and a memory to cherish for lifetime. It was full of learning and grooming oneself. It gave me an opportunity to meet different kind of people and learned many things. I am thankful to all the faculties, mentors and entire SET as well as placement cell. Overall it was a great experience and lifetime memory at Sharda.\nB.Tech - Computer Science, 2019-2020\nPlaced In : NTT Data\n• Harsh Pratap Singh\nGreat experience from Sharda. You get a lot of opportunities. Work hard to get it. Be prepared for everything. Maintain your attendance.\nPlaced In : Think & Learn (BYJUs)\nHarsh Pratap Singh\nB.Tech - Computer Science (Clou..., 2019-2020\nPlaced In : Tech Mahindra\nSharda University is a place where you can find an amalgamation of learning. I feel great studying at Sharda University as it gives great opportunity as well as support from faculties and placement officers. Getting placed in Wipro is an achievement for me for which i would like to thank Sharda university.\nPlaced In : Wipro Technologies\nSharda University is great place to learn.It gives me great to say with pride that i have completed my B.tech in cse from this University.The relationship between faculities and student is very cordial, which gave me an opportunity to excel in my area of interest. The T and P cell is very supportive and they have conducted various sessions which helped me to get placed.\nPlaced In : Daffodil Software\nSharda University and SET faculties have put in all the efforts to groom us and make us corporate professionals. It was a wonderful experience at Sharda University.\nB-Tech- Computer Science(Cloud ..., 2019-2020\n• Harshita Sachdeva\nMy bachelor degree at Sharda in computer science consisted of many projects based evaluation and faculty connect. The mentors at Sharda University helped us enhance my academic and interpersonal skills. The regular interaction with the Placement team also encouraged me to excel in my interview and developing skills that are required for future use.\nB-Tech : Computer Science(Cloud..., 2019-2020\nHarshita Sachdeva\nMy experience at Sharda University is great and memorable. The teachers and mentors are really helpful and helped me to improve my academic and interpersonal skills.\nB-Tech- Computer Science(Cloud ...\nMy bachelor's degree at Sharda in computer science consisted of many projects based evaluation and faculty connect. The mentors at Sharda University helped us enhance my academic and interpersonal skills. The regular interaction with the Placement team also encouraged me to excel in my interview and developing skills that are required for future use.\nMy bachelor degree at Sharda in computer science consisted of many project based evaluation and faculty connect. The mentors at Sharda helped us enhance my academic and interpersonal skills.\nRecruiters\n• Course Fee\n• Recruiters\n• Covid 19 Updates\n• Sharda University Uzbekistan\n• Sharda University Agra\n• Courses on Human Values and Professional ethics\n• National Cyber Crime Reporting Portal\n• International Credit Transfer Programme\n85923891\n+91-120-4570000\n• +91-120-4570000\n+91-9205586066\n+91-8800998881\nSource: https://www.sharda.ac.in/admissions/doctoral/pharmacy"
    }
  }
}