{
  "source_file": "www.galgotiasuniversity.edu.in_Best_Computer_Application_Colleges_in_NCR_Uttar_Pradesh_raw_2025-08-10-18-45-12.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text appears to be a navigation or content outline for the international admissions section of the India Today Media Institute. It lists various programs, services, and information relevant to international students, including admission processes, courses, scholarships, student support services like grievances and visa assistance, and login portals.",
      "raw_content": "• India Today Media Institute\n• International Admissions About International Office Clubs for International Students International student programs Foundation and Bridge Courses for International Students Message from Director International Relations Programmes and Fees Scholarships Eligibility Admission Process Preparatory English Foundation Program Pre & Post Arrival Information for International Students International Students Grievances Wing Visa and FRRO Support International Apply Now Contact Us FAQs Download Brochure Testimonials Events Study in India\n• Clubs for International Students\n• Foundation and Bridge Courses for International Students\n• Message from Director International Relations\n• Programmes and Fees\n• Scholarships\n• Preparatory English Foundation Program\n• Pre & Post Arrival Information for International Students\n• International Students Grievances Wing\n• Visa and FRRO Support\n• Login Employee Login Student Login LMS Login"
    },
    "campus_life": {
      "summary": "This text lists various aspects of campus life, including student organizations, hostel facilities, library, transportation, and extracurricular activities like NCC and NSS. It also highlights specific events and initiatives such as Unifest, Arts & Culture programs, the Smart India Hackathon 2022, and Toycathon.",
      "raw_content": "• Campus Life About the Campus Student Organization Societies & Clubs Hostel Library Transportation Services National Cadet Corps (NCC) National Service Scheme (NSS) Sports & Recreation Cafeteria Healthcare Facilities Unifest Events, Arts & Culture Resources & Facilities Convocation Smart India Hackathon 2022 Toycathon Launchpad\n• National Cadet Corps (NCC)\n• National Service Scheme (NSS)\n• Events, Arts & Culture\n• Smart India Hackathon 2022"
    },
    "complaints_and_grievances": {
      "summary": "The provided text lists various committees and online portals designed to address grievances and prevent discrimination and harassment in the workplace and educational settings. These include initiatives for preventing caste-based discrimination, student and employee grievance redressal, and a complaint committee focused on preventing sexual harassment.",
      "raw_content": "• Online Complaints Prevention of caste based discrimination at workplace committee Students Online portal for Redressal of Grievances Employee Online portal for Redressal of Grievances Anti-ragging Policy Complaint Committee for Prevention of Sexual Harassment\n• Prevention of caste based discrimination at workplace committee\n• Students Online portal for Redressal of Grievances\n• Employee Online portal for Redressal of Grievances\n• Complaint Committee for Prevention of Sexual Harassment"
    },
    "about_university": {
      "summary": "The provided text lists various sections related to Galgotias University, including information about the university itself, its leadership, awards and rankings, partnerships, and specific academic areas like iOS development. It also mentions details about the university's legacy, governance, international academic team, accreditations, mandatory disclosures, policies, and regulations.",
      "raw_content": "• About GU About Us Galgotias University Our Legacy The Galgotias Story Leadership Governance International Academic Team Awards, Rankings & Certifications Accreditations Mandatory Disclosures Policies & Regulations Partnerships & Collaborations iOS Development Center Virtual tour\n• Galgotias University\n• Leadership\n• Awards, Rankings & Certifications\n• Partnerships & Collaborations"
    },
    "schools": {
      "summary": "The provided text lists various schools and departments within an institution, encompassing a broad range of disciplines. These include specialized areas like Defence Technology, Computer Science & Engineering, Artificial Intelligence, Aviation, Logistics & Tourism Management, and Computer Applications & Technology, as well as broader fields such as Engineering, Business, Law, Finance and Commerce, Liberal Education, Medical and Allied Sciences, Nursing, Basic Sciences, Media & Communication Studies, Design, Biosciences and Technology, Vocational Education, and Life Long Learning.",
      "raw_content": "• Schools School of Defence Technology School of Computer Science & Engineering School of Artificial Intelligence School of Aviation, Logistics & Tourism Management School of Computer Applications & Technology School of Engineering School of Business School of Law View More\n• School of Defence Technology\nSchool of Defence Technology\n• School of Computer Science & Engineering\nSchool of Computer Science & Engineering\n• School of Artificial Intelligence\nSchool of Artificial Intelligence\n• School of Aviation, Logistics & Tourism Management\nSchool of Aviation, Logistics & Tourism Management\n• School of Computer Applications & Technology\nSchool of Computer Applications & Technology\n• School of Finance and Commerce\n• School of Liberal Education\n• School of Medical and Allied Sciences\n• School of Nursing\n• School of Allied Health Sciences\n• School of Basic Sciences\n• School of Media & Communication Studies\n• School of Design\n• School of Biosciences and Technology\n• School of Vocational Education\n• School of Life Long Learning"
    },
    "programs": {
      "summary": "The provided text outlines various academic program categories, including undergraduate, diploma, postgraduate, doctoral, and certificate programs. It also specifically highlights programs designed for working professionals and online course offerings.",
      "raw_content": "• Programs Under Graduate Programs Diploma Programs Post Graduate Programs Doctoral Programs Certificate Programs Programs for working professionals Online Courses\n• Programs for working professionals\nPrograms for working professionals\n• Online Courses\nOnline Courses\n"
    },
    "admission_and_fees": {
      "summary": "This text outlines various aspects of a university or educational institution's administrative and financial processes. It covers fee structures, eligibility criteria, scholarship opportunities, hostel accommodation, lateral entry and migration admissions, financial aid, loan facilities, and the necessary admission documents and undertakings.",
      "raw_content": "Fee Structure & Eligibility Scholarships Hostel Lateral Entry/Migration Admission Financial Aid & Loan Facilities\n• Fee Structure & Eligibility\n• Financial Aid & Loan Facilities\n• Admission Documents & Undertaking\n• Admission & Education Loan Assistance\n• Fees Payment"
    },
    "research": {
      "summary": "This text outlines various initiatives and departments within a research-focused institution, highlighting areas such as research excellence, global engagement, interdisciplinary research, publication summaries, organized events, recognition, and centers of excellence. It also mentions specific programs like sessions with Nobel laureates and outreach activities.",
      "raw_content": "• Research Message from Dean (Research)\nResearch Excellence and Global Engagement\nResearch & Development Cell\nGalgotias Centre for Interdisciplinary Research\nResearch Ethics Application Department wise Publication Summary Research Group Organized Events International & National Events International FDPs Research Awards Scopus Citation WoS Citation Newsletter Session with Noble Laureates DSIR - SIRO Recognition Centres of Excellence Media Outreach Research Group Diversity Open House Project for Students Honorary Professors Best Practices G-MRDC Centre of Excellence for Semiconductor Research\n• Message from Dean (Research)\n• Research Excellence and Global Engagement\n• Research & Development Cell\n• Galgotias Centre for Interdisciplinary Research\n• Department wise Publication Summary\n• Research Group Organized Events\n• International & National Events\n• Session with Noble Laureates\n• DSIR - SIRO Recognition\n• Research Group Diversity\n• Open House Project for Students\n• Honorary Professors\n• Centre of Excellence for Semiconductor Research"
    },
    "academics": {
      "summary": "This text outlines various academic-related sections, including the academic calendar, learning model, choice-based credit system, MOUs, curriculum design and development, the examination cell, NEP-2020, downloadable forms, awards, and a holiday list, highlighting key areas like the learning model, curriculum design, and the National Education Policy 2020.",
      "raw_content": "• Academics Academics Academic Calendar Learning Model & Choice Based Credit System MOUs Curriculum Design and Development Examination Cell NEP-2020 Download Forms Awards Holiday List Achievements\n• Learning Model & Choice Based Credit System\n• Curriculum Design and Development\n• NEP-2020"
    },
    "placements": {
      "summary": "This text outlines various aspects of a placement and career planning division, including associated recruiters, placement records, an employability enhancement program, placement policies and brochures, and testimonials from recruiters and students. It also highlights the highest performers and includes a placement gallery.",
      "raw_content": "• Placements Latest Placements Career Planning and Development Division (CPDD) Associated Recruiters Corporate Tie Ups Placement Records Employability Enhancement Program Placement Policy Placement Brochure Recruiters Speak Students Speak Highest Performers Placement Gallery\n• Career Planning and Development Division (CPDD)\n• Associated Recruiters\n• Recruiters Speak\n• Highest Performers"
    },
    "partnerships_and_accreditations": {
      "summary": "The Department of Computer Applications and Technology at Galgotias University, accredited by NAAC with A+, cultivates partnerships with various Apex and Accreditation Bodies, including the National Council for Teacher Education, Pharmacy Council of India, and the University Grants Commission. These collaborations aim to provide students with advanced opportunities in research, innovation, and experiential learning, with specific programs like CSE, ECE, ME, MBA, and B.Pharm being accredited by NBA. Additional accreditations include those from the Association to Advance Collegiate Schools of Business and the Bar Council of India, reflecting a commitment to high educational standards across multiple disciplines.",
      "raw_content": "Enquire Now\n12K+ 30+ 50+ 85+\nDepartment of Computer Applications and Technology\nApex and Accreditation Bodies\nCultivating formidable partnerships with Apex and Accreditation Bodies to empower students with cutting-edge opportunities in research, innovation, and experiential learning excellence\nNational Council for Teacher Education.\nPharmacy Council of India\nThe Indian Association of Physiotherapists\nAssociation of Indian Universities\nGalgotias University accredited by NAAC with the A+\nPrograms are accredited by NBA (CSE, ECE, ME, MBA and B.Pharm)\nAssociation to Advance Collegiate Schools of Business\nUniversity Grants Commission\nAll India Council for Technical Education\nThe Bar Council of India\nIndian Nursing Council\n"
    },
    "student_community_and_innovation": {
      "summary": "The university fosters a vibrant community through its student council and various groups, encouraging involvement outside the classroom. It champions innovation and entrepreneurship with one of India's largest incubation centers supporting over 100 startups, and provides state-of-the-art tech laboratories for exploring future technologies. Additionally, students can enhance their potential through world-class sports facilities and a diverse range of extracurricular programs.",
      "raw_content": "Student Council & Groups\nBe Part of a Vibrant Community: Our student council and groups offer opportunities to connect, learn, and grow outside of the classroom. Discover how you can get involved today.\nBuilding the Next Big Thing: With 100+ Start-ups, Our incubation center is one of the India’s largest where innovation and entrepreneurship thrive. Join us in creating the future of business, technology, and social impact.\nExplore the Future of Tech: Our tech laboratories offer state-of-the-art equipment and expert faculty to guide you in exploring the latest advancements in tech. Start your journey today.\nUnleash your potential with world-class sports facilities and diverse extracurricular programs at our leading university.\nEmbrace the Opportunities of Our Dynamic Sports and Extracurricular Scene\nTake your Game to the Next Level with our Top-Notch Sports Infrastructure"
    },
    "other_departments_and_initiatives": {
      "summary": "This text lists various initiatives, cells, and events, primarily associated with Galgotias University. It includes the Covid-19 Counselling Cell, ARIIA-2021, tender and vendor registration, Viksit Bharat@2047, the Internal Quality Assurance Cell (IQAC), DPBH 2023, Galgotias University Vision 2030, the Galgotias News Network (GNN), and mentions of the Smart India Hackathon (SIH) for 2023 and 2024.",
      "raw_content": "• Covid-19 Counselling Cell\n• ARIIA-2021\n• Tender & Vendor Registration\n• Viksit Bharat@2047: Voice of Youth\n• Internal Quality Assurance Cell (IQAC)\n• DPBH 2023\n• Galgotias University Vision 2030\n• Galgotias News Network (GNN)\n• SIH -2023 and 2024"
    },
    "legal_and_regulatory": {
      "summary": "The provided text \"UGC PUBLIC SELF PORTAL\" is a short phrase that appears to refer to a public self-service portal for User Generated Content (UGC).",
      "raw_content": "UGC PUBLIC SELF PORTAL"
    },
    "documents": {
      "summary": "The provided text lists two documents: the GU Vision Plan 2030, dated January 21, 2024, and the Annual Report for the 2022-23 period.",
      "raw_content": "• GU Vision Plan_2030 21-01-2024\n• Annual Report-2022-23"
    },
    "services": {
      "summary": "This text appears to be a navigational element or call to action, suggesting users can \"Chat with an Ambassador.\"",
      "raw_content": "• Chat with an Ambassadors"
    },
    "copyright": {
      "summary": "This document contains copyright information for Galgotias in 2025 and credits City Innovates for the design, development, and maintenance of the content.",
      "raw_content": "• © 2025 Copyrights Galgotias. All rights reserved.\n• Designed, developed & maintained By : City Innovates"
    },
    "source_url": {
      "summary": "This is a link to the School of Computer Applications & Technology at Galgotias University, providing information about the school.",
      "raw_content": "Source: https://www.galgotiasuniversity.edu.in/p/schools/school-of-computer-applications--technology"
    }
  }
}