{
  "source_file": "www.sharda.ac.in_Research_Overview_-_Sharda_University_raw_2025-08-10-18-29-08.txt",
  "structured_data": {
    "general_info": {
      "summary": "This appears to be a link to the research section of the Sharda University website, indicating a resource for information related to their research activities.",
      "raw_content": "Source: https://www.sharda.ac.in/research"
    },
    "research_info": {
      "summary": "Sharda University has a strong commitment to research, fostering a vibrant research environment through its Research Development Cell. The cell supports various scholarly activities, including fundamental, applied, and contract research across disciplines like Science, Engineering, Technology, and Management. The university actively expands its research vision through new faculty, improved infrastructure, and collaborations with academia and industry. Key initiatives include encouraging interdisciplinary research, integrating teaching with research, fostering international partnerships, organizing knowledge dissemination events, and publishing research journals. Sharda University also boasts a significant number of patents and regularly hosts national and international conferences and workshops.",
      "raw_content": "Research has been an integral element for higher education at Sharda University since the time of its inception. The Research Development Cell at Sharda provides a vigorous and highly visible research environment to its students with an objective to research culture and develop the habit of leadership within the university. The cell supports all kinds of scholarly activities like fundamental research, applied research and development contract research for government, non-government and international agencies.\nOver the years the research efforts have expanded to include sponsored research and consultancy projects in multiple disciplines like in the field of Science, Engineering, Technology and Management.\nThe University continues to branch out its research vision with new faculty members/researchers and implementing new policies designed to improve the research infrastructure and also through new academic & industry collaborations. The University with their researchers and other teams continues to regularly welcome external partners who support our vision by sharing ideas, pooling resources, and collaborating on findings promoting innovative research.\n• Perform interdisciplinary and unconventional research.\n• Ensuring the integration of teaching and research, and the involvement of our students in the research processes.\n• Develop international strategic partnerships.\n• Organise seminars, panels and lectures to disseminate knowledge on various projects.\n• Collaborate with other institutions at both local and international levels.\n• The University publishes two research journals namely, Journal of Scientific and Technical Research (JSTR), and International Journal of Management Issues and Research (IJMIR) regularly.\n• The faculty members/researchers have twelve patents pertaining to their innovative research work under their name.\n• The University regularly organises conferences and workshops at national and international level.\n• 5984+\nPapers(Scopus/Pubmed/Web of Science/SCI/UGC)\n• 3884+\nBook Chapters/ Conference Proceedings\nPatent Published & 200 Granted\n• 30+\nFortune 500 Companies\nDr. Bhuvnesh Kumar, Dean Research and Distinguished Professor\nClick here to view the Patents"
    },
    "research_projects": {
      "summary": "This document lists several research publications authored or co-authored by Rohit Kumar, Piyush Kumar Gupta, Niraj Kumar Jha, Saurabh Kumar Jha, and others. The research areas span from managing chemotherapy side effects with mobile technology and developing biocompatible nanocomposites to the synthesis of nanoparticles for combating bacterial pathogens and aptameric nanobiosensors for COVID-19 diagnosis. Other topics include chronotherapy for respiratory diseases, microfluidic chips, and geopolymer concretes derived from fly ash and kaolin.",
      "raw_content": "Efficacy of Mobile Phone Technology for Managing Side Effects Associated with Chemotherapy among Cancer Patients: A Systematic Review and Meta-Analysis\n• Rohit Kumar, Piyush Kumar Gupta, Soumya Pandit, Niraj Kumar Jha\nSynthesis and characterization of biocompatible bimetallic-semi-aromatic polyester hybrid nanocomposite\nRohit Kumar, Piyush Kumar Gupta, Soumya Pandit, Niraj Kumar Jha\nSynthesis, Characterization and Remedial Action of Biogenic Silver Nanoparticles\nand Chitosan-Silver Nanoparticles against Bacterial Pathogens\n• PiyushKumar Gupta, Niraj Kumar Jha\nAptameric Nanobiosensors for the Diagnosis of COVID-19: An Update\nPiyushKumar Gupta, Niraj Kumar Jha\nPhytocompound Mediated Blockage of Quorum Sensing Cascade in ESKAPE Pathogens\n• Saurabh Kumar Jha, Madhan Jeyaraman?? and Rashmi Jain\nA Step Toward Optimizing Regenerative Medicine Principle to Combat COVID-19\nSaurabh Kumar Jha, Madhan Jeyaraman?? and Rashmi Jain\n• Niraj Kumar Jha and Saurav Kumar Jha\nRecent Advances in Chronotherapy Targeting Respiratory Diseases\nNiraj Kumar Jha and Saurav Kumar Jha\n• Niraj Kumar Jha and Piyush Kumar Gupta\nMicrofluidic Chips: Recent Advances, Critical Strategies in Design, Application and Future Perspectives\nNiraj Kumar Jha and Piyush Kumar Gupta\n• Okoye F.N., Durgaprasad J., Singh N.B.\nFly ash/Kaolin based geopolymer green concretes and their mechanical properties (2015) Vol.5 Page.739-744\nOkoye F.N., Durgaprasad J., Singh N.B.\nMechanical properties of alkali activated flyash/Kaolin based geopolymer concrete Construction and Building Materials (2015) Vol.98 Page.685-691"
    },
    "research_journals": {
      "summary": "Sharda University publishes two research journals: the Journal of Scientific and Technical Research (JSTR), which features multidisciplinary research from various institutions, and the Sharda Law Review (SLR), a bi-annual, blind peer-reviewed journal from the School of Law.",
      "raw_content": "Sharda University is regularly publishing two research journals titled\nJOURNAL OF SCIENTIFIC AND TECHNICAL RESEARCH (JSTR)\nJournal of Scientific and Technical Research (JSTR) includes multidisciplinary research paper from different universities and research centres.\nSharda Law Review (SLR)\nSLR is a bi-annual blind peer-reviewed journal published by the School of Law."
    }
  }
}