{
  "source_file": "www.galgotiasuniversity.edu.in_Best_College_for_Computer_Application_in_India_Galgotias_University_raw_2025-08-10-18-45-11.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text outlines various aspects of an educational institution, likely Galgotias University and the India Today Media Institute. It details programs and admissions for international students, including foundation courses, scholarships, and pre/post-arrival information, along with support services like visa assistance. The content also covers campus life, student organizations, extracurricular activities (NCC, NSS), and events. Furthermore, it addresses institutional policies, grievance redressal mechanisms, and information about the university's history, leadership, accreditations, and partnerships.",
      "raw_content": "• India Today Media Institute\n• International Admissions About International Office Clubs for International Students International student programs Foundation and Bridge Courses for International Students Message from Director International Relations Programmes and Fees Scholarships Eligibility Admission Process Preparatory English Foundation Program Pre & Post Arrival Information for International Students International Students Grievances Wing Visa and FRRO Support International Apply Now Contact Us FAQs Download Brochure Testimonials Events Study in India\n• Clubs for International Students\n• Foundation and Bridge Courses for International Students\n• Message from Director International Relations\n• Programmes and Fees\n• Scholarships\n• Preparatory English Foundation Program\n• Pre & Post Arrival Information for International Students\n• International Students Grievances Wing\n• Visa and FRRO Support\n• Login Employee Login Student Login LMS Login\n• Campus Life About the Campus Student Organization Societies & Clubs Hostel Library Transportation Services National Cadet Corps (NCC) National Service Scheme (NSS) Sports & Recreation Cafeteria Healthcare Facilities Unifest Events, Arts & Culture Resources & Facilities Convocation Smart India Hackathon 2022 Toycathon Launchpad\n• National Cadet Corps (NCC)\n• National Service Scheme (NSS)\n• Events, Arts & Culture\n• Smart India Hackathon 2022\n• Online Complaints Prevention of caste based discrimination at workplace committee Students Online portal for Redressal of Grievances Employee Online portal for Redressal of Grievances Anti-ragging Policy Complaint Committee for Prevention of Sexual Harassment\n• Prevention of caste based discrimination at workplace committee\n• Students Online portal for Redressal of Grievances\n• Employee Online portal for Redressal of Grievances\n• Complaint Committee for Prevention of Sexual Harassment\n• About GU About Us Galgotias University Our Legacy The Galgotias Story Leadership Governance International Academic Team Awards, Rankings & Certifications Accreditations Mandatory Disclosures Policies & Regulations Partnerships & Collaborations iOS Development Center Virtual tour\n• Galgotias University\n• Leadership\n• Awards, Rankings & Certifications\n• Partnerships & Collaborations"
    },
    "research": {
      "summary": "This document outlines key research initiatives and achievements, likely from an academic institution. It highlights areas such as research excellence, global engagement, departmental publication summaries, organized events (international and national), sessions with Nobel laureates, institutional recognitions like DSIR-SIRO, and specific centers of excellence, including one for semiconductor research. The content appears to be a structured listing of research-related activities and acknowledgments.",
      "raw_content": "• Research Message from Dean (Research)\nResearch Excellence and Global Engagement\nResearch & Development Cell\nGalgotias Centre for Interdisciplinary Research\nResearch Ethics Application Department wise Publication Summary Research Group Organized Events International & National Events International FDPs Research Awards Scopus Citation WoS Citation Newsletter Session with Noble Laureates DSIR - SIRO Recognition Centres of Excellence Media Outreach Research Group Diversity Open House Project for Students Honorary Professors Best Practices G-MRDC Centre of Excellence for Semiconductor Research\n• Message from Dean (Research)\n• Research Excellence and Global Engagement\n• Research & Development Cell\n• Galgotias Centre for Interdisciplinary Research\n• Department wise Publication Summary\n• Research Group Organized Events\n• International & National Events\n• Session with Noble Laureates\n• DSIR - SIRO Recognition\n• Research Group Diversity\n• Open House Project for Students\n• Honorary Professors\n• Centre of Excellence for Semiconductor Research"
    },
    "academics": {
      "summary": "This text outlines various academic-related sections and initiatives within an educational institution. It highlights key areas such as the academic calendar, learning models including the Choice Based Credit System, curriculum design and development, and the implementation of NEP-2020. Additionally, it mentions the examination cell, available downloads, awards, holiday lists, and past achievements.",
      "raw_content": "• Academics Academics Academic Calendar Learning Model & Choice Based Credit System MOUs Curriculum Design and Development Examination Cell NEP-2020 Download Forms Awards Holiday List Achievements\n• Learning Model & Choice Based Credit System\n• Curriculum Design and Development\n• NEP-2020"
    },
    "placements": {
      "summary": "This document outlines various aspects of a career planning and placement division, including information on recent placements, career development programs, associated recruiters, placement policies, and testimonials from recruiters and students, highlighting top performers and providing a placement gallery.",
      "raw_content": "• Placements Latest Placements Career Planning and Development Division (CPDD) Associated Recruiters Corporate Tie Ups Placement Records Employability Enhancement Program Placement Policy Placement Brochure Recruiters Speak Students Speak Highest Performers Placement Gallery\n• Career Planning and Development Division (CPDD)\n• Associated Recruiters\n• Recruiters Speak\n• Highest Performers"
    },
    "school_specific_info": {
      "summary": "The \"Message from the Dean\" by Prof (Dr.) Vineeta Khemchnadani warmly welcomes visitors to the School of Computer Applications & Technology (SCAT). The Dean expresses pride in SCAT's position at the forefront of technological innovation and education, highlighting the school's commitment to academic excellence through a rigorous curriculum, hands-on learning, and research opportunities that prepare students for future challenges. The message also emphasizes the collaborative spirit within the school, fostering creativity, innovation, and inclusivity through interdisciplinary projects, industry partnerships, and community engagement. The Dean invites exploration of the school and encourages continued innovation and positive impact on the world.",
      "raw_content": "Department of Computer Applications and Technology\n12K+\n30+\n50+\n85+\n• Message from the Dean\n• Faculty Members\n• Lab facilities and Infrastructure\n• Industry Mentors\n• Training & Industry Visits\nMessage from the Dean\nProf (Dr.) Vineeta Khemchnadani\nIt’s my pleasure to extend warm greetings to all who visit at the School of Computer Applications & Technology (SCAT).\nAs we navigate through the ever-evolving landscape of technology and education, I am filled with a profound sense of pride and optimism for the School of Computer Applications and Technology continues to be at the forefront of innovation and is driven by our collective dedication to excellence and unwavering commitment to shaping the future of computing.\nIn our pursuit of academic excellence, we prepare our students to meet the challenges of today and empower them to become the trailblazers of tomorrow. Our rigorous curriculum, hands-on learning experiences and cutting-edge research opportunities, equips our graduates with the skills and knowledge needed to thrive in a rapidly advancing technological world.\nI am particularly delighted by the collaborative spirit that runs through our school. Whether it's through interdisciplinary projects, industry partnerships, or community engagement initiatives, our students and faculty are constantly pushing the conventional boundaries. This spirit of collaboration not only enriches our academic programs but also fosters a culture of creativity, innovation, and inclusivity.\nWhether you are a prospective student, a current student, an alumnus, a faculty member, or simply someone with an interest in computer applications and concerned technologies, I invite you to explore our school and learn more about what makes the School of Computer Applications & Technology a truly exceptional place to study, work, and collaborate.\nAs we embark on another exciting academic year, I encourage you to embrace the opportunities that lie ahead. Let us continue to inspire one another, push the boundaries of innovation, and make a positive impact on the world around us.\nTogether, we will shape the future of computing, one breakthrough at a time.\n"
    },
    "other_schools": {
      "summary": "The provided text lists various schools within an institution, including those focused on Finance and Commerce, Liberal Education, Medical and Allied Sciences, Nursing, Allied Health Sciences, Basic Sciences, Media & Communication Studies, Design, Biosciences and Technology, Vocational Education, and Life Long Learning.",
      "raw_content": "• School of Finance and Commerce\n• School of Liberal Education\n• School of Medical and Allied Sciences\n• School of Nursing\n• School of Allied Health Sciences\n• School of Basic Sciences\n• School of Media & Communication Studies\n• School of Design\n• School of Biosciences and Technology\n• School of Vocational Education\n• School of Life Long Learning"
    },
    "additional_info": {
      "summary": "This text lists various initiatives, cells, and programs, likely associated with an educational institution. Key items include a COVID-19 Counselling Cell, support for admissions and education loans, national innovation awards (ARIIA, SIH), a vision document (Galgotias University Vision 2030), a news network, and a youth initiative for national development (Viksit Bharat@2047).",
      "raw_content": "• Covid-19 Counselling Cell\n• Admission & Education Loan Assistance\n• ARIIA-2021\n• Tender & Vendor Registration\n• Viksit Bharat@2047: Voice of Youth\n• Internal Quality Assurance Cell (IQAC)\n• DPBH 2023\n• Galgotias University Vision 2030\n• Galgotias News Network (GNN)\n• SIH -2023 and 2024"
    }
  }
}