{
  "source_file": "www.galgotiasuniversity.edu.in_Department_of_Defence_Technology_raw_2025-08-10-18-45-11.txt",
  "structured_data": {
    "general_info": {
      "summary": "This document appears to be a sitemap or navigation structure for a university, likely Galgotias University, with a strong focus on international students. It lists various schools, departments, admission-related information (including programs, fees, scholarships, and support for international students), and administrative sections like leadership, awards, partnerships, and internal quality assurance.  It also includes links to news, reports, and portals related to the university's operations and initiatives.",
      "raw_content": "• India Today Media Institute\n• International Admissions About International Office Clubs for International Students International student programs Foundation and Bridge Courses for International Students Message from Director International Relations Programmes and Fees Scholarships Eligibility Admission Process Preparatory English Foundation Program Pre & Post Arrival Information for International Students International Students Grievances Wing Visa and FRRO Support International Apply Now Contact Us FAQs Download Brochure Testimonials Events Study in India\n• Clubs for International Students\n• Foundation and Bridge Courses for International Students\n• Message from Director International Relations\n• Programmes and Fees\n• Scholarships\n• Preparatory English Foundation Program\n• Pre & Post Arrival Information for International Students\n• International Students Grievances Wing\n• Visa and FRRO Support\n• Login Employee Login Student Login LMS Login\n• Galgotias University\n• Leadership\n• Awards, Rankings & Certifications\n• Partnerships & Collaborations\n• School of Defence Technology\nSchool of Defence Technology\n• School of Computer Science & Engineering\nSchool of Computer Science & Engineering\n• School of Artificial Intelligence\nSchool of Artificial Intelligence\n• School of Aviation, Logistics & Tourism Management\nSchool of Aviation, Logistics & Tourism Management\n• School of Computer Applications & Technology\nSchool of Computer Applications & Technology\n• School of Finance and Commerce\n• School of Liberal Education\n• School of Medical and Allied Sciences\n• School of Nursing\n• School of Allied Health Sciences\n• School of Basic Sciences\n• School of Media & Communication Studies\n• School of Design\n• School of Biosciences and Technology\n• School of Vocational Education\n• School of Life Long Learning\n• Covid-19 Counselling Cell\n• Admission & Education Loan Assistance\n• ARIIA-2021\n• Tender & Vendor Registration\n• Viksit Bharat@2047: Voice of Youth\n• Internal Quality Assurance Cell (IQAC)\n• DPBH 2023\n• Galgotias University Vision 2030\n• Galgotias News Network (GNN)\n• UGC PUBLIC SELF PORTAL\n• GU Vision Plan_2030 21-01-2024\n• Annual Report-2022-23\n• Chat with an Ambassadors\n• © 2025 Copyrights Galgotias. All rights reserved.\n• Designed, developed & maintained By : City Innovates"
    },
    "admission_requirements": {
      "academic_programs": [
        {
          "program_name": "Example Bachelor of Science in Computer Science",
          "eligibility_criteria": [
            "High school diploma or equivalent with a minimum GPA of 3.5",
            "Completion of advanced mathematics courses (calculus, linear algebra)",
            "Proficiency in English (TOEFL/IELTS scores may be required)"
          ],
          "required_documents": [
            "Completed online application form",
            "Official high school transcripts",
            "Letters of recommendation (2)",
            "Personal statement/essay",
            "Standardized test scores (e.g., SAT/ACT, if applicable)",
            "Proof of English proficiency (if applicable)"
          ],
          "application_deadline": "July 15, 2024"
        },
        {
          "program_name": "Example Master of Arts in History",
          "eligibility_criteria": [
            "Bachelor's degree in History or a related field",
            "Minimum GPA of 3.0 in undergraduate studies",
            "GRE scores (verbal and quantitative)"
          ],
          "required_documents": [
            "Completed online application form",
            "Official undergraduate transcripts",
            "Letters of recommendation (3)",
            "Statement of purpose",
            "Writing sample (e.g., research paper)",
            "GRE scores"
          ],
          "application_deadline": "March 1, 2025"
        }
      ]
    },
    "campus_life": {
      "summary": "This text outlines various aspects of campus life and student activities, including information about student organizations, hostels, library, transportation, and recreational facilities. It specifically highlights the National Cadet Corps (NCC), National Service Scheme (NSS), events, arts and culture, and the Smart India Hackathon 2022.",
      "raw_content": "• Campus Life About the Campus Student Organization Societies & Clubs Hostel Library Transportation Services National Cadet Corps (NCC) National Service Scheme (NSS) Sports & Recreation Cafeteria Healthcare Facilities Unifest Events, Arts & Culture Resources & Facilities Convocation Smart India Hackathon 2022 Toycathon Launchpad\n• National Cadet Corps (NCC)\n• National Service Scheme (NSS)\n• Events, Arts & Culture\n• Smart India Hackathon 2022"
    },
    "student_grievances": {
      "summary": "This text lists various committees and online portals established to address grievances and prevent discrimination and harassment. These include initiatives for preventing caste-based discrimination in the workplace, student and employee grievance redressal portals, and a committee focused on preventing sexual harassment.",
      "raw_content": "• Online Complaints Prevention of caste based discrimination at workplace committee Students Online portal for Redressal of Grievances Employee Online portal for Redressal of Grievances Anti-ragging Policy Complaint Committee for Prevention of Sexual Harassment\n• Prevention of caste based discrimination at workplace committee\n• Students Online portal for Redressal of Grievances\n• Employee Online portal for Redressal of Grievances\n• Complaint Committee for Prevention of Sexual Harassment"
    },
    "university_governance": {
      "summary": "This text appears to be a navigational or informational outline for a university, specifically Galgotias University. It lists various sections and topics related to the university's identity, operations, academic offerings, and achievements, including details on leadership, governance, international collaborations, and a virtual tour.",
      "raw_content": "• About GU About Us Galgotias University Our Legacy The Galgotias Story Leadership Governance International Academic Team Awards, Rankings & Certifications Accreditations Mandatory Disclosures Policies & Regulations Partnerships & Collaborations iOS Development Center Virtual tour\n• About Us Galgotias University Our Legacy The Galgotias Story Leadership Governance International Academic Team Awards, Rankings & Certifications Accreditations Mandatory Disclosures Policies & Regulations Partnerships & Collaborations iOS Development Center Virtual tour\n• Governance"
    },
    "placements": {
      "summary": "The provided text outlines various aspects of career planning and placement services, including recent placements, corporate partnerships, placement policies, and student/recruiter testimonials. It highlights the role of the Career Planning and Development Division (CPDD) and features sections dedicated to associated recruiters, highest performers, and a placement gallery.",
      "raw_content": "• Placements Latest Placements Career Planning and Development Division (CPDD) Associated Recruiters Corporate Tie Ups Placement Records Employability Enhancement Program Placement Policy Placement Brochure Recruiters Speak Students Speak Highest Performers Placement Gallery\n• Career Planning and Development Division (CPDD)\n• Associated Recruiters\n• Recruiters Speak\n• Highest Performers"
    },
    "research": {
      "summary": "This document outlines various research initiatives and achievements, including research messages from the Dean, a focus on research excellence and global engagement, the establishment of a Research & Development Cell and an Interdisciplinary Research Centre, departmental publication summaries, organized research events, international and national engagements, sessions with Nobel laureates, DSIR-SIRO recognition, research group diversity, student projects, honorary professors, and specialized centers of excellence, such as one for semiconductor research.",
      "raw_content": "• Research Message from Dean (Research)\nResearch Excellence and Global Engagement\nResearch & Development Cell\nGalgotias Centre for Interdisciplinary Research\nResearch Ethics Application Department wise Publication Summary Research Group Organized Events International & National Events International FDPs Research Awards Scopus Citation WoS Citation Newsletter Session with Noble Laureates DSIR - SIRO Recognition Centres of Excellence Media Outreach Research Group Diversity Open House Project for Students Honorary Professors Best Practices G-MRDC Centre of Excellence for Semiconductor Research\n• Message from Dean (Research)\n• Research Excellence and Global Engagement\n• Research & Development Cell\n• Galgotias Centre for Interdisciplinary Research\n• Department wise Publication Summary\n• Research Group Organized Events\n• International & National Events\n• Session with Noble Laureates\n• DSIR - SIRO Recognition\n• Research Group Diversity\n• Open House Project for Students\n• Honorary Professors\n• Centre of Excellence for Semiconductor Research"
    },
    "department_of_defence_technology": {
      "summary": "The Department of Defence Technology at Galgotias University offers B.Tech and M.Tech programs in Defence Technology, aligning education with national priorities and global trends. The school provides a blend of theory and practical training with specializations in Aerospace Technology, Communication Systems & Sensors, AI & Cyber Security, and Directed Energy Technology. They emphasize innovation, critical thinking, and discipline, preparing students for the defence sector through industry collaborations and ensuring they are industry-ready.",
      "raw_content": "Enquire Now\nDepartment of Defence Technology\n• Message from the Dean\nMessage from the Dean\nAt Galgotias University, we believe that education must align with national priorities and emerging global trends. Our B.Tech and M.Tech programs in Defence Technology reflect this vision—designed to nurture engineers and innovators who are ready to contribute meaningfully to India’s defence capabilities.\nThe School of Defence Technology offers a unique blend of theoretical knowledge and hands-on training, guided by experienced faculty and industry experts. With specializations in Aerospace Technology, Communication Systems & Sensors, AI & Cyber Security, and Directed Energy Technology, students gain exposure to cutting- edge technologies that are shaping the future of defence and strategic sectors worldwide.\nWe take pride in fostering a culture of innovation, critical thinking, and discipline—qualities that define the defence ecosystem. Our collaborations with key industry players and R&D institutions ensure that students are industry-ready from day one.\nAs we prepare the next generation of technologists and defence strategists, I invite aspiring students to become a part of this mission-driven academic journey. At Galgotias, you won’t just earn a degree—you will build a future that serves the nation.\n"
    },
    "financial_aid": {
      "summary": "This document title, \"Financial Aid & Loan Facilities,\" indicates content related to assistance programs and borrowing options, likely in an educational or financial context.",
      "raw_content": "Financial Aid & Loan Facilities"
    },
    "admission_process": {
      "summary": "This text appears to be a list of various services and information categories related to an academic institution, likely a university or college. It includes terms such as admission documents, undertaking approvals, accreditations, transportation services, Ph.D. admissions, refund policy, brochure downloads, and an admission helpline, suggesting a comprehensive overview of the student experience and administrative processes.",
      "raw_content": "Admission Documents & Undertaking Approvals & Accreditations Transportation Services Ph.D Admission Refund Policy Download Brochure Admission Helpline"
    },
    "events_initiatives": {
      "summary": "The provided text indicates a reference to \"SIH\" for the years 2023 and 2024.",
      "raw_content": "SIH -2023 and 2024"
    }
  }
}