{
  "source_file": "www.galgotiasuniversity.edu.in_India_s_Top_Private_University_in_Noida_Uttar_Pradesh_-_Apply_Now__raw_2025-08-10-18-45-13.txt",
  "structured_data": {
    "general_info": {
      "summary": "This document outlines the diverse offerings and aspects of Galgotias University, covering its international student programs, campus life, academic structure including various schools and programs, admission procedures, research initiatives, placements, and recent news or events. It highlights the university's commitment to academic excellence, research, innovation, and student development, aiming to prepare students for global success through comprehensive facilities and opportunities.",
      "raw_content": "• India Today Media Institute\n• International Admissions About International Office Clubs for International Students International student programs Foundation and Bridge Courses for International Students Message from Director International Relations Programmes and Fees Scholarships Eligibility Admission Process Preparatory English Foundation Program Pre & Post Arrival Information for International Students International Students Grievances Wing Visa and FRRO Support International Apply Now Contact Us FAQs Download Brochure Testimonials Events Study in India\n• Clubs for International Students\n• Foundation and Bridge Courses for International Students\n• Message from Director International Relations\n• Programmes and Fees\n• Scholarships\n• Preparatory English Foundation Program\n• Pre & Post Arrival Information for International Students\n• International Students Grievances Wing\n• Visa and FRRO Support\n• Login Employee Login Student Login LMS Login\n• Campus Life About the Campus Student Organization Societies & Clubs Hostel Library Transportation Services National Cadet Corps (NCC) National Service Scheme (NSS) Sports & Recreation Cafeteria Healthcare Facilities Unifest Events, Arts & Culture Resources & Facilities Convocation Smart India Hackathon 2022 Toycathon Launchpad\n• National Cadet Corps (NCC)\n• National Service Scheme (NSS)\n• Events, Arts & Culture\n• Smart India Hackathon 2022\n• Online Complaints Prevention of caste based discrimination at workplace committee Students Online portal for Redressal of Grievances Employee Online portal for Redressal of Grievances Anti-ragging Policy Complaint Committee for Prevention of Sexual Harassment\n• Prevention of caste based discrimination at workplace committee\n• Students Online portal for Redressal of Grievances\n• Employee Online portal for Redressal of Grievances\n• Complaint Committee for Prevention of Sexual Harassment\n• About GU About Us Galgotias University Our Legacy The Galgotias Story Leadership Governance International Academic Team Awards, Rankings & Certifications Accreditations Mandatory Disclosures Policies & Regulations Partnerships & Collaborations iOS Development Center Virtual tour\n• Galgotias University\n• Leadership\n• Awards, Rankings & Certifications\n• Partnerships & Collaborations\n• Schools School of Defence Technology School of Computer Science & Engineering School of Artificial Intelligence School of Aviation, Logistics & Tourism Management School of Computer Applications & Technology School of Engineering School of Business School of Law View More\n• School of Defence Technology\nSchool of Defence Technology\n• School of Computer Science & Engineering\nSchool of Computer Science & Engineering\n• School of Artificial Intelligence\nSchool of Artificial Intelligence\n• School of Aviation, Logistics & Tourism Management\nSchool of Aviation, Logistics & Tourism Management\n• School of Computer Applications & Technology\nSchool of Computer Applications & Technology\n• Programs Under Graduate Programs Diploma Programs Post Graduate Programs Doctoral Programs Certificate Programs Programs for working professionals Online Courses\n• Programs for working professionals\nPrograms for working professionals\n• Online Courses\nOnline Courses\n• Admissions Apply Now Admission Procedure Fee Structure & Eligibility Scholarships Hostel Lateral Entry/Migration Admission Financial Aid & Loan Facilities Admission Documents & Undertaking Approvals & Accreditations Transportation Services Ph.D Admission Refund Policy Download Brochure Admission Helpline\n• Fee Structure & Eligibility\n• Financial Aid & Loan Facilities\n• Admission Documents & Undertaking\n• Research Message from Dean (Research) Research Excellence and Global Engagement Research & Development Cell Galgotias Centre for Interdisciplinary Research Policies & Mandates Research Advisory Committee Publications Patents Consultancy Sponsored Projects Seed Money Faculty wise Summary Research Ethics Application Department wise Publication Summary Research Group Organized Events International & National Events International FDPs Research Awards Scopus Citation WoS Citation Newsletter Session with Noble Laureates DSIR - SIRO Recognition Centres of Excellence Media Outreach Research Group Diversity Open House Project for Students Honorary Professors Best Practices G-MRDC Centre of Excellence for Semiconductor Research\n• Message from Dean (Research) \n• Research Excellence and Global Engagement\n• Research & Development Cell\n• Galgotias Centre for Interdisciplinary Research\n• Department wise Publication Summary\n• Research Group Organized Events\n• International & National Events\n• Session with Noble Laureates\n• DSIR - SIRO Recognition\n• Research Group Diversity\n• Open House Project for Students\n• Honorary Professors\n• Centre of Excellence for Semiconductor Research\n• Academics Academics Academic Calendar Learning Model & Choice Based Credit System MOUs Curriculum Design and Development Examination Cell NEP-2020 Download Forms Awards Holiday List Achievements\n• Learning Model & Choice Based Credit System\n• Curriculum Design and Development\n• NEP-2020\n• Placements Latest Placements Career Planning and Development Division (CPDD) Associated Recruiters Corporate Tie Ups Placement Records Employability Enhancement Program Placement Policy Placement Brochure Recruiters Speak Students Speak Highest Performers Placement Gallery\n• Career Planning and Development Division (CPDD)\n• Associated Recruiters\n• Recruiters Speak\n• Highest Performers\nEnquire Now\n• Result Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 08.08.2025 Aug 08, 2025\nResult Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 08.08.2025\n• Result Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 07.08.2025 Aug 08, 2025\nResult Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 07.08.2025\n• Result Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 06.08.2025 Aug 07, 2025\nResult Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 06.08.2025\n• Result Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 05.08.2025 (a) Aug 06, 2025\nResult Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 05.08.2025 (a)\n• Result Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 05.08.2025 Aug 06, 2025\nResult Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 05.08.2025\n• Result Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 04.08.2025 Aug 04, 2025\nResult Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 04.08.2025\n• Result Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 01.08.2025 Aug 04, 2025\nResult Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 01.08.2025\n• Result Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 31.07.2025 Jul 31, 2025\nResult Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 31.07.2025\n• Result Notification of Semester End Examination of Regular Batches (Even Semester) - June 2025 dated 30.07.2025 Jul 30, 2025\nResult Notification of Semester End Examination of Regular Batches (Even Semester) - June 2025 dated 30.07.2025\n• Result Notification of Semester End Examination of Regular Batches (Even Semester) - June 2025 dated 29.07.2025 Jul 29, 2025\nResult Notification of Semester End Examination of Regular Batches (Even Semester) - June 2025 dated 29.07.2025\n• PhD Admission (Fall 2025–26): Final selection will be based on written test & interview. All candidates who appeared for the test are eligible for interview. Jul 23, 2025\nPhD Admission (Fall 2025–26): Final selection will be based on written test & interview. All candidates who appeared for the test are eligible for interview.\n• Notification for Procedure for allotment of Girls and Boys Hostel (2025) Jul 08, 2025\nNotification for Procedure for allotment of Girls and Boys Hostel (2025)\n• RE-MTE - Examinations Jun 03, 2025\n• Procedure for allotment of Girls Hostel May 30, 2025\nProcedure for allotment of Girls Hostel\n• Notification for RE-MTE May 15, 2025\n• Date sheet ETE PhD Core-Course work Courses May 09, 2025\nDate sheet ETE PhD Core-Course work Courses\n• Letter to Graduand - Revised scheduled on 7 May 2025 Apr 16, 2025\nLetter to Graduand - Revised scheduled on 7 May 2025\n• Convocation 2024: Letter to Graduand Mar 28, 2025\nConvocation 2024: Letter to Graduand\n• Notification for Commencement of classes and attendance in classes Mar 06, 2025\nNotification for Commencement of classes and attendance in classes\n• Academic Calendar for Winter session 2024-25 Feb 25, 2025\nAcademic Calendar for Winter session 2024-25\nJoin the ranks of the world's brightest minds at Galgotias University, a top-ranked institution renowned for academic excellence and impact.\nResearch that solves the World's Challenges\nJoin a legacy of transformative research and innovation that spans decades and continents, starting with your education at Galgotias University.\nGalgotias University students had an insightful session with Ian Bremmer at the India Today Conclave. Discover the global threats and opportunities from India's perspective.\nBiomedical Research and Healthcare Innovation\nTransforming healthcare with innovative research and education, preparing our students and faculty for success in this rapidly evolving field.\nArtificial Intelligence and Machine Learning\nLeading the way in AI research and development through partnerships with industry leaders, empowering our students and faculty to create the future of AI.\nUniversity with BEST Placements\nPreparing students for success in the global job market with hands-on experience, professional development, and top opportunities.\n1200+\n98%\nPlaced in top companies\n100+\n\"Welcome to Our World Embrace Your Future\"\nExplore our stunning campus, state-of-the-art facilities, and vibrant student life. Find out what makes our university a special place to learn and grow.\nStudent Council & Groups\nBe Part of a Vibrant Community: Our student council and groups offer opportunities to connect, learn, and grow outside of the classroom. Discover how you can get involved today.\nBuilding the Next Big Thing: With 100+ Start-ups, Our incubation center is one of the India’s largest where innovation and entrepreneurship thrive. Join us in creating the future of business, technology, and social impact.\nExplore the Future of Tech: Our tech laboratories offer state-of-the-art equipment and expert faculty to guide you in exploring the latest advancements in tech. Start your journey today.\nUnleash your potential with world-class sports facilities and diverse extracurricular programs at our leading university.\nEmbrace the Opportunities of Our Dynamic Sports and Extracurricular Scene\nTake your Game to the Next Level with our Top-Notch Sports Infrastructure\nOur students have made their mark in academics, research, sports, and entrepreneurship, contributing to a better world\nLaunch of ToyVista – A Revolutionary AR Toy Shopping App\nSakhi – Menstrual Companion App Launched on Apple App Store\nIgniting Creativity: Artistica App Launches on the App Store from Galgotias University's iOS Development Center\nReimagining Notes: Kipp Launches on the App Store from Galgotias University’s iOS Development Center\nCultivating formidable partnerships with Apex and Accreditation Bodies to empower students with cutting-edge opportunities in research, innovation, and experiential learning excellence\nUniversity Grants Commission\nAll India Council for Technical Education\nAssociation to Advance Collegiate Schools of Business\nStay Updated with the Buzzing News and Events of Galgotias University\nCareer Counselling and MoU Signing Ceremony with Sheoran International School\nSummer School on Scientific Innovations- Hands-on Training Pharmaceutical Tools, Cancer Biology, Modern Analytical Techniques, Drug Design & Scientific Writing\nExpert talk on Research in the Humanities & Religious studies\n• School of Finance and Commerce\n• School of Liberal Education\n• School of Medical and Allied Sciences\n• School of Nursing\n• School of Allied Health Sciences\n• School of Basic Sciences\n• School of Media & Communication Studies\n• School of Design\n• School of Biosciences and Technology\n• School of Vocational Education\n• School of Life Long Learning\n• Covid-19 Counselling Cell\n• Admission & Education Loan Assistance\n• ARIIA-2021\n• Tender & Vendor Registration\n• Viksit Bharat@2047: Voice of Youth\n• Internal Quality Assurance Cell (IQAC)\n• DPBH 2023\n• Galgotias University Vision 2030\n• Galgotias News Network (GNN)\n• Fees Payment\n• SIH -2023 and 2024\n• © 2025 Copyrights Galgotias. All rights reserved.\n• Designed, developed & maintained By : City Innovates\nSource: https://www.galgotiasuniversity.edu.in/"
    },
    "placements": {
      "summary": "The provided text outlines various aspects of a placement and career development division, highlighting key services such as career planning, recruiter associations, placement records, and an employability enhancement program. It also emphasizes achievements like \"University with BEST Placements,\" a 98% placement rate, over 1200 students placed in top companies, and over 100 associated recruiters.",
      "raw_content": "• Placements Latest Placements Career Planning and Development Division (CPDD) Associated Recruiters Corporate Tie Ups Placement Records Employability Enhancement Program Placement Policy Placement Brochure Recruiters Speak Students Speak Highest Performers Placement Gallery\n• Career Planning and Development Division (CPDD)\n• Associated Recruiters\n• Recruiters Speak\n• Highest Performers\n• University with BEST Placements\n• 1200+\n• 98%\n• Placed in top companies\n• 100+"
    },
    "research": {
      "summary": "This text outlines various research-related initiatives and activities, including messages from the Dean of Research, details about research cells and centers of excellence, publication summaries, organized events (both international and national), faculty development programs, recognition of research achievements, and specific areas of focus like Biomedical Research, Artificial Intelligence, and Semiconductor Research. It also highlights training programs and expert talks in diverse fields.",
      "raw_content": "• Research Message from Dean (Research) Research Excellence and Global Engagement Research & Development Cell Galgotias Centre for Interdisciplinary Research Policies & Mandates Research Advisory Committee Publications Patents Consultancy Sponsored Projects Seed Money Faculty wise Summary Research Ethics Application Department wise Publication Summary Research Group Organized Events International & National Events International FDPs Research Awards Scopus Citation WoS Citation Newsletter Session with Noble Laureates DSIR - SIRO Recognition Centres of Excellence Media Outreach Research Group Diversity Open House Project for Students Honorary Professors Best Practices G-MRDC Centre of Excellence for Semiconductor Research\n• Message from Dean (Research)\n• Research Excellence and Global Engagement\n• Research & Development Cell\n• Galgotias Centre for Interdisciplinary Research\n• Department wise Publication Summary\n• Research Group Organized Events\n• International & National Events\n• Session with Noble Laureates\n• DSIR - SIRO Recognition\n• Research Group Diversity\n• Open House Project for Students\n• Honorary Professors\n• Centre of Excellence for Semiconductor Research\n• Biomedical Research and Healthcare Innovation\n• Artificial Intelligence and Machine Learning\n• Summer School on Scientific Innovations- Hands-on Training Pharmaceutical Tools, Cancer Biology, Modern Analytical Techniques, Drug Design & Scientific Writing\n• Expert talk on Research in the Humanities & Religious studies"
    },
    "student_life": {
      "summary": "This text outlines various aspects of campus life, including student organizations, clubs, hostels, libraries, transportation, and national service initiatives like NCC and NSS. It highlights the university's commitment to fostering innovation and entrepreneurship through its incubation center, which supports over 100 startups, and its advanced tech laboratories. The university also emphasizes its world-class sports facilities and diverse extracurricular programs. Additionally, it announces the launch of several student-developed apps, such as ToyVista (an AR toy shopping app), Sakhi (a menstrual companion app), Artistica (an art app), and Kipp (a note-taking app), all developed at the university's iOS Development Center.",
      "raw_content": "• Campus Life About the Campus Student Organization Societies & Clubs Hostel Library Transportation Services National Cadet Corps (NCC) National Service Scheme (NSS) Sports & Recreation Cafeteria Healthcare Facilities Unifest Events, Arts & Culture Resources & Facilities Convocation Smart India Hackathon 2022 Toycathon Launchpad\n• National Cadet Corps (NCC)\n• National Service Scheme (NSS)\n• Events, Arts & Culture\n• Smart India Hackathon 2022\n• Toycathon Launchpad\n• Student Council & Groups\n• Building the Next Big Thing: With 100+ Start-ups, Our incubation center is one of the India’s largest where innovation and entrepreneurship thrive. Join us in creating the future of business, technology, and social impact.\n• Explore the Future of Tech: Our tech laboratories offer state-of-the-art equipment and expert faculty to guide you in exploring the latest advancements in tech. Start your journey today.\n• Unleash your potential with world-class sports facilities and diverse extracurricular programs at our leading university.\n• Embrace the Opportunities of Our Dynamic Sports and Extracurricular Scene\n• Take your Game to the Next Level with our Top-Notch Sports Infrastructure\n• Launch of ToyVista – A Revolutionary AR Toy Shopping App\n• Sakhi – Menstrual Companion App Launched on Apple App Store\n• Igniting Creativity: Artistica App Launches on the App Store from Galgotias University's iOS Development Center\n• Reimagining Notes: Kipp Launches on the App Store from Galgotias University’s iOS Development Center"
    },
    "academic_calendar": {
      "summary": "This document indicates the availability of the academic calendar for the Winter session of 2024-25.",
      "raw_content": "• Academic Calendar for Winter session 2024-25"
    },
    "results": {
      "summary": "This document contains a series of result notifications for the Semester End Examination of Regular Batches (Even Semester) held in June-July 2025. The notifications are dated from July 29, 2025, to August 8, 2025, with specific dates including July 31, August 1, August 4, August 5, August 6, August 7, and August 8.",
      "raw_content": "• Result Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 08.08.2025 Aug 08, 2025\nResult Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 08.08.2025\n• Result Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 07.08.2025 Aug 08, 2025\nResult Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 07.08.2025\n• Result Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 06.08.2025 Aug 07, 2025\nResult Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 06.08.2025\n• Result Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 05.08.2025 (a) Aug 06, 2025\nResult Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 05.08.2025 (a)\n• Result Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 05.08.2025 Aug 06, 2025\nResult Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 05.08.2025\n• Result Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 04.08.2025 Aug 04, 2025\nResult Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 04.08.2025\n• Result Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 01.08.2025 Aug 04, 2025\nResult Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 01.08.2025\n• Result Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 31.07.2025 Jul 31, 2025\nResult Notification of Semester End Examination of Regular Batches (Even Semester) - June - July 2025 dated 31.07.2025\n• Result Notification of Semester End Examination of Regular Batches (Even Semester) - June 2025 dated 30.07.2025 Jul 30, 2025\nResult Notification of Semester End Examination of Regular Batches (Even Semester) - June 2025 dated 30.07.2025\n• Result Notification of Semester End Examination of Regular Batches (Even Semester) - June 2025 dated 29.07.2025 Jul 29, 2025\nResult Notification of Semester End Examination of Regular Batches (Even Semester) - June 2025 dated 29.07.2025"
    },
    "examinations": {
      "summary": "This information provides two key dates related to RE-MTE (Revised-Medical Training Examination). The notification for the examination is scheduled for May 15, 2025, and the examinations themselves will take place on June 3, 2025.",
      "raw_content": "• RE-MTE - Examinations Jun 03, 2025\n• Notification for RE-MTE May 15, 2025"
    },
    "convocation": {
      "summary": "This document contains two entries related to graduation information. One entry is a \"Letter to Graduand - Revised\" scheduled for May 7, 2025, with a posting date of April 16, 2025. The second entry is \"Convocation 2024: Letter to Graduand\" posted on March 28, 2025.",
      "raw_content": "• Letter to Graduand - Revised scheduled on 7 May 2025 Apr 16, 2025\nLetter to Graduand - Revised scheduled on 7 May 2025\n• Convocation 2024: Letter to Graduand Mar 28, 2025\nConvocation 2024: Letter to Graduand"
    },
    "policies": {
      "summary": "This text outlines various policies and committees related to institutional governance and student welfare. It specifically mentions anti-ragging measures, a committee for preventing caste-based discrimination, and a committee to address sexual harassment, alongside broader policy and mandate categories.",
      "raw_content": "• Policies & Regulations\n• Anti-ragging Policy\n• Prevention of caste based discrimination at workplace committee\n• Complaint Committee for Prevention of Sexual Harassment\n• Policies & Mandates"
    },
    "accreditations": {
      "summary": "This document lists various approvals, accreditations, and official portals related to an educational institution. It includes recognition from the University Grants Commission and the All India Council for Technical Education, as well as accreditation by the Association to Advance Collegiate Schools of Business, and mentions of ARIIA-2021, a UGC Public Self Portal, a GU Vision Plan for 2030, and the Annual Report for 2022-23.",
      "raw_content": "• Approvals & Accreditations\n• University Grants Commission\n• All India Council for Technical Education\n• Association to Advance Collegiate Schools of Business\n• ARIIA-2021\n• UGC PUBLIC SELF PORTAL\n• GU Vision Plan_2030 21-01-2024\n• Annual Report-2022-23"
    },
    "events": {
      "summary": "This text highlights two key events at Galgotias University: staying informed about current news and events, and a career counseling and MoU signing ceremony with Sheoran International School.",
      "raw_content": "• Stay Updated with the Buzzing News and Events of Galgotias University\n• Career Counselling and MoU Signing Ceremony with Sheoran International School"
    },
    "schools": {
      "summary": "This text lists various schools within an institution, covering a broad range of disciplines including defense technology, computer science, artificial intelligence, aviation, business, law, finance, commerce, liberal education, medical sciences, nursing, allied health, basic sciences, media, design, biosciences, vocational education, and life-long learning.",
      "raw_content": "• Schools School of Defence Technology School of Computer Science & Engineering School of Artificial Intelligence School of Aviation, Logistics & Tourism Management School of Computer Applications & Technology School of Engineering School of Business School of Law View More\n• School of Finance and Commerce\n• School of Liberal Education\n• School of Medical and Allied Sciences\n• School of Nursing\n• School of Allied Health Sciences\n• School of Basic Sciences\n• School of Media & Communication Studies\n• School of Design\n• School of Biosciences and Technology\n• School of Vocational Education\n• School of Life Long Learning\n"
    },
    "financial_aid": {
      "summary": "The provided text lists two key services related to financial assistance for education: general financial aid and loan facilities, and specific admission and education loan assistance.",
      "raw_content": "• Financial Aid & Loan Facilities\n• Admission & Education Loan Assistance"
    },
    "downloads": {
      "summary": "The provided text lists two downloadable items: a brochure and forms. This indicates a section of a website or document offering resources for users to access.",
      "raw_content": "• Download Brochure\n• Download Forms"
    },
    "grievances": {
      "summary": "This text lists various committees, policies, and online portals established to address grievances and prevent discrimination or harassment. Key initiatives include preventing caste-based discrimination, facilitating student and employee grievance redressal through online portals, an anti-ragging policy, a committee for preventing sexual harassment, a Covid-19 Counselling Cell, and an Internal Quality Assurance Cell (IQAC).",
      "raw_content": "• Online Complaints Prevention of caste based discrimination at workplace committee Students Online portal for Redressal of Grievances Employee Online portal for Redressal of Grievances Anti-ragging Policy Complaint Committee for Prevention of Sexual Harassment\n• Prevention of caste based discrimination at workplace committee\n• Students Online portal for Redressal of Grievances\n• Employee Online portal for Redressal of Grievances\n• Complaint Committee for Prevention of Sexual Harassment\n• Covid-19 Counselling Cell\n• Internal Quality Assurance Cell (IQAC)"
    },
    "visa_support": {
      "summary": "This text snippet indicates that there is support available for visa and Foreigners Regional Registration Office (FRRO) related matters.",
      "raw_content": "• Visa and FRRO Support"
    },
    "awards": {
      "summary": "The provided text lists categories related to achievements, specifically mentioning \"Awards, Rankings & Certifications\" and \"Awards\" as distinct points, suggesting a focus on recognition and accolades.",
      "raw_content": "• Awards, Rankings & Certifications\n• Awards\n"
    },
    "partnerships": {
      "summary": "This document outlines key strategic initiatives focused on fostering partnerships and collaborations to enhance student opportunities. It highlights corporate tie-ups and the cultivation of strong relationships with apex and accreditation bodies to provide students with advanced research, innovation, and experiential learning experiences. Additionally, it mentions a career counseling event and an MoU signing ceremony with Sheoran International School.",
      "raw_content": "• Partnerships & Collaborations\n• Corporate Tie Ups\n• Cultivating formidable partnerships with Apex and Accreditation Bodies to empower students with cutting-edge opportunities in research, innovation, and experiential learning excellence\n• Career Counselling and MoU Signing Ceremony with Sheoran International School"
    },
    "legacy": {
      "summary": "This brief text introduces Galgotias University and refers to its legacy and story.",
      "raw_content": "• Galgotias University Our Legacy The Galgotias Story"
    },
    "other_services": {
      "summary": "The provided text is a bulleted list of various services, initiatives, events, and vision statements, including transportation services, tender and vendor registration, Viksit Bharat@2047: Voice of Youth, DPBH 2023, Galgotias University Vision 2030, Galgotias News Network (GNN), and Smart India Hackathon (SIH) for 2023 and 2024.",
      "raw_content": "• Transportation Services\n• Tender & Vendor Registration\n• Viksit Bharat@2047: Voice of Youth\n• DPBH 2023\n• Galgotias University Vision 2030\n• Galgotias News Network (GNN)\n• SIH -2023 and 2024"
    }
  }
}