{
  "source_file": "www.sharda.ac.in_BA_Political_Science_Honours_Syllabus_Subjects_Fees_Eligibility_raw_2025-08-10-18-29-20.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text appears to be a list of various sections, departments, initiatives, and official information related to an organization, likely a university given terms like \"University,\" \"Statutes,\" and \"Tenders.\" It covers academic resources like sample papers and skill enhancement programs, administrative functions such as recruiters and statutory bodies, and specific initiatives like COVID-19 information and entrepreneurship programs.",
      "raw_content": "SUAT 2025\nSample Papers\n• Sample Papers\nGlobal Knowledge Seekers\n• Global Knowledge Seekers\nOur Recruiters\n• Our Recruiters\nBanking And Postal Services\n• Banking And Postal Services\nPerspective Plan\nLeadership\nHistory\nStatutory Bodies of the University\nSharda Tenders\nAct, Statutes and Ordinances\nCOVID19\nFamily & Couple Counselling Services(FCCS)\nCapacity Development & Skill Enhancement\nLanguage and Communication Skill Initiatives: Sharda Skills\nSoft Skill Initiatives : Career Counseling and Development Center\nAwareness of Trends in Technology : IIC\nEntrepreneurship\nInnovation and Entrepreneurship"
    },
    "accommodation_info": {
      "summary": "This document outlines various guidelines and programs, specifically mentioning accommodation fees, visa and FRO/FRRO procedures, medical insurance requirements, and observership programs. These topics appear to be presented as a list of informational items.",
      "raw_content": "Accommodation Fee\nGuidelines for Visa and FRO/FRRO\nGuidelines for Medical Insurance\nObservership Programmes\n• Accommodation Fee\n• Guidelines for Visa and FRO/FRRO\n• Guidelines for Medical Insurance\n• Observership Programmes"
    },
    "mentoring_portal": {
      "summary": "The provided text, \"Paramarsh- Our Mentoring Portal,\" appears to be a title or heading for a mentoring platform called \"Paramarsh.\"",
      "raw_content": "Paramarsh- Our Mentoring Portal\n• Paramarsh- Our Mentoring Portal"
    },
    "career_path": {
      "summary": "This text outlines career paths available to Political Science graduates, mentioning roles like College Student Leadership and Activities Officer and highlighting institutions such as TISS Xavier Institute of Social Sciences, encouraging individuals to pursue careers in humanities and social sciences.",
      "raw_content": "Career path you can choose after the course\n• College Student Leadership and Activities Officer\n• Political Science graduates can have many opportunities for careers in:\n• TISS Xavier Institute of Social Sciences\nTake the next step towards a career in humanities & social sciences."
    },
    "recruiters": {
      "summary": "The provided text is a single bullet point listing the term \"Recruiters.\"",
      "raw_content": "• Recruiters"
    },
    "covid_updates": {
      "summary": "This document appears to be a simple heading indicating an update related to Covid-19.",
      "raw_content": "• Covid 19 Updates"
    },
    "source": {
      "summary": "This text provides a direct link to the Bachelor of Arts in Political Science program page on the Sharda University website, indicating it is the source of information regarding this specific academic offering.",
      "raw_content": "Source: https://www.sharda.ac.in/programmes/ba-political-science"
    }
  }
}