{
  "source_file": "www.amity.edu_International_Adjunct_Faculty_-_Professor_Mohammad_Rokibul_Kabir_PhD_raw_2025-08-10-18-42-20.txt",
  "structured_data": {
    "general_info": {
      "summary": "Amity University Mumbai offers a comprehensive range of programs across various disciplines, including B.Tech, M.Tech, B.Des, M.Des, law, business, commerce, arts, science, education, journalism, and PhD. The university boasts highly qualified faculty, provides a supportive environment for international students, and offers scholarships to meritorious students. It also has a dedicated placement cell with a strong industry network and a modern, well-equipped campus with various amenities.  For admissions inquiries, the contact number is +91-9987386690.",
      "raw_content": "Amity University Mumbai\n• Campus Life\n• Academics\n• Admissions\n• Placement\n• Faculty\n• International Students\n• Scholarships\n• Alumni\n• Research\n• Infrastructure\n• Contact Us\n• FAQs\n• Careers\n• About Us\nHome\nAcademics\nProgrammes\nFaculty\nAdmissions\nCampus\nCampus Activities\nContact Us\nAdmissions\nAdmission Process\nEligibility Criteria\nApplication Form\nFee Structure\nScholarship\nEntrance Exam\nCareer at Amity University Mumbai\nTop Courses\nAmity University Mumbai offers a wide range of courses across various disciplines. Some of the top courses include:\nB.Tech\nM.Tech\nB.Des\nM.Des\nB.A.LL.B.(H)\nM.A.LL.B.(H)\nLL.M.\nBBA\nMBA\nB.Com (H)\nM.Com\nB.A.\nM.A.\nB.Sc\nM.Sc\nB.Ed\nM.Ed\nB.J.M.C.\nM.J.M.C.\nPhD\nAmity University Mumbai faculty comprise of highly qualified and experienced professionals who are leaders in their respective fields. The faculty is committed to providing students with a world-class education and a stimulating learning environment.\nInternational Students\nAmity University Mumbai welcomes students from all over the world. The university offers a supportive and inclusive environment for international students, with a dedicated international student office to assist them with their academic and personal needs.\nScholarships\nAmity University Mumbai offers a variety of scholarships to meritorious students based on their academic performance and other criteria. These scholarships aim to make quality education accessible to a wider section of students.\nPlacement\nAmity University Mumbai has a dedicated placement cell that works closely with students and industry partners to ensure high placement rates. The university has a strong network of recruiters and a track record of successful placements in leading companies.\nCampus\nThe Amity University Mumbai campus is a modern and well-equipped facility, offering a conducive environment for learning and personal growth. It features state-of-the-art classrooms, libraries, laboratories, hostels, sports facilities, and other amenities.\nFor Admissions Contact:\n+91-9987386690"
    }
  }
}