{
  "source_file": "www.sharda.ac.in_MD_Biochemistry-_Admission_Eligibility_Fees_Syllabus_raw_2025-08-10-18-29-15.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text appears to be a list of various sections or topics related to a university or educational institution, likely Sharda University, based on the mention of \"Sharda Tenders.\" The topics range from academic resources like sample papers and global knowledge seekers to administrative and historical aspects such as leadership, history, statutory bodies, and tenders. It also touches upon current affairs (COVID19), student services (counselling, capacity development), and initiatives focused on skills, communication, entrepreneurship, and technological trends.",
      "raw_content": "SUAT 2025\nSample Papers\n• Sample Papers\nGlobal Knowledge Seekers\n• Global Knowledge Seekers\nOur Recruiters\n• Our Recruiters\nBanking And Postal Services\n• Banking And Postal Services\nPerspective Plan\nLeadership\nHistory\nStatutory Bodies of the University\nSharda Tenders\nAct, Statutes and Ordinances\nCOVID19\nFamily & Couple Counselling Services(FCCS)\nCapacity Development & Skill Enhancement\nLanguage and Communication Skill Initiatives: Sharda Skills\nSoft Skill Initiatives : Career Counseling and Development Center\nAwareness of Trends in Technology : IIC\nEntrepreneurship\nInnovation and Entrepreneurship"
    },
    "career_path": {
      "summary": "This text outlines potential career paths following a course, including Customer Lab Service Associate, which is presented as a step towards a medical career, and Recruiters.",
      "raw_content": "Career path you can choose after the course\n• Customer Lab Service Associate\nTake the next step towards a career in medical.\n• Recruiters\n"
    },
    "source": {
      "summary": "This content appears to be a URL pointing to the Master of Science (M.D.) in Biochemistry program page on the Sharda University website.",
      "raw_content": "Source: https://www.sharda.ac.in/programmes/md-biochemistry"
    }
  }
}