{
  "source_file": "www.sharda.ac.in_MA_Master_of_Arts_in_Geography_College_Fees_Eligibility_Syllabus_raw_2025-08-10-18-29-13.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text appears to be a list of categories or topics, possibly from a website navigation menu or a document index. The categories cover areas like \"Global Knowledge Seekers,\" \"Our Recruiters,\" \"Banking And Postal Services,\" \"Guidelines for Visa and FRO/FRRO,\" \"Guidelines for Medical Insurance,\" and \"Observership Programmes.\"",
      "raw_content": "Global Knowledge Seekers\n• Global Knowledge Seekers\nOur Recruiters\n• Our Recruiters\nBanking And Postal Services\n• Banking And Postal Services\nGuidelines for Visa and FRO/FRRO\n• Guidelines for Visa and FRO/FRRO\nGuidelines for Medical Insurance\n• Guidelines for Medical Insurance\nObservership Programmes\n• Observership Programmes"
    },
    "career_path": {
      "summary": "This text outlines the diverse career paths available to students after completing a geography-related course. Graduates can pursue roles in government and non-government organizations (both national and international) as regional planners, demographers, disaster managers, GIS experts, and cultural/social geographers. The course also prepares students for academia and provides them with essential research tools like GIS and statistical software (EXCEL, SPSS, STATA). Key areas of employment include earth sciences, environment, disaster management, weather science, data analysis for census operations and socio-economic studies, demography, geo-political analysis, urban and regional planning, and the tourism industry.",
      "raw_content": "Career path you can choose after the course\nGovernment and Non-government (National and International) in the specific area as Regional Planner, Demographer/population scientist, disaster manager, GIS expert (interdisciplinary applications) and other sub-disciplines of geography as cultural/ social geographer etc. They also can be placed in academics and higher education.\nTake the next step towards a career in humanities & social sciences.\n• Recruiters\nStudents who are looking for...\nA high leverage industry as geography is a holistic subjects.\n• Students can enter earth sciences, environment, disaster management, weather science expert.\n• make a student ready to utilise research tools which are intrinsic for better analysis and problem solving such as Geographic information system (GIS), data management (EXCELL to, SPSS, STATA etc).\n• The discipline also makes you expert in data handling and temporal analysis for understanding and problem solving and hence one can find organisations working specially in data like census operations to organisations which are working in the social- economic aspects too.\n• Demography/population studies give ample opportunity to get coveted placement in national and international organisations.\n• Students who have flair of understanding of geo-political facets and therefore placement in organisations working on international relations strategic analysis.\n• Town planner, regional planners are the some of the fetching vocations for geography students. A background in urban geography can prepare one for a career in such fields as urban and transportation planning, site selection in business development and real estate development\n• Also in tourism industry."
    }
  }
}