{
  "source_file": "www.galgotiasuniversity.edu.in_School_of_Defence_Technology_raw_2025-08-10-18-45-11.txt",
  "structured_data": {
    "general_info": {
      "summary": "This content provides a comprehensive overview of Galgotias University, detailing its offerings for international students, campus life, academic schools and programs, and administrative functions. It highlights various aspects such as admissions, student support services, grievance redressal, leadership, partnerships, and digital initiatives, alongside copyright information and a source link.",
      "raw_content": "• India Today Media Institute\n• International Admissions About International Office Clubs for International Students International student programs Foundation and Bridge Courses for International Students Message from Director International Relations Programmes and Fees Scholarships Eligibility Admission Process Preparatory English Foundation Program Pre & Post Arrival Information for International Students International Students Grievances Wing Visa and FRRO Support International Apply Now Contact Us FAQs Download Brochure Testimonials Events Study in India\n• Clubs for International Students\n• Foundation and Bridge Courses for International Students\n• Message from Director International Relations\n• Programmes and Fees\n• Scholarships\n• Preparatory English Foundation Program\n• Pre & Post Arrival Information for International Students\n• International Students Grievances Wing\n• Visa and FRRO Support\n• Login Employee Login Student Login LMS Login\n• Campus Life About the Campus Student Organization Societies & Clubs Hostel Library Transportation Services National Cadet Corps (NCC) National Service Scheme (NSS) Sports & Recreation Cafeteria Healthcare Facilities Unifest Events, Arts & Culture Resources & Facilities Convocation Smart India Hackathon 2022 Toycathon Launchpad\n• National Cadet Corps (NCC)\n• National Service Scheme (NSS)\n• Events, Arts & Culture\n• Smart India Hackathon 2022\n• Online Complaints Prevention of caste based discrimination at workplace committee Students Online portal for Redressal of Grievances Employee Online portal for Redressal of Grievances Anti-ragging Policy Complaint Committee for Prevention of Sexual Harassment\n• Prevention of caste based discrimination at workplace committee\n• Students Online portal for Redressal of Grievances\n• Employee Online portal for Redressal of Grievances\n• Complaint Committee for Prevention of Sexual Harassment\n• About GU About Us Galgotias University Our Legacy The Galgotias Story Leadership Governance International Academic Team Awards, Rankings & Certifications Accreditations Mandatory Disclosures Policies & Regulations Partnerships & Collaborations iOS Development Center Virtual tour\n• Galgotias University\n• Leadership\n• Awards, Rankings & Certifications\n• Partnerships & Collaborations\n• Schools School of Defence Technology School of Computer Science & Engineering School of Artificial Intelligence School of Aviation, Logistics & Tourism Management School of Computer Applications & Technology School of Engineering School of Business School of Law View More\n• School of Defence Technology\nSchool of Defence Technology\n• School of Computer Science & Engineering\nSchool of Computer Science & Engineering\n• School of Artificial Intelligence\nSchool of Artificial Intelligence\n• School of Aviation, Logistics & Tourism Management\nSchool of Aviation, Logistics & Tourism Management\n• School of Computer Applications & Technology\nSchool of Computer Applications & Technology\n• Programs Under Graduate Programs Diploma Programs Post Graduate Programs Doctoral Programs Certificate Programs Programs for working professionals Online Courses\n• Programs for working professionals\nPrograms for working professionals\n• Online Courses\nOnline Courses\n• Admission & Education Loan Assistance\n• ARIIA-2021\n• Tender & Vendor Registration\n• Viksit Bharat@2047: Voice of Youth\n• Internal Quality Assurance Cell (IQAC)\n• DPBH 2023\n• Galgotias University Vision 2030\n• Galgotias News Network (GNN)\n• SIH -2023 and 2024\n• GU Vision Plan_2030 21-01-2024\n• Annual Report-2022-23\n• Chat with an Ambassadors\n• © 2025 Copyrights Galgotias. All rights reserved.\n• Designed, developed & maintained By : City Innovates\nSource: https://www.galgotiasuniversity.edu.in/p/school-of-defence-technology"
    },
    "research": {
      "summary": "This document outlines various aspects of research activities and achievements, likely from an academic institution. It lists key initiatives and departments such as the Research & Development Cell, Galgotias Centre for Interdisciplinary Research, and highlights achievements like publication summaries, organized events (international and national), sessions with Nobel Laureates, research group diversity, and recognition like DSIR - SIRO. It also mentions a Research Message from the Dean, emphasizing research excellence and global engagement, and includes points like research ethics, media outreach, and best practices.",
      "raw_content": "• Research Message from Dean (Research)\nResearch Excellence and Global Engagement\nResearch & Development Cell\nGalgotias Centre for Interdisciplinary Research\nResearch Ethics Application Department wise Publication Summary Research Group Organized Events International & National Events International FDPs Research Awards Scopus Citation WoS Citation Newsletter Session with Noble Laureates DSIR - SIRO Recognition Centres of Excellence Media Outreach Research Group Diversity Open House Project for Students Honorary Professors Best Practices G-MRDC Centre of Excellence for Semiconductor Research\n• Message from Dean (Research)\n• Research Excellence and Global Engagement\n• Research & Development Cell\n• Galgotias Centre for Interdisciplinary Research\n• Department wise Publication Summary\n• Research Group Organized Events\n• International & National Events\n• Session with Noble Laureates\n• DSIR - SIRO Recognition\n• Research Group Diversity\n• Open House Project for Students\n• Honorary Professors\n• Centre of Excellence for Semiconductor Research"
    },
    "academics": {
      "summary": "The provided text outlines various academic-related sections and initiatives, including the Academic Calendar, Learning Model & Choice Based Credit System, MOUs, Curriculum Design and Development, Examination Cell, NEP-2020, forms for download, holiday lists, awards, and achievements.",
      "raw_content": "• Academics Academics Academic Calendar Learning Model & Choice Based Credit System MOUs Curriculum Design and Development Examination Cell NEP-2020 Download Forms Awards Holiday List Achievements\n• Learning Model & Choice Based Credit System\n• Curriculum Design and Development\n• NEP-2020"
    },
    "placements": {
      "summary": "This text outlines various aspects of a career planning and placement division, including latest placements, career planning and development, associated recruiters, recruiter testimonials, top performers, and related policies and brochures. It emphasizes employability enhancement and provides sections for student and recruiter feedback.",
      "raw_content": "• Placements Latest Placements Career Planning and Development Division (CPDD) Associated Recruiters Corporate Tie Ups Placement Records Employability Enhancement Program Placement Policy Placement Brochure Recruiters Speak Students Speak Highest Performers Placement Gallery\n• Career Planning and Development Division (CPDD)\n• Associated Recruiters\n• Recruiters Speak\n• Highest Performers"
    },
    "accreditations": {
      "summary": "This document outlines the various apex and accreditation bodies with which the Department of Defence Technology cultivates partnerships to provide students with advanced opportunities in research, innovation, and experiential learning. It lists several key organizations including the National Council for Teacher Education, Pharmacy Council of India, UGC, AICTE, and professional bodies like the Indian Association of Physiotherapists and the Bar Council of India, also noting Galgotias University's NAAC A+ accreditation and NBA accreditations for several programs.",
      "raw_content": "Department of Defence Technology\nApex and Accreditation Bodies\nCultivating formidable partnerships with Apex and Accreditation Bodies to empower students with cutting-edge opportunities in research, innovation, and experiential learning excellence\nNational Council for Teacher Education.\nPharmacy Council of India\nThe Indian Association of Physiotherapists\nAssociation of Indian Universities\nGalgotias University accredited by NAAC with the A+\nPrograms are accredited by NBA (CSE, ECE, ME, MBA and B.Pharm)\nAssociation to Advance Collegiate Schools of Business\nUniversity Grants Commission\nAll India Council for Technical Education\nThe Bar Council of India\nIndian Nursing Council\nUGC PUBLIC SELF PORTAL"
    },
    "student_life": {
      "summary": "The university encourages student engagement through its vibrant student council and diverse groups, fosters innovation and entrepreneurship with one of India's largest incubation centers supporting over 100 startups, and provides state-of-the-art tech laboratories for exploring future advancements. Additionally, students can unleash their potential through world-class sports facilities and a wide range of extracurricular programs.",
      "raw_content": "Student Council & Groups\nBe Part of a Vibrant Community: Our student council and groups offer opportunities to connect, learn, and grow outside of the classroom. Discover how you can get involved today.\nBuilding the Next Big Thing: With 100+ Start-ups, Our incubation center is one of the India’s largest where innovation and entrepreneurship thrive. Join us in creating the future of business, technology, and social impact.\nExplore the Future of Tech: Our tech laboratories offer state-of-the-art equipment and expert faculty to guide you in exploring the latest advancements in tech. Start your journey today.\nUnleash your potential with world-class sports facilities and diverse extracurricular programs at our leading university.\nEmbrace the Opportunities of Our Dynamic Sports and Extracurricular Scene\nTake your Game to the Next Level with our Top-Notch Sports Infrastructure"
    },
    "schools": {
      "summary": "This document lists various schools and departments within an educational institution, including the School of Finance and Commerce, School of Liberal Education, School of Medical and Allied Sciences, School of Nursing, School of Allied Health Sciences, School of Basic Sciences, School of Media & Communication Studies, School of Design, School of Biosciences and Technology, School of Vocational Education, School of Life Long Learning, and a Covid-19 Counselling Cell.",
      "raw_content": "• School of Finance and Commerce\n• School of Liberal Education\n• School of Medical and Allied Sciences\n• School of Nursing\n• School of Allied Health Sciences\n• School of Basic Sciences\n• School of Media & Communication Studies\n• School of Design\n• School of Biosciences and Technology\n• School of Vocational Education\n• School of Life Long Learning\n• Covid-19 Counselling Cell"
    }
  }
}