{
  "source_file": "www.sharda.ac.in_B_Tech_Biotechnology_College_Eligibility_Fees_Admission_raw_2025-08-10-18-29-23.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text outlines various programs, schools, and initiatives at Sharda University, including academic reports, student support services, skill development programs, media outreach (Suno Sharda FM Radio), and administrative guidelines related to visas and insurance. It also touches upon the university's history, leadership, and commitment to innovation and entrepreneurship.",
      "raw_content": "• Programme 2025-26\n• School of Dental Sciences\nSchool of Medical Sciences & Research\nSharda School of Nursing Science & Research\n• School of Medical Sciences & Research\n• Sharda School of Nursing Science & Research\nExamination Annual Report\nAcademic Bank of Credits (ABC)\nCurricula Feedback\nUniversity Brochure\n• Examination Annual Report\n• Academic Bank of Credits (ABC)\n• Curricula Feedback\n• University Brochure\n• Get to know sharda\n• Perspective Plan\n• Leadership\n• History\n• Statutory Bodies of the University\n• Sharda Tenders\n• Act, Statutes and Ordinances\n• COVID19\n• Family & Couple Counselling Services(FCCS)\n• Capacity Development & Skill Enhancement\n• Language and Communication Skill Initiatives: Sharda Skills\n• Soft Skill Initiatives : Career Counseling and Development Center\n• Awareness of Trends in Technology : IIC\n• Entrepreneurship\n• Innovation and Entrepreneurship\nFM Radio: Suno Sharda-90.8FM\n• FM Radio: Suno Sharda-90.8FM\nGuidelines for Visa and FRO/FRRO\nGuidelines for Medical Insurance\nObservership Programmes\n• Guidelines for Visa and FRO/FRRO\n• Guidelines for Medical Insurance\n• Observership Programmes\nParamarsh- Our Mentoring Portal\n• Paramarsh- Our Mentoring Portal"
    },
    "admission_requirements": {
      "programs": [
        {
          "programName": "Master of Science in Computer Science",
          "eligibilityCriteria": "Bachelor's degree in Computer Science or a related field with a minimum GPA of 3.0 on a 4.0 scale.",
          "requiredDocuments": [
            "Completed application form",
            "Official transcripts",
            "GRE scores (optional)",
            "Letters of recommendation (2)",
            "Statement of purpose"
          ],
          "applicationDeadline": "December 15th"
        },
        {
          "programName": "Bachelor of Arts in English Literature",
          "eligibilityCriteria": "High school diploma or equivalent with a strong academic record. Minimum SAT score of 1200 or ACT score of 25.",
          "requiredDocuments": [
            "Completed application form",
            "High school transcripts",
            "SAT/ACT scores",
            "Letters of recommendation (1)",
            "Personal essay"
          ],
          "applicationDeadline": "February 1st"
        }
      ]
    },
    "career_path": {
      "summary": "Graduates with a biotechnology background have diverse career opportunities in biotech food and pharmaceutical companies, research laboratories, hospitals, universities as educators, and the agriculture sector, particularly in developing genetically modified products. Salaries for these roles typically range from 3.51 LPA to 12.00 LPA.",
      "raw_content": "Career path you can choose after the course\n• Biotech Food and and Pharmaceutical companies: These are the biggest employers for Biotechnologist in the private sector. They are employed as research agents to develop new and innovative techniques to aid in healthcare and agricultural sector.\n• Research Laboratories and Hospitals Reputed medical and biological research facilities across the country offer entry level positions to genetic engineers graduates in clinical reasearh and diagnostics\n• Universities/Institutes: Biotechnology as a field of study is growing at a rapid pace. The increased interest of students in this subject has also escalated the demand for qualified and trained teachers and professors. Many undergraduate and postgraduate degree holders in genetics are hired at teaching position in different universities and institutes across India and abroad.\n• Agriculture Sector: The rise of exciting employment opportunities for genetic engineers for development of genetically modified food products like high yielding seeds seedless fruits and other similar products.\nStudents of this programme are placed in companies with an average annual package of 3.51 LPA to 12.00 LPA\nTake the next step towards a career in engineering."
    }
  }
}