{
  "source_file": "www.sharda.ac.in_Integrated_Law_Program_in_Greater_Noida_Sharda_University_raw_2025-08-10-18-29-11.txt",
  "structured_data": {
    "general_info": {
      "summary": "This document outlines various programs and initiatives at Sharda University, covering academic departments like Dental Sciences, Medical Sciences, and Nursing, as well as administrative and developmental aspects. It highlights opportunities for skill enhancement, career development, and cultural exchange, with specific mentions of the School of Law and its LLM and B.A. LLB programs. The text also includes personal testimonials praising the university's faculty, opportunities, and multicultural environment, alongside administrative details such as examination reports, tenders, and university branches.",
      "raw_content": "• Programme 2025-26\n• School of Dental Sciences\nSchool of Medical Sciences & Research\nSharda School of Nursing Science & Research\n• School of Medical Sciences & Research\n• Sharda School of Nursing Science & Research\nExamination Annual Report\nAcademic Bank of Credits (ABC)\nCurricula Feedback\nUniversity Brochure\n• Examination Annual Report\n• Academic Bank of Credits (ABC)\n• Curricula Feedback\n• University Brochure\n• Get to know sharda\n• Perspective Plan\n• Leadership\n• History\n• Statutory Bodies of the University\n• Sharda Tenders\n• Act, Statutes and Ordinances\n• COVID19\n• Family & Couple Counselling Services(FCCS)\n• Capacity Development & Skill Enhancement\n• Language and Communication Skill Initiatives: Sharda Skills\n• Soft Skill Initiatives : Career Counseling and Development Center\n• Awareness of Trends in Technology : IIC\n• Entrepreneurship\n• Innovation and Entrepreneurship\nFM Radio: Suno Sharda-90.8FM\n• FM Radio: Suno Sharda-90.8FM\nParamarsh- Our Mentoring Portal\n• Paramarsh- Our Mentoring Portal\nSharda University is a great place of learning, culture, and life lessons. It is a great platform for skills enhancement and provides great exposure. Its facilities to students are great.There is a mix culture of students over here.It nourishes and nurter student and provide good placement opportunities\nLLM (International Law)\nSchool of law, Sharda University gives students the opportunity to not only learn law but also feel it by providing practical knowledge to the students.It gives us a chance to have insight into the process of law by various visits so that we know how things work at ground level.\nIn a nutshell, studying at Sharda University has been my knowledge and interesting experience so far. With such a cooperative and excellent faculty members and enthusiastic seniors studying law has become fun rather than boring.\nB.A LLB\nLaw does not simply study the laws. It is that to implement them and brought changes in the society. Here at Sharda University, I got soo many platforms and opportunities to get a successful career path and guidelines. All faculties, staff, and administration who guide us from time to time and co-operate with us are very good. Happy to be a part of this university. Proud to be sharda student\nLLM (Corporate)\n• Pradyumn Priyadarshi\nBeing part of School of Law, Sharda University with a tag of Shardian is something fascinating within itself. You are at the best location to be a law student and a lawyer of the future .Out of academic life we have number of legal event going on throughout the year. That is something that makes this place special.\nB.A L.L.B\nPradyumn Priyadarshi\nBeing part of SOL, Sharda University. I can state with affirming faith that faculties are well qualified and cooperative. Holistic development of every single entity is looked after that may be academic or extracurricular. We stand with a number of opportunities to show our talent every academic year.\nIts been almost 2 years in Sharda and I proudly say that every time that its just home away from home. Such abundance of opportunities and plethora of cultures gets my heart every time. Being a law student, Sharda has given me some of the best platforms to learn and make myself better not just as a lawyer but also as a human being all together. Sharda is all about an amalgamation of good vibes and even better opportunities.\nMy experience at Sharda's school of law has been quite enlightening. A multicultural environment gives the students an illuminating introspects in the classrooms itself. Also, the practical elements provided make the course an exciting venture, eliciting a broader insight into the field, especially with the frequent visits to places like District court, Supreme Court, National Commission, etc.\nI am proud to be part of dynamic campus in mentorship of highly experienced professors, where I can give wings to my imagination. I have experienced friendly and very vibrant environment in campus where I can learn as much I can and do as much I wish.\nRecruiters\n• Course Fee\n• Recruiters\n• Covid 19 Updates\n• Sharda University Uzbekistan\n• Sharda University Agra\n• Courses on Human Values and Professional ethics\n• National Cyber Crime Reporting Portal\n• International Credit Transfer Programme"
    },
    "other_services": {
      "summary": "This document outlines key information for previous year students, including details on fee structures, guidelines for visa and FRO/FRRO processes, medical insurance, and observership programs. The listed points are repeated for emphasis.",
      "raw_content": "Fee Structure for Previous Year Students\nGuidelines for Visa and FRO/FRRO\nGuidelines for Medical Insurance\nObservership Programmes\n• Fee Structure for Previous Year Students\n• Guidelines for Visa and FRO/FRRO\n• Guidelines for Medical Insurance\n• Observership Programmes"
    },
    "career_services": {
      "summary": "The provided text appears to be a header or title section, listing \"Global Knowledge Seekers\" and \"Our Recruiters\" as distinct categories or labels. It's a very brief snippet without further context.",
      "raw_content": "Global Knowledge Seekers\nOur Recruiters\n• Global Knowledge Seekers\n• Our Recruiters"
    },
    "university_infrastructure": {
      "summary": "This document briefly mentions \"Banking And Postal Services\" twice, indicating it's the primary topic or heading. It appears to be a very concise listing or title for a section related to these services.",
      "raw_content": "Banking And Postal Services\n• Banking And Postal Services"
    }
  }
}