{
  "source_file": "www.sharda.ac.in_BSc_IT_Information_Technology_Subjects_Syllabus_Fees_Eligibility_raw_2025-08-10-18-29-23.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text appears to be a list of program offerings, school affiliations, and administrative/developmental initiatives at Sharda University, including its School of Dental Sciences, School of Medical Sciences & Research, and Sharda School of Nursing Science & Research. It also highlights various academic and student support services such as an Academic Bank of Credits, curricula feedback, examination reports, career counseling, and entrepreneurship programs, along with the university's FM radio station, Suno Sharda-90.8FM. The source of this information is indicated as the Sharda University website, specifically the BSc IT program page.",
      "raw_content": "• Programme 2025-26\n• School of Dental Sciences\nSchool of Medical Sciences & Research\nSharda School of Nursing Science & Research\n• School of Medical Sciences & Research\n• Sharda School of Nursing Science & Research\nExamination Annual Report\nAcademic Bank of Credits (ABC)\nCurricula Feedback\nUniversity Brochure\n• Examination Annual Report\n• Academic Bank of Credits (ABC)\n• Curricula Feedback\n• University Brochure\n• Get to know sharda\n• Perspective Plan\n• Leadership\n• History\n• Statutory Bodies of the University\n• Sharda Tenders\n• Act, Statutes and Ordinances\n• COVID19\n• Family & Couple Counselling Services(FCCS)\n• Capacity Development & Skill Enhancement\n• Language and Communication Skill Initiatives: Sharda Skills\n• Soft Skill Initiatives : Career Counseling and Development Center\n• Awareness of Trends in Technology : IIC\n• Entrepreneurship\n• Innovation and Entrepreneurship\nFM Radio: Suno Sharda-90.8FM\n• FM Radio: Suno Sharda-90.8FM\nSource: https://www.sharda.ac.in/programmes/bsc-it"
    },
    "career_info": {
      "summary": "This course prepares students for engineering careers, with graduates typically securing positions that offer an average annual salary package between 3.51 LPA and 4.50 LPA.",
      "raw_content": "Career path you can choose after the course\nStudents of this programme are placed in companies with an average annual package of 3.51 LPA to 4.50 LPA\nTake the next step towards a career in engineering."
    },
    "university_links": {
      "summary": "This list outlines various topics and entities, including different groups of people (recruiters), updates on a specific health crisis (Covid 19 Updates), educational institutions in different locations (Sharda University Uzbekistan and Sharda University Agra), academic subjects (Courses on Human Values and Professional ethics), a government resource (National Cyber Crime Reporting Portal), and an academic program (International Credit Transfer Programme).",
      "raw_content": "• Recruiters\n• Covid 19 Updates\n• Sharda University Uzbekistan\n• Sharda University Agra\n• Courses on Human Values and Professional ethics\n• National Cyber Crime Reporting Portal\n• International Credit Transfer Programme"
    },
    "academic_resources": {
      "summary": "This document appears to be a very brief listing related to \"SUAT 2025\" and \"Sample Papers,\" suggesting it might be an index or a title list for resources concerning the SUAT 2025 examination, specifically mentioning sample papers.",
      "raw_content": "SUAT 2025\nSample Papers\n• SUAT 2025\n• Sample Papers"
    },
    "institutional_partners": {
      "summary": "This text appears to be a list of headings or categories, possibly from a document related to recruitment or knowledge sharing. The repeated phrase 'Global Knowledge Seekers' and 'Our Recruiters' suggests these are key sections or themes.",
      "raw_content": "Global Knowledge Seekers\n• Global Knowledge Seekers\nOur Recruiters\n• Our Recruiters"
    },
    "services": {
      "summary": "This document lists various services and guidelines, including Banking and Postal Services, Guidelines for Visa and FRO/FRRO, Guidelines for Medical Insurance, and Family & Couple Counselling Services (FCCS). Each item is presented with a main heading and a sub-heading that repeats the same information.",
      "raw_content": "Banking And Postal Services\n• Banking And Postal Services\nGuidelines for Visa and FRO/FRRO\n• Guidelines for Visa and FRO/FRRO\nGuidelines for Medical Insurance\n• Guidelines for Medical Insurance\nFamily & Couple Counselling Services(FCCS)\n• Family & Couple Counselling Services(FCCS)"
    },
    "programmes": {
      "summary": "The provided text lists two key programs: \"Observership Programmes\" and \"Paramarsh - Our Mentoring Portal\". Both are presented with a clear heading and a repeated, identical subheading.",
      "raw_content": "Observership Programmes\n• Observership Programmes\nParamarsh- Our Mentoring Portal\n• Paramarsh- Our Mentoring Portal"
    },
    "curricula_updates": {
      "summary": "The provided text lists academic years from 2018-19 to 2023-24, with a \"View Details\" link available for each year, presumably to access curricula information.",
      "raw_content": "S.No. | Academic year | Curricula Link\n1 | 2023-24 | View Details\n2 | 2021-22 | View Details\n3 | 2020-21 | View Details\n4 | 2019-20 | View Details\n5 | 2018-19 | View Details"
    }
  }
}