{
  "source_file": "www.mea.gov.in_Checklist_for_FRRO_Registration_Formalities_raw_2025-08-10-18-41-45.txt",
  "structured_data": {
    "general_info": {
      "summary": "This document outlines the registration formalities for foreigners in India, managed by the Ministry of External Affairs (MEA). It details the required documents for registration, including passport, visa, photographs, residence details, and specific reports or certificates based on visa type (e.g., HIV test, marriage certificate, academic bonafide). It also lists the contact information for Foreigners Registration Offices (FRROs) in major cities and explains the process of surrendering registration certificates. Exemptions from registration are provided for certain categories like US nationals with ten-year visas and foreigners of Indian origin. Additionally, the document clarifies rules regarding restricted areas, yellow fever vaccinations, and the use of disembarkation/embarkation forms. Finally, it provides contact information for website management and technical support.",
      "raw_content": "• About UsAbout UsPreviousAbout MEAProfilesOrganization StructureInternship with UsDisclosure of Gifts received in ToshakhanaImmovable Property Returns of IFS Officers\n• Disclosure of Gifts received in Toshakhana\n• Immovable Property Returns of IFS Officers\n• VisitsVisitsPreviousOutgoing VisitsOutgoing VisitsPreviousPresident VisitsVice President VisitsPrime Minister VisitsEAM VisitsVisit of All Party Delegations (OPERATION SINDOOR)sub linksIncoming VisitsVirtual Meetings\n• Visit of All Party Delegations (OPERATION SINDOOR)\n• Media CenterMedia CenterPreviousSpokesperson's OfficeSpokesperson's OfficePreviousPersonnelFacilitation of Foreign MediaMedia AccreditationDocumentary Filming in IndiaMEA Media Campaignssub linksSpeeches & StatementsPress ReleasesBilateral/Multilateral DocumentsResponse to Media QueriesMedia BriefingsPhoto GalleryVideo BriefingsMedia AdvisoryInterviewsParliament Q & AParliament Q & APreviousLok SabhaRajya Sabhasub linksIndian Treaties DatabasePublicationsPublicationsPreviousIndia in BusinessAnnual ReportsAnnual ReportsPreviousMEAOther Officessub linksOther PublicationsOIA PublicationsBharat Matterssub linksOther DocumentsOther DocumentsPreviousArchivesNAI Archivessub links\n• Personnel\n• Facilitation of Foreign Media\n• Documentary Filming in India\n• Response to Media Queries\n• Bharat Matters\n• Foreign PolicyForeign PolicyPreviousBilateral RelationsMultilateral RelationsMultilateral RelationsPreviousDevelopment PartnershipsVoice of Global South SummitIndia and the United NationsDisarmament and International Security AffairsIndian Treaties DatabaseISA Founding ConferenceIndia’s G20 Presidencysub linksBriefs on Foreign Relations\n• Development Partnerships\n• Voice of Global South Summit\n• India and the United Nations\n• Disarmament and International Security Affairs\n• India’s G20 Presidency\n• Briefs on Foreign Relations\n• Consular ServicesConsular ServicesPreviousConsular ServicesConsular ServicesPreviousGuide to Consular ServicesAttestation/ApostilleBachelorhood / Single Status CertificateNORIConsular AccessTransfer of Sentenced PersonsMutual Legal Assistance Treaty (MLAT)sub linksPassport ServicesVisa ServicesVisa ServicesPreviousOnline Indian VisaDiplomatic / Official VisaVerify Foreign Visa / Permit / CDCsVisa Facility for Indian Nationals (Ordinary Passports)Visa Exemption / Waiver AgreementsVisa Facilitation AgreementsVisa Services Provided By FRROsOutsourced CPV Servicessub linksDiaspora and migration issuesDiaspora and migration issuesPreviousDialogues & AgreementsDialogues & AgreementsPreviousMultilateral Co-operationModel ContractsNotificationSocial Security AgreementsLabour Mobility Partnership (LMPA)Memorandum of Understanding (MOUs)sub linksAutonomous BodiesAutonomous BodiesPreviousCentre for Migration, Mobility and Diaspora Studies, ICWAsub linksContactArchivesPopulation of Overseas Indianssub linksFAQs\n• Guide to Consular Services\n• Bachelorhood / Single Status Certificate\n• Transfer of Sentenced Persons\n• Mutual Legal Assistance Treaty (MLAT)\n• Diplomatic / Official Visa\n• Verify Foreign Visa / Permit / CDCs\n• Visa Facility for Indian Nationals (Ordinary Passports)\n• Visa Exemption / Waiver Agreements\n• Visa Services Provided By FRROs\n• Labour Mobility Partnership (LMPA)\n• Memorandum of Understanding (MOUs)\n• Centre for Migration, Mobility and Diaspora Studies, ICWA\n• Population of Overseas Indians\n• Public DiplomacyPublic DiplomacyPreviousDistinguished LecturesDocumentariesIndia PerspectivesBharat Ek Parichay\n• India Perspectives\n• Useful LinksUseful LinksPreviousOther MEA PortalsOther MEA PortalsPreviouseVisa HelpdeskPassport SevaMadad HelplineConference Clearance SystemPravasi Bharatiya DiwasProtocol DivisionITECIndia in BusinessHindi at United NationsICCRMEA Librarysub linksGOI websitesGOI websitesPreviousThe President of IndiaVice President of IndiaPrime Minister of IndiaIndian ParliamentPress Information BureauDirectory (State & UT)India Investment GridUtsav PortalPrime Minister's National Relief FundPublic GrievancesSurvey of Indiasub linksForeign PolicyForeign PolicyPreviousI2U2Mekong- Ganga CooperationIORAsub linksDocuments/ DownloadsDocuments/ DownloadsPreviousSubordinate legislation & rules, MEAEmergency No. Missions/Post24/7 Helpline In Gulf countries & MalaysiaBooklet: Making it easy to travelInformation regarding Apostille/AttestationNGOs and LAW firms to assist distressed NRIsGlossary (MEA)sub linksHelplineHelplinePreviousHelpline for Women in DistressSHE-Box Portalsub links\n• Hindi at United Nations\n• The President of India\n• Vice President of India\n• Prime Minister of India\n• Directory (State & UT)\n• Prime Minister's National Relief Fund\n• Subordinate legislation & rules, MEA\n• 24/7 Helpline In Gulf countries & Malaysia\n• Booklet: Making it easy to travel\n• NGOs and LAW firms to assist distressed NRIs\n• Helpline for Women in Distress\n• CareersCareersPreviousInternshipVacancies\n• Feedback\n• Skip to main content\nlet previousValue = $(\"#ContentPlaceHolder1_UserLanguageDropdown1_ddlLanguage\").val(); // Store initial value\n$(\"#ContentPlaceHolder1_UserLanguageDropdown1_ddlLanguage\").change(function (event) {\nvar newValue = $(this).val();\nif (confirm(\"You are about to proceed to translating language. Click YES to proceed.\")) {\n// Proceed with forwarding request\npreviousValue = newValue; // Update previous value\nvar selectedValue = $(this).val();\nif (selectedValue !== \"#\") {\n//var queryParams = window.location.search.substring(1).split(\"&\");\nvar queryParams = window.location.search.substring(1);\nvar queryParts = getCustomQueryParts();\nvar params = queryParams.split(\"&\");\nurl: '/LanguageChangeMethod.aspx/ChangeLang', // Actual ASPX page name\n//data: JSON.stringify({ languageValue: selectedValue, queryParams: queryParams }),\ndata: JSON.stringify({ selectedValue: selectedValue, queryStrings: queryParts }),\ncontentType: \"application/json; charset=utf-8\",\nsuccess: function (response) {\nerror: function (xhr, status, error) {\nconsole.error(\"Error changing language:\", error);\n// Revert to previous selection\nconst rawQuery = window.location.search.substring(1); // removes '?'\nreturn rawQuery ? rawQuery.split('/') : [];\njava script is required for this page\nMinistry of External Affairs Government of India\n• About UsAbout MEAProfilesOrganization StructureInternship with UsDisclosure of Gifts received in ToshakhanaImmovable Property Returns of IFS Officers\n• VisitsOutgoing VisitsPresident VisitsVice President VisitsPrime Minister VisitsEAM VisitsVisit of All Party Delegations (OPERATION SINDOOR)sub linksIncoming VisitsVirtual Meetings\n• Media CenterSpokesperson's OfficePersonnelFacilitation of Foreign MediaMedia AccreditationDocumentary Filming in IndiaMEA Media Campaignssub linksSpeeches & StatementsPress ReleasesBilateral/Multilateral DocumentsResponse to Media QueriesMedia BriefingsPhoto GalleryVideo BriefingsMedia AdvisoryInterviewsParliament Q & ALok SabhaRajya Sabhasub linksIndian Treaties DatabasePublicationsIndia in BusinessAnnual ReportsMEAOther Officessub linksOther PublicationsOIA PublicationsBharat Matterssub linksOther DocumentsArchivesNAI Archivessub links\n• Foreign PolicyBilateral RelationsMultilateral RelationsDevelopment PartnershipsVoice of Global South SummitIndia and the United NationsDisarmament and International Security AffairsIndian Treaties DatabaseISA Founding ConferenceIndia’s G20 Presidencysub linksBriefs on Foreign Relations\n• Consular ServicesConsular ServicesGuide to Consular ServicesAttestation/ApostilleBachelorhood / Single Status CertificateNORIConsular AccessTransfer of Sentenced PersonsMutual Legal Assistance Treaty (MLAT)sub linksPassport ServicesVisa ServicesOnline Indian VisaDiplomatic / Official VisaVerify Foreign Visa / Permit / CDCsVisa Facility for Indian Nationals (Ordinary Passports)Visa Exemption / Waiver AgreementsVisa Facilitation AgreementsVisa Services Provided By FRROsOutsourced CPV Servicessub linksDiaspora and migration issuesDialogues & AgreementsMultilateral Co-operationModel ContractsNotificationSocial Security AgreementsLabour Mobility Partnership (LMPA)Memorandum of Understanding (MOUs)sub linksAutonomous BodiesCentre for Migration, Mobility and Diaspora Studies, ICWAsub linksContactArchivesPopulation of Overseas Indianssub linksFAQs\n• Public DiplomacyDistinguished LecturesDocumentariesIndia PerspectivesBharat Ek Parichay\n• Useful LinksOther MEA PortalseVisa HelpdeskPassport SevaMadad HelplineConference Clearance SystemPravasi Bharatiya DiwasProtocol DivisionITECIndia in BusinessHindi at United NationsICCRMEA Librarysub linksGOI websitesThe President of IndiaVice President of IndiaPrime Minister of IndiaIndian ParliamentPress Information BureauDirectory (State & UT)India Investment GridUtsav PortalPrime Minister's National Relief FundPublic GrievancesSurvey of Indiasub linksForeign PolicyI2U2Mekong- Ganga CooperationIORAsub linksDocuments/ DownloadsSubordinate legislation & rules, MEAEmergency No. Missions/Post24/7 Helpline In Gulf countries & MalaysiaBooklet: Making it easy to travelInformation regarding Apostille/AttestationNGOs and LAW firms to assist distressed NRIsGlossary (MEA)sub linksHelplineHelpline for Women in DistressSHE-Box Portalsub links\n• CareersInternshipVacancies\nChecklist for FRRO Registration Formalities\n• About UsOfficers and Work DistributionOrganogram\n• Officers and Work Distribution\n• ConsularGuide to Consular ServicesMADADAttestationNORIConsular AccessBachelorhood/Single Status Certificate\n• VisaDiplomatic/Official VisaIndian Visa OnlineE-VisaVerify Foreign Visa/Permit/CDCsVisa Waiver AgreementsVisa Facilitation AgreementsVisa noteVisa facility for Indian Nationals\n• Visa facility for Indian Nationals\n• Visa Services by FRROs/FROsVisa Related Services Provided by FRROs/FROsChecklist for FRRO/FRO Registration Formalities\n• Visa Related Services Provided by FRROs/FROs\n• Checklist for FRRO/FRO Registration Formalities\n• Transfer of Sentenced PersonsList of countries with which India has an Agreement on transfer of sentenced persons.\n• List of countries with which India has an Agreement on transfer of sentenced persons.\n• PQs & RTIsLok SabhaRajya Sabha RTIs\n• Acts/Rules/CircularsMEA related Acts, Legislations & RulesMHA related Acts & rulesPassport related notifications\n• MEA related Acts, Legislations & Rules\n• MHA related Acts & rules\n• Travel Advisory during Covid-19\nChecklist for FRRO/FRO Registration Formalities\n• Registration is essential for all foreigners having visas for a period exceeding 6 months except the exempted categories and should be done within 14 days of first arrival at the nearest office of the Foreigners Registration Officer, list of documents that\nare required at the time of registration is given below: \nOriginal passport on which visa is endorsedPhotocopy of the passport and initial visaFour photographs of the applicant.Details of residence in IndiaHIV test report from one of the WHO recognized Institutions from people in the age group 15 to 60 years, if the foreigner is visiting India on a visa for more than one year.Copy of the marriage certificate in case of those seeking extension of stay on grounds of being spouse of an Indian national.Bonafide certificate from the University/College/Institution in case of student visa.Accreditation certificate from Press Information Bureau in case of journalist visa.Approval of the Department of Company Affairs in case of Board level appointments in Public Limited Companies.Copy of the approval from Government of India in case of a joint venture or collaboration (in duplicate)Copy of permission from the RBI in case of contract or agreement, in case of Employment visa.Undertaking from the concerned Indian company on the following lines in case of Employment/Business visas: \nFORMAT OF UNDERTAKING: \nWe take full responsibility for the activities and conduct of Mr/Mrs/Ms __________ national of _________ during his/her stay in India. If anything adverse comes to notice during this period, we undertake to repatriate him/her at our cost. Date/Seal __________\nSignature of competent authority. \n• Original passport on which visa is endorsed\n• Photocopy of the passport and initial visa\n• Four photographs of the applicant.\n• Details of residence in India\n• HIV test report from one of the WHO recognized Institutions from people in the age group 15 to 60 years, if the foreigner is visiting India on a visa for more than one year.\n• Copy of the marriage certificate in case of those seeking extension of stay on grounds of being spouse of an Indian national.\n• Bonafide certificate from the University/College/Institution in case of student visa.\n• Accreditation certificate from Press Information Bureau in case of journalist visa.\n• Approval of the Department of Company Affairs in case of Board level appointments in Public Limited Companies.\n• Copy of the approval from Government of India in case of a joint venture or collaboration (in duplicate)\n• Copy of permission from the RBI in case of contract or agreement, in case of Employment visa.\n• Undertaking from the concerned Indian company on the following lines in case of Employment/Business visas:\n• Addresses of Registration Offices: \nFRRO, Hans Bhavan, Bahadur Shah Zafar Marg, New Delhi. Tel: 0091-11-319 489FRRO, 237, AJC Bose Road, Calcutta, Tel: 0091-33-247 0549FRRO, Tata Press Building, 414, S.V. Marg, Mumbai. Tel: 0091-22-621 169CHIO, 26, Haddows Road, Chennai, Tel: 0091-44-827 7036At other places, The Superintendent of Police of the Districts are Foreigners Registration Officers\n• FRRO, Hans Bhavan, Bahadur Shah Zafar Marg, New Delhi. Tel: 0091-11-319 489\n• FRRO, 237, AJC Bose Road, Calcutta, Tel: 0091-33-247 0549\n• FRRO, Tata Press Building, 414, S.V. Marg, Mumbai. Tel: 0091-22-621 169\n• CHIO, 26, Haddows Road, Chennai, Tel: 0091-44-827 7036\n• At other places, The Superintendent of Police of the Districts are Foreigners Registration Officers\n• Certificates of registration will be issued by the registration officers. \nThe foreigners should surrender their certificates of registration to the Registration Officer of the place where they are registered or at the place from where they intend to depart or to the Immigration Office at the post/check post of exit from India. If \nthe certificates are surrendered to someone other than the Immigration officer at the post/check post of exit, then the foreigners should produce the receipt indicating such surrender to the Immigration officer at the post/check posts of exit.\n• Registration is required to be done only once during the validity of a visa irrespective of the number of times the foreigner leaves/re-enters India on a multi-entry facility. \n• Following categories of foreigners are exempted from registration: \nUS nationals holding ten-year Tourist/Business Visas provided their continuous stay during each visit does not exceed six months.Foreigners of Indian origin holding five-year multiple entry X visa with an endorsement that \"stay should not exceed six months during each visit”.Foreigners holding five-year Tourist Visas, who are actively engaged in tourist/travel trade, desirous of visiting India frequently over extended periods for promotion of tourism, etc., provided that their visa contains an endorsement that \"continuous stay\nshould not exceed six months”.Foreigners below the age of 16 years.\n• US nationals holding ten-year Tourist/Business Visas provided their continuous stay during each visit does not exceed six months.\n• Foreigners of Indian origin holding five-year multiple entry X visa with an endorsement that \"stay should not exceed six months during each visit”.\n• Foreigners holding five-year Tourist Visas, who are actively engaged in tourist/travel trade, desirous of visiting India frequently over extended periods for promotion of tourism, etc., provided that their visa contains an endorsement that \"continuous stay\nshould not exceed six months”.\n• Foreigners below the age of 16 years.\n• Foreigners can visit restricted/prohibited areas only after getting a valid permit as visa alone is not enough to visit such places.\n• Foreigners coming from or through yellow fever countries must come with valid vaccination certificate. \n• On arrival/departure, foreigners should fill up Disembarkation/Embarkation forms. \n• Acts/Rules/Circulars\n• Tenders\nWebsite content managed by XPD Division, Ministry of External Affairs; Designed & developed by M/s Silver Touch Technologies Limited; Hosted by National Informatics Centre. \nVisitors: 224104753\nPage last updated on: 22/10/2024\nWorking hours at Headquarters 9:00 A.M. To 5:30 P.M. \nSource: https://www.mea.gov.in/checklist-for-FRRO-FRO-Registration-Formalities-menu.htm"
    }
  }
}