{
  "source_file": "www.sharda.ac.in_Best_Private_Engineering_College_in_Noida_Top_Btech_Computer_Science_Enginee_raw_2025-08-10-18-29-10.txt",
  "structured_data": {
    "general_info": {
      "summary": "This document appears to be a list of categories or sections related to global knowledge seekers, their recruiters, and various guidelines or programs including banking, postal services, visa and FRO/FRRO procedures, medical insurance, and observership programs.",
      "raw_content": "Global Knowledge Seekers\nOur Recruiters\n• Our Recruiters\nBanking And Postal Services\n• Banking And Postal Services\nGuidelines for Visa and FRO/FRRO\nGuidelines for Medical Insurance\nObservership Programmes\n• Guidelines for Visa and FRO/FRRO\n• Guidelines for Medical Insurance\n• Observership Programmes"
    },
    "additional_information": {
      "summary": "The school aims to provide transformational education, fostering a skilled workforce of researchers and innovators through experiential, cooperative, and project-based learning. It emphasizes industry partnerships, Outcome-Based Education, and a Choice Based Credit System to enhance inter-disciplinary competence and leadership skills. The institution boasts excellent learning facilities, including multimedia-driven lecture halls and state-of-the-art labs, many with industry collaborations. Experienced faculty from premier institutes, alongside industry experts, deliver professional teaching and research opportunities. Strong industry-academia linkages with companies like IBM and Tech Mahindra, as well as academic tie-ups with global universities, are highlighted. The school also supports holistic student development through clubs, societies, extracurricular activities, industrial visits, and funding for student projects and international exchange programs. Key personnel from the Internal Quality Assurance Cell (IQAC) are also listed.",
      "raw_content": "• 95+\n• 135+\n• 30000+\n• 1100+\nThe goal of school, guided by the vision, is to provide transformational education that produces a skilled workforce of researchers and innovators of tomorrow with intellectual and technological resources. Our commitment and dedication is to focus on experiential, cooperative and project-based learning that allows our students to continue to adapt, grow and succeed in solving real-world problems. The school thrives to establish a partnership with industries, government organizations, & academia and become a collaborative community of faculties, students, staff and alumni to fulfil societal needs with professional ethics. The school is proactively involved in Outcome-Based Education & Choice Based Credit System to enhance inter-disciplinary competence and leadership skills among our students in a global perspective.\nSSCSE is having an excellent learning environment with multimedia driven lecture halls including lecture capturing facility and State-of-the-art laboratories and other facilities to support student learning, faculty research and academic success throughout all our academic programs. Many of these labs and centres of excellence are having collaborations with industries. The school runs different foundation/bridge courses that are required to fill the gaps among students coming from diversity and geographical areas and create a strong foundation.\nOur experienced faculties from premier institutes bring a wealth of knowledge and expertise to the classroom. Their vast industry and teaching experience coupled with their research, and skill-based training by industry experts allow our students to not only receive professional teaching but also the opportunity to work alongside their faculties on research areas of their interest.\nSSCSE is also having very good Industry Academia linkages with industries/associations like IBM, Inurture, Aries Communications, Aruba, Tech Mahindra, NASSCOM, NSDC, Savitri Telecom Services etc. apart from the academic tie-ups with top global Universities.\nThe school facilitates students in creating different clubs and societies/students-chapters at school/department level under the supervision of faculties for their holistic development through Experiential Learning. Students are helped in organizing different extra-curricular, technical activities and industrial visit etc. where all students can participate in fulfilling their dreams and broaden their horizons outside classrooms. School also offer to fund students projects under university project funding policy, support students in higher studies and in different time bounded International exchange programs with leading Global universities abroad under credit transfer system.\nFor more information, I request you to peruse our website and go through what we offer and to learn more about our departments and programs.\nDirector, Internal Quality Assurance Cell (IQAC)\n• Dr. Anil Kumar Sagar\nDr. Anil Kumar Sagar\n• Dr. Sandeep Kumar Singh\nDr. Sandeep Kumar Singh\n• Prof. (Dr.) Ajay Shriram Kushwaha\nProf. (Dr.) Ajay Shriram Kushwaha\n• Prof. (Dr.) Bhawna Mallick\nProf. (Dr.) Bhawna Mallick\n• Prof (Dr.) Shajee Mohan B S\nProf (Dr.) Shajee Mohan B S"
    }
  }
}