{
  "source_file": "www.sharda.ac.in_MA_in_Political_Science_College_Fees_Eligibility_Syllabus_Admission_raw_2025-08-10-18-29-13.txt",
  "structured_data": {
    "general_info": {
      "summary": "This document provides a list of various programs, schools, and initiatives at Sharda University, including the School of Dental Sciences, School of Medical Sciences & Research, Sharda School of Nursing Science & Research, and details on examination reports, academic credits, curricula feedback, and university brochures. It also highlights aspects of the university's perspective plan, leadership, history, statutory bodies, tenders, and legal frameworks, alongside student support services like counselling, capacity development, language and communication skills, soft skills, entrepreneurship, innovation, and an FM radio station.",
      "raw_content": "• Programme 2025-26\n• School of Dental Sciences\nSchool of Medical Sciences & Research\nSharda School of Nursing Science & Research\n• School of Medical Sciences & Research\n• Sharda School of Nursing Science & Research\nExamination Annual Report\nAcademic Bank of Credits (ABC)\nCurricula Feedback\nUniversity Brochure\n• Examination Annual Report\n• Academic Bank of Credits (ABC)\n• Curricula Feedback\n• University Brochure\n• Get to know sharda\n• Perspective Plan\n• Leadership\n• History\n• Statutory Bodies of the University\n• Sharda Tenders\n• Act, Statutes and Ordinances\n• COVID19\n• Family & Couple Counselling Services(FCCS)\n• Capacity Development & Skill Enhancement\n• Language and Communication Skill Initiatives: Sharda Skills\n• Soft Skill Initiatives : Career Counseling and Development Center\n• Awareness of Trends in Technology : IIC\n• Entrepreneurship\n• Innovation and Entrepreneurship\nFM Radio: Suno Sharda-90.8FM\n• FM Radio: Suno Sharda-90.8FM\nParamarsh- Our Mentoring Portal\n• Paramarsh- Our Mentoring Portal"
    },
    "career_path": {
      "summary": "A Master's in Political Science provides comprehensive social science training, emphasizing critical thinking, research, and ethical reasoning. This equips graduates for diverse career paths in sectors such as civil services, journalism, consulting, government, foreign service, and academia. The program is highlighted as a strong next step for those interested in humanities and social sciences.",
      "raw_content": "Career path you can choose after the course\nMasters in Political Science offers well-rounded training in social science. Apart from learning about India, Asia and the world, our curriculum focuses on critical thinking and writing, research and analysis, methodology, and ethical reasoning. These make our students good candidates for a job in many sectors, including civil services, journalism, consulting, government, the foreign service, and teaching.\nTake the next step towards a career in humanities & social sciences.\n• Recruiters\n• Our Recruiters"
    },
    "other_info": {
      "summary": "This text appears to be a list of topics, programs, and guidelines, likely related to Sharda University (SUAT). It includes references to \"SUAT 2025,\" \"Sample Papers,\" \"Global Knowledge Seekers,\" \"Banking And Postal Services,\" \"Perspective Plan,\" various guidelines for visas, medical insurance, and observerships, as well as specific university campuses (Uzbekistan, Agra), educational initiatives like \"Courses on Human Values and Professional ethics,\" and external resources such as the \"National Cyber Crime Reporting Portal\" and \"International Credit Transfer Programme.\"",
      "raw_content": "SUAT 2025\nSample Papers\n• SUAT 2025\n• Sample Papers\nGlobal Knowledge Seekers\n• Global Knowledge Seekers\nBanking And অত্যাচার Postal Services\n• Banking And Postal Services\nPerspective Plan\nGuidelines for Visa and FRO/FRRO\nGuidelines for Medical Insurance\nObservership Programmes\n• Guidelines for Visa and FRO/FRRO\n• Guidelines for Medical Insurance\n• Observership Programmes\n• Covid 19 Updates\n• Sharda University Uzbekistan\n• Sharda University Agra\n• Courses on Human Values and Professional ethics\n• National Cyber Crime Reporting Portal\n• International Credit Transfer Programme"
    }
  }
}