{
  "source_file": "www.galgotiasuniversity.edu.in_Fee_Structure_Eligibility_raw_2025-08-10-18-45-10.txt",
  "structured_data": {
    "general_info": {
      "summary": "The provided text outlines various sections related to an educational institution, likely Galgotias University. It details information for international students, including admissions, programs, scholarships, and support services. It also covers campus life aspects like clubs, NCC, NSS, sports, and events, alongside student and employee grievance redressal portals and institutional information such as leadership, awards, and policies. Specific programs like the Preparatory English Foundation Program and events like the Smart India Hackathon 2022 are also mentioned.",
      "raw_content": "• India Today Media Institute\n• International Admissions About International Office Clubs for International Students International student programs Foundation and Bridge Courses for International Students Message from Director International Relations Programmes and Fees Scholarships Eligibility Admission Process Preparatory English Foundation Program Pre & Post Arrival Information for International Students International Students Grievances Wing Visa and FRRO Support International Apply Now Contact Us FAQs Download Brochure Testimonials Events Study in India\n• Clubs for International Students\n• Foundation and Bridge Courses for International Students\n• Message from Director International Relations\n• Programmes and Fees\n• Scholarships\n• Preparatory English Foundation Program\n• Pre & Post Arrival Information for International Students\n• International Students Grievances Wing\n• Visa and FRRO Support\n• Login Employee Login Student Login LMS Login\n• Campus Life About the Campus Student Organization Societies & Clubs Hostel Library Transportation Services National Cadet Corps (NCC) National Service Scheme (NSS) Sports & Recreation Cafeteria Healthcare Facilities Unifest Events, Arts & Culture Resources & Facilities Convocation Smart India Hackathon 2022 Toycathon Launchpad\n• National Cadet Corps (NCC)\n• National Service Scheme (NSS)\n• Events, Arts & Culture\n• Smart India Hackathon 2022\n• Online Complaints Prevention of caste based discrimination at workplace committee Students Online portal for Redressal of Grievances Employee Online portal for Redressal of Grievances Anti-ragging Policy Complaint Committee for Prevention of Sexual Harassment\n• Prevention of caste based discrimination at workplace committee\n• Students Online portal for Redressal of Grievances\n• Employee Online portal for Redressal of Grievances\n• Complaint Committee for Prevention of Sexual Harassment\n• About GU About Us Galgotias University Our Legacy The Galgotias Story Leadership Governance International Academic Team Awards, Rankings & Certifications Accreditations Mandatory Disclosures Policies & Regulations Partnerships & Collaborations iOS Development Center Virtual tour\n• Galgotias University\n• Leadership\n• Awards, Rankings & Certifications\n• Partnerships & Collaborations"
    }
  }
}