{
  "source_file": "www.sharda.ac.in_IT_Services_-_Sharda_University_raw_2025-08-10-18-29-09.txt",
  "structured_data": {
    "general_info": {
      "summary": "This document appears to be a list of various departments, services, initiatives, and important links associated with an organization, likely a university named Sharda. It covers areas like recruitment, banking services, academic planning, statutory bodies, tenders, legal documents, COVID-19 information, counseling services, skill enhancement programs, innovation, entrepreneurship, and specific campus locations or related entities.",
      "raw_content": "Global Knowledge Seekers\n• Global Knowledge Seekers\nOur Recruiters\n• Our Recruiters\nBanking And Postal Services\n• Banking And Postal Services\nPerspective Plan\nLeadership\nHistory\nStatutory Bodies of the University\nSharda Tenders\nAct, Statutes and Ordinances\nCOVID19\nFamily & Couple Counselling Services(FCCS)\nCapacity Development & Skill Enhancement\nLanguage and Communication Skill Initiatives: Sharda Skills\nSoft Skill Initiatives : Career Counseling and Development Center\nAwareness of Trends in Technology : IIC\nEntrepreneurship\nInnovation and Entrepreneurship\n• Course Fee\n• Recruiters\n• Covid 19 Updates\n• Sharda University Uzbekistan\n• Sharda University Agra\n• Courses on Human Values and Professional ethics\n• National Cyber Crime Reporting Portal\n• International Credit Transfer Programme"
    },
    "it_services": {
      "summary": "Sharda University's IT Service Department provides comprehensive support, managing the campus network, data center, and internet bandwidth 24/7. They offer IT help desk support through email, phone extensions (2856/2858), and in-person visits to the SDS Building. The IT services department creates user credentials for Wi-Fi access, with a process for forgotten passwords involving OTP verification via registered mobile numbers. Users can connect to the \"WIFI_SHARDA\" SSID and log in using their provided credentials.",
      "raw_content": "IT Help Desk Support\n• IT Help Desk Support\n• How To Access Campus Wi-Fi\nSharda University has a very professional systematic support and delivery system. The purpose of\nIT Service Department of the University is to ensure that users receive appropriate help in a timely\nmanner. Our service department is staffed with trained network and system administrators who care\nfor users Laptops/Desktops and network up and running. IT service management activities – drived\nby policies, organized and structured in processes and supporting procedures – that are performed by IT\nservice department to design, plan, deliver, operate and control information technology (IT) services\noffered to customers. User’s satisfaction is our number one priority. Assigning tasks to support\nengineer throughout each work day that are based on SLAs, support engineer availability, and the\nIT service department take care Data Center Management & distribution of Internet bandwidth\nand maintained to server 24 X 7. To ensure proper connectivity and throughput a proper systematic\nlayout plan put in place (Fiber & Copper Both). Wi-Fi Network is also Design & lay in the campus for\nusers.\nTo ensure proper IT service delivery we have Helpdesk system in place, user can also approach\nover phone and mail for any type of IT support. A dedicated team of 18 skilled staff has been deputed\nin different place to deliver IT services promptly.\nIT Help Desk Support System\nFor any IT related inconvenience you can contact us through any of the following channels.\nRegister your issue by\nEmail on IT Help Desk.\nExt. Number 2856/2858\n(within office hrs. only)\nVisit to Data Center\nFirst Floor SDS Building\nSHARDA Wi-Fi Registration Process\nThe Mandatory Requirements For Wi-Fi Registration\nSYSTEM ID / EMPLOYEE ID\nEach student and employee in Sharda Campus is identified by his/her unique ID. The 10-digit student ID is provided by the Admissions cell to the students and the 7-digit Employee ID is provided by the HR to the staff.\nIT-Services create User ID and Password and share the credentials with the students and employee via email.\nForget password option is available to generate the new password.\nHow To Access Campus Wi-Fi\n• Connect with WIFI_SHARDA SSID.\n• Wi-Fi login page will pop-up now.\n• Enter the Wi-Fi login credentials shared on email to login on Wi-Fi login form.\n• Any user initiates a password reset request; they will be asked to provide their registered mobile number.\n• An OTP will be sent to the user's mobile number for verification purposes.\n• After successfully verifying the OTP, the user will be allowed to reset their password securely.\nNeed help with your IT Related Issue?\nOur customer support team is standing by to answer any questions you might have!\nContact us at ithelpdesk@sharda.ac.in or call at 2856/2858.\nFirst Floor Dental Building\nSharda University\nSource: https://www.sharda.ac.in/campuslife/itservices"
    }
  }
}