{
  "source_file": "www.sharda.ac.in_MBA_Masters_in_Business_Analytics_College_Course_Eligibility_Admission_Fe_raw_2025-08-10-18-29-14.txt",
  "structured_data": {
    "general_info": {
      "summary": "The provided text lists various sections and initiatives likely related to a university or educational institution, possibly named SUAT. Topics include sample papers, recruitment information, banking and postal services, strategic planning, leadership, university history and statutory bodies, tenders, university acts and ordinances, COVID-19 information, counseling services, capacity development, language and communication skills, soft skills, technological trends awareness, and entrepreneurship.",
      "raw_content": "SUAT 2025\nSample Papers\n• Sample Papers\nGlobal Knowledge Seekers\n• Global Knowledge Seekers\nOur Recruiters\n• Our Recruiters\nBanking And Postal Services\n• Banking And Postal Services\nPerspective Plan\nLeadership\nHistory\nStatutory Bodies of the University\nSharda Tenders\nAct, Statutes and Ordinances\nCOVID19\nFamily & Couple Counselling Services(FCCS)\nCapacity Development & Skill Enhancement\nLanguage and Communication Skill Initiatives: Sharda Skills\nSoft Skill Initiatives : Career Counseling and Development Center\nAwareness of Trends in Technology : IIC\nEntrepreneurship\nInnovation and Entrepreneurship"
    },
    "accommodation_info": {
      "summary": "This document outlines several key areas of information related to academic or professional programs. It specifically mentions the \"Accommodation Fee\" and provides \"Guidelines for Visa and FRO/FRRO\" and \"Guidelines for Medical Insurance.\" Additionally, it lists \"Observership Programmes\" as a distinct category.",
      "raw_content": "Accommodation Fee\nGuidelines for Visa and FRO/FRRO\nGuidelines for Medical Insurance\nObservership Programmes\n• Accommodation Fee\n• Guidelines for Visa and FRO/FRRO\n• Guidelines for Medical Insurance\n• Observership Programmes"
    },
    "mentoring_portal": {
      "summary": "The provided text announces 'Paramarsh' as a mentoring portal, indicating its purpose and function.",
      "raw_content": "Paramarsh- Our Mentoring Portal\n• Paramarsh- Our Mentoring Portal"
    },
    "career_path": {
      "summary": "This program offers a promising career path in management, with graduates typically placed in companies receiving average annual packages ranging from 3.52 LPA to 9.60 LPA, encouraging individuals to take the next step towards their professional goals.",
      "raw_content": "Career path you can choose after the course\nStudents of this programme are placed in companies with an average annual package of 3.52 LPA to 9.60 LPA\nTake the next step towards a career in management."
    },
    "recruiters": {
      "summary": "The provided text is a single word: \"Recruiters.\"",
      "raw_content": "Recruiters"
    }
  }
}