{
  "source_file": "www.galgotiasuniversity.edu.in_Best_Private_Law_University_College_in_India_Galgotias_University_raw_2025-08-10-18-45-12.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text appears to be a sitemap or navigation structure for Galgotias University. It lists various sections related to international admissions, campus life, academic schools, programs offered, and university information. Specific areas highlighted include international student support services, clubs, scholarships, preparatory courses, campus facilities like NCC and NSS, academic departments such as Computer Science and Artificial Intelligence, various degree programs, and administrative details like reports and copyright information.",
      "raw_content": "• India Today Media Institute\n• International Admissions About International Office Clubs for International Students International student programs Foundation and Bridge Courses for International Students Message from Director International Relations Programmes and Fees Scholarships Eligibility Admission Process Preparatory English Foundation Program Pre & Post Arrival Information for International Students International Students Grievances Wing Visa and FRRO Support International Apply Now Contact Us FAQs Download Brochure Testimonials Events Study in India\n• Clubs for International Students\n• Foundation and Bridge Courses for International Students\n• Message from Director International Relations\n• Scholarships\n• Preparatory English Foundation Program\n• Pre & Post Arrival Information for International Students\n• International Students Grievances Wing\n• Visa and FRRO Support\n• Login Employee Login Student Login LMS Login\n• Campus Life About the Campus Student Organization Societies & Clubs Hostel Library Transportation Services National Cadet Corps (NCC) National Service Scheme (NSS) Sports & Recreation Cafeteria Healthcare Facilities Unifest Events, Arts & Culture Resources & Facilities Convocation Smart India Hackathon 2022 Toycathon Launchpad\n• National Cadet Corps (NCC)\n• National Service Scheme (NSS)\n• Events, Arts & Culture\n• Smart India Hackathon 2022\n• About GU About Us Galgotias University Our Legacy The Galgotias Story Leadership Governance International Academic Team Awards, Rankings & Certifications Accreditations Mandatory Disclosures Policies & Regulations Partnerships & Collaborations iOS Development Center Virtual tour\n• Galgotias University\n• Leadership\n• Awards, Rankings & Certifications\n• Partnerships & Collaborations\n• Schools School of Defence Technology School of Computer Science & Engineering School of Artificial Intelligence School of Aviation, Logistics & Tourism Management School of Computer Applications & Technology School of Engineering School of Business School of Law View More\n• School of Defence Technology\nSchool of Defence Technology\n• School of Computer Science & Engineering\nSchool of Computer Science & Engineering\n• School of Artificial Intelligence\nSchool of Artificial Intelligence\n• School of Aviation, Logistics & Tourism Management\nSchool of Aviation, Logistics & Tourism Management\n• School of Computer Applications & Technology\nSchool of Computer Applications & Technology\n• Programs Under Graduate Programs Diploma Programs Post Graduate Programs Doctoral Programs Certificate Programs Programs for working professionals Online Courses\n• Programs for working professionals\nPrograms for working professionals\n• Online Courses\nOnline Courses\n• School of Finance and Commerce\n• School of Liberal Education\n• School of Medical and Allied Sciences\n• School of Nursing\n• School of Allied Health Sciences\n• School of Basic Sciences\n• School of Media & Communication Studies\n• School of Design\n• School of Biosciences and Technology\n• School of Vocational Education\n• School of Life Long Learning\n• Covid-19 Counselling Cell\n• ARIIA-2021\n• Tender & Vendor Registration\n• Viksit Bharat@2047: Voice of Youth\n• Internal Quality Assurance Cell (IQAC)\n• DPBH 2023\n• Galgotias University Vision 2030\n• Galgotias News Network (GNN)\n• GU Vision Plan_2030 21-01-2024\n• Annual Report-2022-23\n• Chat with an Ambassadors\n• © 2025 Copyrights Galgotias. All rights reserved.\n• Designed, developed & maintained By : City Innovates"
    },
    "placements": {
      "summary": "The provided text outlines various aspects of a placement and career development division, including its latest placements, career planning resources, associated recruiters, and engagement with recruiters and students. It also mentions placement records, an employability enhancement program, placement policies, and a placement brochure, alongside highlighting the highest performers and a placement gallery.",
      "raw_content": "• Placements Latest Placements Career Planning and Development Division (CPDD) Associated Recruiters Corporate Tie Ups Placement Records Employability Enhancement Program Placement Policy Placement Brochure Recruiters Speak Students Speak Highest Performers Placement Gallery\n• Career Planning and Development Division (CPDD)\n• Associated Recruiters\n• Recruiters Speak\n• Highest Performers"
    },
    "research_info": {
      "summary": "This document outlines the various research-related activities and initiatives at an institution, likely Galgotias University, under the purview of the Dean of Research. It details a range of operational cells, centers of excellence, event categories, recognition programs, and student projects, aiming to foster research excellence and global engagement. Key areas include publication summaries, research group activities, international collaborations, and engagement with eminent figures like Nobel laureates.",
      "raw_content": "• Research Message from Dean (Research)\nResearch Excellence and Global Engagement\nResearch & Development Cell\nGalgotias Centre for Interdisciplinary Research\nResearch Ethics Application Department wise Publication Summary Research Group Organized Events International & National Events International FDPs Research Awards Scopus Citation WoS Citation Newsletter Session with Noble Laureates DSIR - SIRO Recognition Centres of Excellence Media Outreach Research Group Diversity Open House Project for Students Honorary Professors Best Practices G-MRDC Centre of Excellence for Semiconductor Research\n• Message from Dean (Research)\n• Research Excellence and Global Engagement\n• Research & Development Cell\n• Galgotias Centre for Interdisciplinary Research\n• Department wise Publication Summary\n• Research Group Organized Events\n• International & National Events\n• Session with Noble Laureates\n• DSIR - SIRO Recognition\n• Research Group Diversity\n• Open House Project for Students\n• Honorary Professors\n• Centre of Excellence for Semiconductor Research\n"
    },
    "school_of_law_info": {
      "summary": "The School of Law at Galgotias University, established in 2012, is a highly-ranked institution recognized for its comprehensive legal education. It offers undergraduate and postgraduate programs, including LL.M. and doctoral research, with specializations in various legal fields. The school emphasizes a multi-disciplinary approach, practical skill development through extracurriculars and outreach initiatives like legal aid clinics, and strong industry-academia partnerships. It boasts distinguished faculty, regular visits from legal luminaries, and successful placement opportunities for its students, aiming to produce socially relevant, techno-conversant, and legally sound legal professionals.",
      "raw_content": "Department of Legal Studies\nRanked 3rd in UP and 11th in India\nby India Today- MDRA survey 2023\n3rd Position\nAll India CSR - GHRDC LAW SCHOOL SURVEY, 2022\nCertificate courses\nBy Renowned Legal Experts\n3 consecutive years\nAwarded as Emerging Legal Aid Clinic by Knowledge Steez LLP and Droit Penale\nUnder highly acclaimed supreme court and high court advocates\n• Message from the Dean\n• Faculty Members\n• Galgotias Journal of Legal Studies\n• Legal Database and Library\n• Training & Industry Visits\n• International Conference on Comparative Law\n• Professor of Practice and Adjunct Faculty\nMessage from the Dean\nProf. (Dr.) Aditya Tomer\nI welcome you to the School of Law at Galgotias University!\nThe Law school, established in 2012, has rapidly evolved into a prominent center of legal education, nurturing legal professionals with a strong presence at the national level. Our guidance comes from an illustrious team, including Professor Emeritus Justice JR Midha, Rodney D. Ryder, Shri Pawan Reley and many other distinguished judges, advocates, and academicians.\nThe school of Law has been a pioneer in grooming modern day legal professionals with a multi-disciplinary approach. It offers undergraduate programs like B.A.LL.B.(Hons) and B.B.A.LL.B.(Hons), along with a three-year LL.B. program, with specializations in areas such as Corporate Law, Intellectual Property Law, Criminal Law, and Constitutional Law. The objective is to create lawyers who are not only professionally adept but also attuned to the needs of society and the industry. The institution further provides a one-year LL.M. postgraduate program and opportunities for doctoral research, focusing on comprehensive research work.\nThe school of Law focuses on both knowledge sharing and honing practical skills through a variety of extra-curricular activities and specialized Value-Added courses. The school actively engages in various outreach initiatives including the Legal Aid and Mediation Centre with trained Para-legal Volunteers, Disability Rights Clinic and the adoption of the Village Dankaur in the District, among others.\nGUSOL is committed to fostering Industry-Academia orientation and partnerships with national and international Law Firm and Professionals. Many legal luminaries including professionals, judges and advocates of Supreme Court, High Court and Tribunals, corporate legal experts regularly visit the school and share insights on the legal profession and interact with the law students.\nThe school regularly hosts events like Moot Court competitions, Trial Advocacy Competitions and other events with significant achievements recognised by notable figures like India’s current Law Minister, Mr. Kiren Rijuju.\nThe Placement and Internship Cell works assiduously to provide the best placement opportunities to match the skills and interests of the students. Many of our students have interned at Tier-I Law firms and received pre-placement offers from reputed law firms.\nThe faculty comes from prestigious institutions like National Law Schools, University of Delhi, South Asian University, Jamia Millia Islamia and eminent Liberal Arts Institutions. The School of Law has adopted a multi-disciplinary approach to integrate the legal knowledge which helps in chiseling the legal professionals.\nWe at the School of Law leave no stone unturned in shaping the budding lawyers who are socially relevant, techno-conversant and legally sound.\n"
    },
    "complaints_and_grievances": {
      "summary": "This text outlines various committees and online portals established to address specific issues within an organization or educational institution. These include mechanisms for preventing caste-based discrimination in the workplace, redressal of student and employee grievances through online portals, an anti-ragging policy, and a committee dedicated to preventing sexual harassment.",
      "raw_content": "• Online Complaints Prevention of caste based discrimination at workplace committee Students Online portal for Redressal of Grievances Employee Online portal for Redressal of Grievances Anti-ragging Policy Complaint Committee for Prevention of Sexual Harassment\n• Prevention of caste based discrimination at workplace committee\n• Students Online portal for Redressal of Grievances\n• Employee Online portal for Redressal of Grievances\n• Complaint Committee for Prevention of Sexual Harassment\n"
    },
    "event_info": {
      "summary": "This text indicates information pertaining to the years 2023 and 2024, labeled as SIH.",
      "raw_content": "• SIH -2023 and 2024"
    }
  }
}