{
  "source_file": "www.galgotiasuniversity.edu.in_International_Students_Grievances_wing_raw_2025-08-10-18-45-10.txt",
  "structured_data": {
    "general_info": {
      "summary": "This text appears to be a footer or a collection of links and information from the Galgotias University website. It includes a link to the UGC Public Self Portal, the GU Vision Plan for 2030, the Annual Report for 2022-23, an option to chat with ambassadors, copyright information for 2025, and details about the design and maintenance of the site by City Innovates, with a provided source URL.",
      "raw_content": "UGC PUBLIC SELF PORTAL\n• GU Vision Plan_2030 21-01-2024\n• Annual Report-2022-23\n• Chat with an Ambassadors\n• © 2025 Copyrights Galgotias. All rights reserved.\n• Designed, developed & maintained By : City Innovates\nSource: https://www.galgotiasuniversity.edu.in/p/international-students-grievances-wing"
    },
    "campus_life": {
      "summary": "The provided text outlines various aspects of campus life, including student organizations, hostels, library services, transportation, and recreational activities. It specifically highlights the National Cadet Corps (NCC), National Service Scheme (NSS), and events related to arts and culture, as well as mentioning the Smart India Hackathon 2022 and Toycathon.",
      "raw_content": "• Campus Life About the Campus Student Organization Societies & Clubs Hostel Library Transportation Services National Cadet Corps (NCC) National Service Scheme (NSS) Sports & Recreation Cafeteria Healthcare Facilities Unifest Events, Arts & Culture Resources & Facilities Convocation Smart India Hackathon 2022 Toycathon Launchpad\n• National Cadet Corps (NCC)\n• National Service Scheme (NSS)\n• Events, Arts & Culture\n• Smart India Hackathon 2022"
    },
    "grievances": {
      "summary": "International students can submit grievances, both academic and non-academic, via email to the International Relations Office (IRO). The IRO is dedicated to resolving these issues by collaborating with relevant departments and senior management.  Academic concerns include examinations, attendance, transfer certificates, migration, and fee payments, while non-academic matters cover bonafide certificates, bank accounts, SIM card registration, visa extensions, and medical/health issues.",
      "raw_content": "Any International student can submit his/her grievance through mail to the office of the International Relations ,International relations office is committed to resolve students issues with the help and coordination of concerned departments and top management .\nThe IRO office deals with international students grievances received in writing from International Students for Academic& Non Academic Matters–\nAcademic issues -related to examination, attendance Transfer Certificate, Migration and Fee payment\nNon Academic issues – Bonafide , bank Account opening, Sim card Registration ,Visa extension, Medical and Health related issues ."
    },
    "schools": {
      "summary": "This list details various academic schools, including Finance and Commerce, Liberal Education, Medical and Allied Sciences, Nursing, Allied Health Sciences, Basic Sciences, Media & Communication Studies, Design, Biosciences and Technology, Vocational Education, and Life Long Learning.",
      "raw_content": "• School of Finance and Commerce\n• School of Liberal Education\n• School of Medical and Allied Sciences\n• School of Nursing\n• School of Allied Health Sciences\n• School of Basic Sciences\n• School of Media & Communication Studies\n• School of Design\n• School of Biosciences and Technology\n• School of Vocational Education\n• School of Life Long Learning"
    },
    "programs": {
      "summary": "This document lists various academic program categories, including undergraduate, diploma, postgraduate, doctoral, and certificate programs. It specifically highlights programs designed for working professionals and also mentions online courses as a distinct offering.",
      "raw_content": "• Programs Under Graduate Programs Diploma Programs Post Graduate Programs Doctoral Programs Certificate Programs Programs for working professionals Online Courses\n• Programs for working professionals\nPrograms for working professionals\n• Online Courses\nOnline Courses"
    },
    "fee_structure_and_eligibility": {
      "summary": "This document outlines various aspects of an educational institution's offerings, including its fee structure, eligibility criteria, scholarship opportunities, hostel facilities, and options for lateral entry or migration. It also details the availability of financial aid and loan facilities.",
      "raw_content": "Fee Structure & Eligibility Scholarships Hostel Lateral Entry/Migration Admission Financial Aid & Loan Facilities\n• Fee Structure & Eligibility\n• Financial Aid & Loan Facilities\n"
    },
    "admission_process": {
      "summary": "This text appears to be a list of administrative and service-related categories, likely from an educational institution's website or information packet. It includes topics such as admission documents, approvals, transportation, Ph.D. admissions, refund policies, brochure downloads, and a helpline.",
      "raw_content": "Admission Documents & Undertaking Approvals & Accreditations Transportation Services Ph.D Admission Refund Policy Download Brochure Admission Helpline"
    },
    "research": {
      "summary": "This text outlines key areas and initiatives related to research excellence and global engagement at an institution. It lists various departments, centers, and activities, including research ethics, publication summaries, organized events, collaborations with Nobel laureates, and specific research centers like the Centre of Excellence for Semiconductor Research.",
      "raw_content": "• Research Message from Dean (Research)\nResearch Excellence and Global Engagement\nResearch & Development Cell\nGalgotias Centre for Interdisciplinary Research\nResearch Ethics Application Department wise Publication Summary Research Group Organized Events International & National Events International FDPs Research Awards Scopus Citation WoS Citation Newsletter Session with Noble Laureates DSIR - SIRO Recognition Centres of Excellence Media Outreach Research Group Diversity Open House Project for Students Honorary Professors Best Practices G-MRDC Centre of Excellence for Semiconductor Research\n• Message from Dean (Research)\n• Research Excellence and Global Engagement\n• Research & Development Cell\n• Galgotias Centre for Interdisciplinary Research\n• Department wise Publication Summary\n• Research Group Organized Events\n• International & National Events\n• Session with Noble Laureates\n• DSIR - SIRO Recognition\n• Research Group Diversity\n• Open House Project for Students\n• Honorary Professors\n• Centre of Excellence for Semiconductor Research"
    },
    "academics": {
      "summary": "The provided text lists various academic-related sections and initiatives within an educational institution. These include the academic calendar, learning model, choice-based credit system, MOUs, curriculum design and development, the examination cell, NEP-2020, downloadable forms, holiday lists, and achievements.",
      "raw_content": "• Academics Academics Academic Calendar Learning Model & Choice Based Credit System MOUs Curriculum Design and Development Examination Cell NEP-2020 Download Forms Awards Holiday List Achievements\n• Learning Model & Choice Based Credit System\n• Curriculum Design and Development\n• NEP-2020"
    },
    "placements": {
      "summary": "This text outlines various aspects of a career planning and placement division, including information on latest placements, career planning and development, associated recruiters, placement records, employability enhancement programs, placement policies, brochures, and feedback from recruiters and students, as well as highlighting highest performers.",
      "raw_content": "• Placements Latest Placements Career Planning and Development Division (CPDD) Associated Recruiters Corporate Tie Ups Placement Records Employability Enhancement Program Placement Policy Placement Brochure Recruiters Speak Students Speak Highest Performers Placement Gallery\n• Career Planning and Development Division (CPDD)\n• Associated Recruiters\n• Recruiters Speak\n• Highest Performers"
    },
    "other_services": {
      "summary": "This text provides a list of various cells, initiatives, and services offered, likely by an educational institution. It includes a COVID-19 counselling cell, admission and education loan assistance, participation in ARIIA-2021 and SIH-2023/2024, tender and vendor registration, the Viksit Bharat@2047 initiative, an Internal Quality Assurance Cell (IQAC), the DPBH 2023 program, Galgotias University's Vision 2030, and the Galgotias News Network (GNN), alongside a mention of fees payment.",
      "raw_content": "• Covid-19 Counselling Cell\n• Admission & Education Loan Assistance\n• ARIIA-2021\n• Tender & Vendor Registration\n• Viksit Bharat@2047: Voice of Youth\n• Internal Quality Assurance Cell (IQAC)\n• DPBH 2023\n• Galgotias University Vision 2030\n• Galgotias News Network (GNN)\n• Fees Payment\n• SIH -2023 and 2024"
    }
  }
}