{
  "source_file": "www.galgotiasuniversity.edu.in_About_Us-ieee-ias_raw_2025-08-10-18-45-12.txt",
  "structured_data": {
    "general_info": {
      "summary": "This document provides a comprehensive overview of Galgotias University, detailing its offerings for international students, campus life, student support services, and academic structure. It highlights various schools, programs, admission processes, and resources available to students, as well as information regarding university governance, achievements, and news. The content also includes important links and contact information, along with copyright details.",
      "raw_content": "• India Today Media Institute\n• International Admissions About International Office Clubs for International Students International student programs Foundation and Bridge Courses for International Students Message from Director International Relations Programmes and Fees Scholarships Eligibility Admission Process Preparatory English Foundation Program Pre & Post Arrival Information for International Students International Students Grievances Wing Visa and FRRO Support International Apply Now Contact Us FAQs Download Brochure Testimonials Events Study in India\n• Clubs for International Students\n• Foundation and Bridge Courses for International Students\n• Message from Director International Relations\n• Scholarships\n• Preparatory English Foundation Program\n• Pre & Post Arrival Information for International Students\n• International Students Grievances Wing\n• Visa and FRRO Support\n• Login Employee Login Student Login LMS Login\n• Campus Life About the Campus Student Organization Societies & Clubs Hostel Library Transportation Services National Cadet Corps (NCC) National Service Scheme (NSS) Sports & Recreation Cafeteria Healthcare Facilities Unifest Events, Arts & Culture Resources & Facilities Convocation Smart India Hackathon 2022 Toycathon Launchpad\n• National Cadet Corps (NCC)\n• National Service Scheme (NSS)\n• Events, Arts & Culture\n• Smart India Hackathon 2022\n• Online Complaints Prevention of caste based discrimination at workplace committee Students Online portal for Redressal of Grievances Employee Online portal for Redressal of Grievances Anti-ragging Policy Complaint Committee for Prevention of Sexual Harassment\n• Prevention of caste based discrimination at workplace committee\n• Students Online portal for Redressal of Grievances\n• Employee Online portal for Redressal of Grievances\n• Complaint Committee for Prevention of Sexual Harassment\n• About GU About Us Galgotias University Our Legacy The Galgotias Story Leadership Governance International Academic Team Awards, Rankings & Certifications Accreditations Mandatory Disclosures Policies & Regulations Partnerships & Collaborations iOS Development Center Virtual tour\n• Galgotias University\n• Leadership\n• Awards, Rankings & Certifications\n• Partnerships & Collaborations\n• Schools School of Defence Technology School of Computer Science & Engineering School of Artificial Intelligence School of Aviation, Logistics & Tourism Management School of Computer Applications & Technology School of Engineering School of Business School of Law View More\n• School of Defence Technology\nSchool of Defence Technology\n• School of Computer Science & Engineering\nSchool of Computer Science & Engineering\n• School of Artificial Intelligence\nSchool of Artificial Intelligence\n• School of Aviation, Logistics & Tourism Management\nSchool of Aviation, Logistics & Tourism Management\n• School of Computer Applications & Technology\nSchool of Computer Applications & Technology\n• Programs Under Graduate Programs Diploma Programs Post Graduate Programs Doctoral Programs Certificate Programs Programs for working professionals Online Courses\n• Programs for working professionals\nPrograms for working professionals\n• Online Courses\nOnline Courses\n• Admission Financial Aid & Loan Facilities\n• Admission Documents & Undertaking Approvals & Accreditations Transportation Services Ph.D Admission Refund Policy Download Brochure Admission Helpline\n• Admission Documents & Undertaking\n• Galgotias University Vision 2030\n• Galgotias News Network (GNN)\n• SIH -2023 and 2024\n• UGC PUBLIC SELF PORTAL\n• GU Vision Plan_2030 21-01-2024\n• Annual Report-2022-23\n• Chat with an Ambassadors\n• © 2025 Copyrights Galgotias. All rights reserved.\n• Designed, developed & maintained By : City Innovates\nSource: https://www.galgotiasuniversity.edu.in/p/About-Us-ieee-ias"
    },
    "research": {
      "summary": "This document outlines the various initiatives and departments associated with research excellence and global engagement at an institution, likely Galgotias. It details specific areas such as a Research & Development Cell, an Interdisciplinary Research Centre, publication summaries, organized events, international collaborations, recognition for research, and specific centres of excellence.",
      "raw_content": "• Research Message from Dean (Research)\nResearch Excellence and Global Engagement\nResearch & Development Cell\nGalgotias Centre for Interdisciplinary Research\nResearch Ethics Application Department wise Publication Summary Research Group Organized Events International & National Events International FDPs Research Awards Scopus Citation WoS Citation Newsletter Session with Noble Laureates DSIR - SIRO Recognition Centres of Excellence Media Outreach Research Group Diversity Open House Project for Students Honorary Professors Best Practices G-MRDC Centre of Excellence for Semiconductor Research\n• Message from Dean (Research)\n• Research Excellence and Global Engagement\n• Research & Development Cell\n• Galgotias Centre for Interdisciplinary Research\n• Department wise Publication Summary\n• Research Group Organized Events\n• International & National Events\n• Session with Noble Laureates\n• DSIR - SIRO Recognition\n• Research Group Diversity\n• Open House Project for Students\n• Honorary Professors\n• Centre of Excellence for Semiconductor Research"
    },
    "placements": {
      "summary": "The provided text outlines various aspects of career planning and placement services, including information on the Career Planning and Development Division (CPDD), associated recruiters, placement records, employability enhancement programs, placement policies, and testimonials from both recruiters and students, along with highlighting highest performers.",
      "raw_content": "• Placements Latest Placements Career Planning and Development Division (CPDD) Associated Recruiters Corporate Tie Ups Placement Records Employability Enhancement Program Placement Policy Placement Brochure Recruiters Speak Students Speak Highest Performers Placement Gallery\n• Career Planning and Development Division (CPDD)\n• Associated Recruiters\n• Recruiters Speak\n• Highest Performers"
    },
    "organization_details": {
      "summary": "The GU IEEE IAS Student Branch Chapter, established on October 23rd, 2024, at Galgotias University, serves as the official student chapter for the IEEE Industry Applications Society. Its mission is to provide students with a platform to explore industrial applications of engineering, develop leadership and technical skills, and foster industry-academia collaboration through events, visits, and challenges, ultimately aiming to transform students into industry innovators.",
      "raw_content": "Established on 23rd October 2024, the GU IEEE IAS Student Branch Chapter operates under the umbrella of the IEEE Student Branch at Galgotias University. As the official technical society affiliated with the global IEEE Industry Applications Society (IAS), our chapter provides a dynamic platform for students to delve into real-world industrial applications of engineering and technology. We are dedicated to nurturing student leadership, enhancing industry-relevant technical skills, and promoting global collaboration through impactful initiatives such as technical events, industrial visits, and innovation challenges. With a vision to bridge the gap between academia and industry, we strive to empower students to become future-ready professionals, equipped with the expertise and experience required to excel in industrial settings.\n“Transforming students into industry innovators.”"
    },
    "school_details": {
      "summary": "The provided text lists various academic schools within an institution, encompassing diverse fields such as finance, commerce, liberal arts, medical sciences, nursing, allied health, basic sciences, media, communication, design, biosciences, technology, vocational education, and lifelong learning.",
      "raw_content": "• School of Finance and Commerce\n• School of Liberal Education\n• School of Medical and Allied Sciences\n• School of Nursing\n• School of Allied Health Sciences\n• School of Basic Sciences\n• School of Media & Communication Studies\n• School of Design\n• School of Biosciences and Technology\n• School of Vocational Education\n• School of Life Long Learning"
    },
    "financial_aid": {
      "summary": "The provided text outlines two key financial services: assistance with admissions and education loans, and general financial aid and loan facilities. These services likely aim to support individuals in accessing and funding their educational pursuits.",
      "raw_content": "• Admission & Education Loan Assistance\n• Financial Aid & Loan Facilities\n"
    },
    "certifications": {
      "summary": "The provided text consists of a single bullet point, \"• ARIIA-2021,\" which likely refers to an event or initiative related to the ARIIA framework in the year 2021.",
      "raw_content": "• ARIIA-2021"
    },
    "procurement": {
      "summary": "This text briefly lists \"Tender & Vendor Registration\" as a topic or service.",
      "raw_content": "• Tender & Vendor Registration"
    },
    "government_initiatives": {
      "summary": "The provided text is a title or heading, \"Viksit Bharat@2047: Voice of Youth\", which likely refers to an initiative or campaign related to India's development by the year 2047, specifically highlighting the role and perspective of young people.",
      "raw_content": "• Viksit Bharat@2047: Voice of Youth"
    },
    "quality_assurance": {
      "summary": "The text refers to an Internal Quality Assurance Cell (IQAC).",
      "raw_content": "• Internal Quality Assurance Cell (IQAC)"
    },
    "events": {
      "summary": "The provided text is a simple notation, possibly an identifier or a reference, consisting of the acronym \"DPBH\" followed by the year \"2023\".",
      "raw_content": "• DPBH 2023"
    }
  }
}